{
    "id": "chapter-70",
    "title": "Is it a Sin to be Hugged by an Overly Cute and Attractive Beautiful Girl?",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "“―Ehehe~”",
        "Charlotte-san has been smiling happily ever since I gave her the pair of rings I bought at the accessory store.",
        "She was playing with the silver ring on her chest with a smiling face.",
        "I couldn’t help but find her loose, tight expression cute.",
        "I would much rather look at her face than look around the store.",
        "………………Well, Charlotte-san forgot to bury her face in my arms, so people around us are looking at her like crazy…",
        "I looked at Charlotte-san and she had a sloppy look on her face and then she looked at me next to her as if I were a parent.",
        "I’ve never done anything wrong, so why should I be looked at like this?",
        "Is that it?",
        "Is it a sin to be hugged by an overly cute and attractive beautiful girl?",
        "“Aoyagi-kun, thank you very much… I’m very happy right now…”",
        "When I was troubled by the jealousy-filled gaze, Charlotte-san, her cheeks dyed red, thanked me with an upward glance.",
        "She stares at me with troubled eyes as if she has a fever.",
        "…Yeah, it might be a sin.",
        "If I were to be hugged by such a cute girl, I would be resented by everyone around me.",
        "“I’m glad you’re happy.”",
        "“Yes, I’m really happy…”",
        "Charlotte-san exhaled a feverish breath as she rested her head on my shoulder.",
        "I’m very happy that she’s happy, but I’m troubled that she’s showing me this right now.",
        "It’s the same with the intensifying jealous glances around me― well, yeah, there’s a lot to be said for men…",
        "If you think about it, even Charlotte-san’s breasts are against my arm,…….",
        "“Is there something that I could help you with…?”",
        "When I was alone in my agony, Charlotte-san looked into my face as if she was worried about me.",
        "I couldn’t help but gulp as her cute face that I’ve been admiring was right in front of me.",
        "I felt bad for making her worry about me, but I’m really at my wits end.",
        "“………..I’m getting thirsty… Let’s go to a cafe.”",
        "I managed to squeeze my voice out of my throat, which was parched with tension.",
        "I need to cool my head down a bit.",
        "“Yes, it’s kind of hot today…”",
        "Charlotte-san agreed with me, but it must be very hot to be wearing light clothes in autumn.",
        "It’s in a department store, so the heaters are working, but it’s still not warm enough.",
        "But to be honest, I’m also burning and hot.",
        "Maybe the heating system is a little out of adjustment, I don’t know.",
        "“””””―It’s your fault that it’s hot…!”””””",
        "As we moved along, the buzzing sound around us seemed to intensify, but there was nothing I could do about it, so I pretended not to hear it and walked on by.",
        "◆",
        "―We were looking at the menu and trying to decide what to order when we came to an American café that was now a nationwide chain.",
        "Even though it was a famous restaurant, we had never been here before and honestly didn’t know what to order.",
        "The reason was that Charlotte-san hadn’t been in Japan for very long, but she hadn’t been to one when she was in England either.",
        "Even when she was over there, she was busy taking care of Emma-chan.",
        "“Charlotte-san, have you decided which one you want?”",
        "“Umm… I’m a little overwhelmed with all the things to choose from… so…”",
        "“I see. You should take your time. Fortunately, there are no customers behind you.”",
        "I’ve heard from Akira before that this café gets very crowded, but we were lucky and there was not a single customer behind us.",
        "If there were people waiting behind us, we wouldn’t be able to take our time choosing, but this way we could take our time and not bother anyone.",
        "The shopkeeper seemed to be admiring Charlotte-san, so there would be no problem.",
        "In fact, it would be better for the shopkeeper if she took her time to think about it.",
        "A cute girl is a feast for the eyes, I guess.",
        "….But when you look at my face, can you please stop looking at me with murderous intent in your eyes?",
        "That’s not a good look for a shopkeeper to have, that’s just…",
        "“―I’ve decided…! I’ll take this white chocolate…!”",
        "Apparently, while I was communicating with the shopkeeper with my eyes, Charlotte-san decided what she wanted.",
        "Surprisingly, she didn’t choose anything out of the ordinary.",
        "It’s just that the name is ordinary, but it looks like a very sweet drink.",
        "It’s a liquid that looks like melted white chocolate with whipped cream and white chocolate chips on top.",
        "It’s hot, and just thinking about it makes my mouth water.",
        "I knew Charlotte-san liked this kind of sweet stuff.",
        "It’s a little surprising, since at school she seems to have a more mature atmosphere.",
        "However, Charlotte-san is quite childish when she meets people outside of school, so it seems like a good match for her.",
        "In short, anything is fine with her.",
        "I decided to have matcha milk for some reason.",
        "To be honest, I wasn’t sure if I wanted the blended coffee, but I decided to go for it because I hadn’t had matcha milk in a while.",
        "I like matcha, and sometimes I feel like drinking it.",
        "―After receiving the drinks we ordered, we headed for the window seat.",
        "I’m sure walking around too much will put a strain on Charlotte-san, so we should just take a short break.",
        "Besides, there was something I wanted to ask her if I had the chance.",
        "“You know, Charlotte-san, why did you come to Japan?”",
        "Since we were taking a break, I asked her what I had been wondering.",
        "In the beginning, I was hesitant to ask because I didn’t want to get in trouble if there was some reason, but now I know that at least she didn’t come to Japan for some dark reason, so it shouldn’t be a problem to ask.",
        "“Well―”",
        "She didn’t show any displeasure at my sudden question, and meditated with her index finger over her mouth.",
        "It seems she’s trying to remember.",
        "Then Charlotte-san began to talk to me as if she was slowly recalling the past.",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Editor’s Comment: It’s ya boi, that certain bitter to love life Editor-san and I’ve finally made a ko-fi account! As always, We’re glad that you’ve been enjoying our translation (and AJ’s been torturing me for a while please help me-) and supporting us. From now on, we will do our best to give you a high quality translations and will keep supporting us. Oh, and the goal of my kofi is to buy a new phone so that I could say goodbye to this potato one that keeps crashing everytime I try to edit :v",
        "Until then, watch me as I suffer keeping up with AJ’s tl.",
        "Ko-fi link: https://ko-fi.com/matsu622",
        "Translator’s Comment: I’m not sorry to Matsu that I’ve done this lmfao. Help us reach our goal guys! I’m also about to finish my laptop goal soon, after this, I’ll let Matsu have the donos for a bit for overworking him too much xD https://ko-fi.com/aj1703"
    ]
}