{
    "id": "chapter-85",
    "title": "Things Even a Kind Girlfriend Can't Forgive",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Charlotte’s POV**)",
        "“―Mouu~! Mou~! Mom, you idiot! Mom’s an idiot!”",
        "I was complaining about Mom to myself as I moved the many books I had hidden in my room to another place.",
        "It’s not bad enough to find out what her daughter is hiding, but to expose it in front of the maid of all people is terrible.",
        "I’ll have to complain to her when she comes back or I won’t be able to contain my anger.",
        "At any rate, I’ll have to put them in a safer place later and keep my mother’s hands off it…!",
        "―After I finished hiding the books, I took a break.",
        "I don’t want to get too upset, and I also don’t want to look like this when I meet Akito-kun.",
        "It’s also necessary to calm down.",
        "“…Anyways, is Akito-kun not done yet…? …Oh, when did I get a message?”",
        "I checked my phone and before I knew it, I had received a message from Akito-kun.",
        "It’s rare for my ears not to notice that a message has arrived, but maybe it arrived when I shouted earlier.",
        "And when I checked the message― I was gobsmacked and depressed.",
        "“A-Akito-kun… even though we were supposed to meet alone… but that’s not possible now, huh…”",
        "The message I received from Akito-kun was that he suddenly couldn’t come over.",
        "It was a so-called “cancellation”.",
        "What is it, Akito-kun?",
        "If Emma is gone, do I have no use for you?",
        "I’m going to cry, you know?",
        "Is it okay to cry?",
        "I had been in a grumpy mood after the incident with my mother earlier, and Akito-kun’s cancellation made me sulk even further.",
        "However, I soon realized that something was wrong.",
        "It was that he had cancelled on me.",
        "There was no way that Akito-kun didn’t understand what it meant that Emma was ready to play and then he cancelled.",
        "It was obvious that Emma would cry, scream and things would get out of hand.",
        "So he will do his best to keep his promise to Emma, and even if he can’t, he will come and tell her directly since we’re neighbors.",
        "And he would have to appease Emma somehow so that she wouldn’t get angry, but it was impossible for him to just end it with this message, considering his personality.",
        "Maybe something terrible happened to him.",
        "I tried calling Akito-kun to see if he was available.",
        "The phone rings, but he doesn’t pick up at all.",
        "I knew something was wrong.",
        "“…………”",
        "I thought about it for a while and decided to go to Akito-kun’s room just to be sure.",
        "If he’s already out, I don’t have a choice, but if he’s in, I’d like to ask him what’s going on.",
        "Since I’m already his girlfriend, it wouldn’t be so bad for me to visit him, right?",
        "At least, Akito-kun wouldn’t mind.",
        "With that in mind, I quickly got dressed in the boyish clothes I had bought yesterday so that I could go on a date with him, and went to his room.",
        "Then I rang the intercom, but there was no sign of Akito-kun coming out.",
        "“Has he gone out already…?”",
        "I rang the intercom one more time.",
        "However, there was still no sign of Akito-kun coming out, so he might have already gone out.",
        "“It’s no use, he was in such a hurry which means― hmm?”",
        "As I was about to give up and go back to my room, I noticed that the door to his room was not closed properly.",
        "The door seemed to be sticking out halfway, which was absolutely impossible for Akito-kun, who is a firm person.",
        "He would never leave the door unlocked when leaving the room, no matter how much he was in a hurry.",
        "Therefore, it was also impossible that the door was not closed properly.",
        "“―Akito-kun?”",
        "After thinking about it, I thought it was strange, so I slowly opened the door, though it was not polite to do so.",
        "I opened the door slowly, and the moment I checked inside, the blood drained from my veins.",
        "What I saw when I opened the door was the figure of Akito-kun, sitting on the wall with his head down.",
        "“A-Akito-kun!? W-What happened to you!?”",
        "I immediately took off my shoes and ran over to him.",
        "And when I looked into Akito-kun’s face, I was even more surprised.",
        "“He was crying…?”",
        "It seemed that Akito-kun was just sleeping, but there were tears streaming from his eyes on both cheeks.",
        "I can’t help but wonder if he had some kind of scary dream― or if there was some other reason.",
        "There was one more thing that I noticed.",
        "“This faint smell of perfume… does not belong to Akito-kun…”",
        "He usually smells very nice, but he doesn’t wear any kind of perfume.",
        "So it’s strange that he smells like perfume, and I know what it smells like because I just smelled it.",
        "“This perfume smell… it’s the one that the maid was wearing earlier…”",
        "This made everything connect in my mind.",
        "The door of Akito-kun’s room was not closed properly because he did not open it, but because someone else entered from the outside and did not close it properly.",
        "And from the smell of the perfume, the person who came in was most likely that maid.",
        "She must have done it on purpose.",
        "Her aim was to make me feel uncomfortable by not closing the door, so that I could enter.",
        "If the door had been closed, I would have returned to my room without opening it to see if it was locked or not.",
        "Why did she want to let me in so badly― I think it has something to do with Akito-kun’s current condition.",
        "Mom was verbally guiding me to go to this room, and I directly confirmed that she was connected to that maid.",
        "And Yamato Nadeshiko-san, whom the maid had been keeping company with, and mom’s meaningful advice.",
        "“…This is really, unforgivable.”",
        "I don’t know what they’re trying to do, but the fact that Akito-kun is crying means that he’s been hurt.",
        "No matter what the reason, I am not so forgiving as to laugh at him for hurting me.",
        "So, I immediately called Mom.",
        "But all I got from my phone was a message saying that the number I had dialed could not be connected.",
        "“Call blocked!? Do you really want to go that far, Mom…!?”",
        "I couldn’t help but be surprised at Mom’s unbelievable decision to block her daughter’s calls.",
        "She was probably expecting me to call her, but I really didn’t understand what she was trying to do.",
        "However, there was no point in complaining now since the phone was unreachable.",
        "What’s more important is that I have to take care of Akito-kun.",
        "“Please wake up, Akito-kun… If you fall asleep here, you’ll hurt yourself, you know…?”",
        "I wiped his tears with my handkerchief and gently rocked his body."
    ]
}