{
    "id": "chapter-77",
    "title": "She's so Sweet as if She Had a Fever",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "Emma-chan seemed to sense that she was being left behind even though she was very young because not only was Charlotte-san not home, but I wasn’t either.",
        "It was already late at night and I was going to leave her when I got home, but as soon as Charlotte-san unlocked the door, Emma-chan ran out.",
        "Then, when I thought she was crying and hugging me, she called out, “I hate Lottie!”",
        "I moved her to my room because she was making too much noise, but after that, she wouldn’t leave me at all.",
        "Then she buried her face in my chest and called out, “I hate Lottie!” repeatedly.",
        "In the end, she was so tired of crying that she fell asleep, but I’m sure she’ll be mad again tomorrow morning when she wakes up.",
        "I might as well prepare a lot of sweets while I can.",
        "“I did what I did because I knew she would cry and get angry. I’m really the worst… I’m sorry, Aoyagi-kun. I even got you involved with this…”",
        "“No, I’m just as guilty as you, so it’s not all Charlotte-san’s fault. Rather, I’m sorry that she’s only angry towards you…”",
        "Emma-chan was more lenient with me than angry.",
        "So I just used my power to make her stop crying, and the only one affected was Charlotte-san.",
        "“‘I don’t think she will ever be angry with Aoyagi-kun. I’m sure she’d rather tell you to spoil her than get angry.”",
        "Charlotte said with a half-joking laugh, but her smile lacked power.",
        "She must be very tired of Emma-chan repeatedly telling her she hates her.",
        "“…………”",
        "“Aoyagi-kun…?”",
        "As I stand up, Charlotte-san looks up at me curiously.",
        "Then she hurriedly tried to stand up, but I stopped her with my hand.",
        "“It’s okay, I’m just going to put Emma-chan under the covers. There’s something you don’t want her to hear, right?”",
        "“Oh…”",
        "Charlotte, who is very perceptive, understood what I was trying to say and fell silent, looking uncomfortable.",
        "From the look of this, it seems that she was aware of what she was doing…",
        "I was familiar with Charlotte-san’s powerless smile.",
        "It’s the kind of smile that Aki sometimes shows.",
        "Aki is a kind and gentle person who has a habit of forcing herself to accept that whatever happened was her fault instead of blaming someone else.",
        "The smile she shows when she does this is exactly the same as the one Charlotte-san just showed me.",
        "Charlotte-san is also a kind girl, so I guess they have something in common.",
        "Fortunately, I already know what to do in such cases.",
        "“―I think you’re doing very well, Charlotte-san.”",
        "“Eh…?”",
        "When I came back after putting Emma-chan to sleep, Charlotte-san made a puzzled expression at my words.",
        "I answered her with a smile.",
        "“You’re still in high school, so you should be able to study hard and play the rest of the time, but you spend most of your time doing housework and raising Emma, right? I know how hard it is for you to do that alone.”",
        "“Aoyagi-kun…”",
        "“But I do understand that you have to do and want to prioritize your little Emma first, okay? But that doesn’t mean that Charlotte-san has to put up with everything. So please don’t be so pent up about it.”",
        "“Ah…”",
        "As I reached out and gently stroked her head, Charlotte-san let out a small cry and looked up at me with moist eyes.",
        "Then, tears begin to form at the edges of her eyes.",
        "“But I’m her big sister…”",
        "“Yes, you are. But that’s no reason why you have to put up with everything.”",
        "Just because you are the older sister doesn’t mean you have to put up with everything for the sake of the younger sister.",
        "I can’t accept that a relationship that forces only one of us to endure is a family.",
        "“I don’t want to see her sad face…”",
        "“But if it makes you sad, then I think it’s wrong.”",
        "What’s the point of being sad yourself just because you don’t want to see your little sister’s sad face?",
        "I can’t imagine that Onee-san won’t think anything of it when she finds out about it.",
        "At the very least, Emma-chan will be sad when she finds out about it when she grows up.",
        "She may be a selfish child, but she is a kind child at heart.",
        "So, she should find a way that doesn’t make Emma-chan sad and doesn’t make her sad too.",
        "“Aoyagi-kun…”",
        "Before I knew it, the tears in Charlotte’s eyes were rolling down her cheeks.",
        "And then Charlotte-san stared at me, <<What should I do then?>> can be formed from the expression she has on her face.",
        "Perhaps there’s a reason why she has to be so devoted to Emma-chan that I don’t know about.",
        "I’m sure it’s not just because Charlotte-san is a kind and loving sister.",
        "It’s not normal, and it’s not right for a high school student like Charlotte-san to be doing most of the housework and childcare…",
        "However, that’s not an easy thing for me to get into.",
        "So I’ll wait for Charlotte to talk to me about that herself.",
        "Because all I have to do right now is take away her suffering.",
        "“I don’t know what Charlotte-san wants to do, and I don’t think it’s wrong for her to prioritize her little Emma-chan. But I don’t want you to overwhelm your own feelings. So if you need anything, please don’t hesitate to ask me.”",
        "“…………”",
        "Charlotte-san just stares at me with tears in her eyes, but does not open her mouth.",
        "So I decided to continue with my words.",
        "“I’m Charlotte-san’s boyfriend, aren’t I? If that’s the case, I want to make it less of a burden for you. If you want to go out with your friends, I’ll take care of Emma-chan then, and if you have something on your mind, feel free to use me as an outlet.”",
        "I was embarrassed to call myself her boyfriend, but I told Charlotte-san what I wanted to tell her.",
        "No matter how much I told her, she would never change the fact that Emma-chan was her priority.",
        "So, instead of changing that, I showed her another possibility.",
        "All that remained was for her to decide what she wanted to do.",
        "“…………”",
        "Charlotte-san, who had been listening to my words, turned her head and stared at my face again.",
        "So I gave her a smile and she suddenly buried her face in my chest.",
        "“Cha-Charlotte-san…!?”",
        "I called out her name in a slightly raised voice at her unexpected behavior.",
        "Then Charlotte-san looked up at me with moist eyes filled with heat.",
        "I’m not sure what to do, she’s just too cute.",
        "“I want to be spoiled…”",
        "“Eh?”",
        "“I want you to spoil me, Aoyagi-kun…”",
        "That’s all she said, and then she buried her face into my chest again.",
        "Instead, she started to play with my body with her right hand.",
        "I wondered what she was doing, and then she started to hold my hand with her left hand.",
        "Apparently, she wanted to hold my hand.",
        "………… No, yeah, wait a minute.",
        "Why is this happening again…?",
        "“Charlotte-san…?”",
        "I managed to squeeze my voice out of my nervous, parched throat and called her name.",
        "Then she looked up at me again with feverish eyes.",
        "“I’m very happy… that you’re concerned and care about me, Aoyagi-kun…”",
        "“I-I see…”",
        "“Yes… so I would like to take your word for it… I don’t want anything much… But I would be happy to be pampered in this way as a reward for my hard work… After all, this is the greatest happiness for me…”",
        "As if buoyed by a fever, Charlotte-san’s demeanor was different than usual as I pampered her.",
        "I didn’t know what to do with the development that went beyond my imagination, and all I could do was stare at her cute face as she looked up at me.",
        "As I did so, Charlotte-san looked at me with a covetous expression on her face.",
        "I had no idea what she wanted from me.",
        "“Umm, is there something you want me to do…?”",
        "I had no idea what Charlotte-san was asking me to do, so I asked her what she was asking me to do.",
        "Then, Charlotte-san turned her head down shyly and rested her head on my chest.",
        "Then she slowly opens her mouth.",
        "“May I… sit on your lap, please…?”",
        "Oh, it’s not a kiss…",
        "―At the same time, I’m confused by Charlotte-san’s desire to sit on my lap.",
        "What is really wrong with her now?",
        "She’s been a bit of a spoiled girl lately, but today she’s incomparably more spoiled than usual.",
        "Maybe I’ve tugged on her heartstrings without even knowing it.",
        "I’m not sure my heart can take much more of this…",
        "“Is it, no good…?”",
        "When I was unable to make a reply due to my confusion, Charlotte-san looked into my eyes with a clinging look.",
        "…Yeah, I’d like to see if there’s anyone who can say no when she gives me this look.",
        "You’re never going to be able to say no on this one…",
        "“No, it’s fine.”",
        "In the end, Charlotte-san’s cuteness got the better of me and all I could do was nod.",
        "And then, as if buoyed by a fever, she happily sat down on my lap― is that what this is?",
        "Are you testing my self-control, Charlotte-san…?",
        "Naturally, there’s no way I could resist this, so I gently hugged Charlotte-san as she sat on my lap, and she happily leaned into me.",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Comments: This chapter is just illegal, it has the same energy of the recent Kasumi chapters from Losing Heroine. Author really knows how to write spoiled girls huh xD"
    ]
}