{
    "id": "chapter-86",
    "title": "The Pampered Girlfriend",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "“―Wake up.”",
        "“Mhm…”",
        "“Please wake up, Akito-kun.”",
        "Someone gently shakes me, and I slowly open my eyes.",
        "“Ah― Good morning, Akito-kun.”",
        "I opened my eyes and saw a beautiful girl with a very cute smile on her face― or rather, Charlotte-san was smiling at me.",
        "Even though I was awake and my brain wasn’t working properly, I couldn’t help but feel my face heat up when I saw her cute face so close to mine.",
        "And then I immediately remembered that thing… and my heart started to ache.",
        "“Akito-kun…?”",
        "“Sorry, I got a little sleepy and fell asleep after Charlotte-san left.”",
        "I didn’t want Charlotte-san to know about what had just happened, so I decided to smile and cover it up.",
        "I didn’t want to get her involved in any way, and I wanted to leave her as unharmed as possible.",
        "For that reason, I definitely want to hide what I just did.",
        "“…………”",
        "“Charlotte-san?”",
        "“No… that’s not good, you can’t fall asleep in here. I’m sorry.”",
        "“~~~~~!”",
        "She stared at me and I wondered what was wrong, but she was very cute and angry at me for sleeping in the hallway.",
        "The lightly clenched fist that was placed on my head was not painful, of course, and the expression on her face was like an embarrassed smile which was cute.",
        "I’m sure I was embarrassed too.",
        "I couldn’t help but writhe in agony when she did such a cute thing to me.",
        "“…………”",
        "“Cha-Charlotte-san…!?”",
        "As I was writhing in agony, for some reason Charlotte-san hugged me silently this time.",
        "“I’m sorry… I just wanted to do this for a minute.”",
        "S-so cute…",
        "I couldn’t help but think the precious being hugging me was cute.",
        "But this is not good.",
        "I really can’t let her go if she does this to me.",
        "The decision I’ve made will be shaken.",
        "“Cha-Charlotte-san is really a pampered girl, isn’t she?”",
        "“Yes, she is… Akito-kun is so very kind that I feel like I want to be pampered by him…”",
        "I thought she would be embarrassed and leave me, but instead she hugged me tightly and put her cheek against mine.",
        "This unexpected sensation makes my whole body even hotter.",
        "This just made it even harder for me to let her go.",
        "“I’m sorry, Charlotte-sa―”",
        "“―Do you want to go to the futon…?”",
        "“Eh!?”",
        "I tried to tell Charlotte-san to leave, but she somehow invited me to the futon.",
        "She has not even kissed me yet, but I think Charlotte-san is being too aggressive…!",
        "“You want to sleep so badly that you fell asleep here, don’t you? I made you stay up all night last night because of me, so I think you should sleep in your futon now…”",
        "“Oh, that’s…”",
        "If there is a hole, I want to go in it…",
        "I don’t know why I keep misunderstanding things like this.",
        "I’m really embarrassed.",
        "Besides, there’s no way a pure girl like Charlotte-san would have such knowledge. [TLN: Really now? Flashbacks to chapter 84 kek]",
        "“Akito-kun, are you okay?””",
        "“Oh, umm, yeah. I was just a little surprised―”",
        "“Surprised?”",
        "“No, no, it’s nothing!”",
        "Watch out, I almost let my words slip.",
        "If I say something that I misunderstood earlier, it will make her wonder what I’m thinking even though we just started dating, and it will just create a weird atmosphere, so I have to be careful.",
        "As I was thinking about this, Charlotte-san, who was hugging me, started to get nervous.",
        "Then she pulls her cheek away from mine and stares at my face from a short distance for some reason.",
        "After that, her face turned red as she fidgeted and looked away from me.",
        "―But then she started glancing at my face again, and slowly opened her mouth.",
        "“If Akito-kun wants to do it… I don’t mind or rather… I would be pleased…”",
        "“Eh?”",
        "“―Ah!? N-no, it’s nothing! W-What do you want to do? Do you want to sleep?”",
        "When I reacted to Charlotte-san’s low murmured words, she hurriedly faked it. [TLN: Seggs scene when?]",
        "Now that she responded, could it be that Charlotte-san is also aware…?",
        "Or rather, she’s definitely aware, right…?",
        "Come to think of it, if you think about it, she loves manga and anime, and she also loves cosplayers and other otaku stuff.",
        "And if I remember what she sometimes says, she is quite knowledgeable.",
        "She might even know more about it than I do.",
        "There are some words in Japanese that Charlotte-san uses that I don’t even understand at times.",
        "That’s why she might actually――― No, I’ll stop now.",
        "I feel like I shouldn’t go any further into this.",
        "“Um, I think I’ll go to bed. M-more importantly, did something happen to Emma-chan?”",
        "Not wanting to think about it any further, I brought up the subject of Emma-chan.",
        "Then, Charlotte-san puffed out her cheeks a little.",
        "“I knew Emma was more…”",
        "“‘T-that’s not it! I’m just asking because I can’t see Emma-chan!”",
        "“Mou~…”",
        "“Please believe me…”",
        "I wanted to hold my head against Charlotte-san’s obviously sulking face.",
        "I thought that after I confessed to Charlotte-san, her suspicion of me being a lolicon would be over, but apparently that wasn’t the case.",
        "How in the world can I get rid of this suspicion?",
        "“Emma was taken by Mom.”",
        "“She was taken… eh? Is that okay…? Emma-chan was ready to play at the park, wasn’t she?”",
        "Not like I am to talk since I was the one who told her that we couldn’t play for today, but she’s a little girl and she gets pretty upset when things don’t go her way.",
        "It’s proportional to how much she’s looking forward to it, and I’m sure she was looking forward to it a lot this time.",
        "If you’ve messed up Emma-chan’s plans like that, I feel like she’s going to be out of control…",
        "“She’s our mother after all, she should know how to care for a crying daughter.”",
        "Hmm?",
        "It’s kind of uncharacteristic of Charlotte-san to say that.",
        "I feel that she is a little angry.",
        "Maybe…",
        "“Did something happen with your mother?”",
        "“Eh…? What makes you think that?”",
        "“I think it’s because Charlotte-san is acting a little differently than usual. If something is bothering you, I’ll listen to you, okay?”",
        "Even though I will have to break up with Charlotte-san in the future, I want to help her if she is having trouble or distress right now.",
        "It was with that in mind that I said the words, but for some reason Charlotte-san gave me a very sad look.",
        "Then, slowly, her right hand touched my cheek.",
        "“This person is you….”",
        "“Charlotte-san…?”",
        "“No… it’s nothing…”",
        "I’m not sure but, did she have a bad fight with her Mom that made her look so sad?",
        "But it doesn’t seem that way when I remember the atmosphere in which Charlotte-san came here.",
        "If they were having a really bad fight, she would be depressed.",
        "In addition, the words that Charlotte just muttered… could it be me who’s making her sad…?",
        "“Charlotte-san, did I do something to upset you?”",
        "“Eh? N-no, that’s not it, not at all…!”",
        "“Then why do you look so sad?”",
        "“T-this is…………… just nothing…”",
        "Apparently, she’s not going to tell me.",
        "I’m very curious, but I don’t think it’s a good idea to force her to tell me.",
        "So I decided to gently hug her body and pat her head.",
        "“A-Akito-kun…”",
        "“I’m sorry, I’m such a careless boyfriend…”",
        "“W-what are you talking about…!? Akito-kun is such a thoughtful boyfriend that he’s overly thoughtful…!”",
        "“Is that true…?",
        "“It is! It really is true!”",
        "It’s hard to believe that a thoughtful boyfriend would make her look sad.",
        "But she is kind enough to affirm me.",
        "She’s a really good girl, though the tone of her voice is a little bit angry, which bothers me.",
        "…I don’t want to leave her, after all…",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Comments: I was planning to do more than 5 chapters today but my father suddenly called out for me since he needed me for something. Well anyways, I don’t think they’ll break up soon since Akito finally decided that he won’t.",
        "Anyways, if you guys have some spare money, please do consider helping my Editor with funds for buying his new phone. Click the Ko-Fi button below to be redirected, thanks!"
    ]
}