{
    "id": "chapter-125",
    "title": "The Real Reason Why The Beautiful Transfer Student Came to Japan",
    "content": [
        "Translator: AJ1703",
        "(**Akihito’s POV**)",
        "“What do you mean…?”",
        "“To put it simply, the real reason I had Charlotte-san come to Japan was for her to become Akihito’s fiancée.”",
        "She said, “I had Charlotte-san come to Japan”, so Kanon-san called her over.",
        "Of course, it was probably not directly relayed to Charlotte-san, since she could have just contacted Onee-san.",
        "But then, that would mean…",
        "“I know you two are confused, but when it was discussed that Akihito would have a fiancée, I relied on Onee-sama to help me. This is to prevent my Father from doing as he pleases any longer, and to prevent him from taking away Akihito’s freedom.”",
        "Kanon-san continued to speak with a serious expression on her face to the puzzled Charlotte-san and me.",
        "It seems that she is not lying.",
        "“The reason why you did not reveal that she was my fiancée is because she had not been declared as my fiancée yet when she came to Japan in the first place, right?”",
        "“We wanted the two of you to get to know each other without us getting involved. But you are right, Akihito, Onee-sama did approach my Father about Charlotte-san as Akihito’s bride after she came to Japan, but my Father did not give his consent.”",
        "“Why is that?”",
        "“He was very cautious. My father had known Onee-sama for a long time, and he knew that she was smart and a good businesswoman. Above all, he was very suspicious of her because she was not the type of person who would make a political marriage out of her own daughter. Besides, Onee-sama’s company is larger in terms of corporate scale.”",
        "As long as you hold the fate of your company in your hands, you can’t take on a deal if you can’t read the other party’s intentions.",
        "And if the company is larger than his own, it would be a reasonable decision.",
        "“But that is precisely why he could not easily refuse the offer. This was an important business partner with whom we have had a relationship for a long time, and we would be in trouble if they stopped doing business with us.”",
        "So that’s why the political marriage discussion was stalled…",
        "I am not familiar with the power dynamics in the corporate world.",
        "However, the fact that President Himeragi did not disrespect Onee-san is proof of this.",
        "President Himeragi must have been around 50 years old, so he and Onee-san must have been about one year apart in age, but Onee-san still seemed to be in a higher position than Himeragi.",
        "“Perhaps, the conversation about the political marriage has progressed because―”",
        "“Yes, it is because you two have become lovers, and seeing Charlotte-san’s infatuation with Akihito, my father decided that it was all right.”",
        "Charlotte-san’s face turns red with embarrassment at the mention of her infatuation, and she presses her arms around me.",
        "Then, she hid her face by pressing it against my arm.",
        "She’s so embarrassed that it’s very cute.",
        "“From what I’ve heard, I don’t think there was any problem… Why did you do something that could have broken up the relationship between me and Charlotte-san?”",
        "Since Charlotte-san and I have become lovers, and President Himeragi has acknowledged her as my fiancée, I still have no idea why Arisa-san was sent to me.",
        "Moreover, they even went out of their way to make me think that someone other than Charlotte-san was my fiancée.",
        "There must have been some kind of hidden motive.",
        "“Originally… it was somewhat of an afterthought for my father.”",
        "“An afterthought…?”",
        "I frowned at the unexpected words.",
        "“We did not reveal to Akihito who his fiancée was, so we wondered which he would take, his girlfriend or his own interests. So, I offered him a bet. Of course, my father thought you would choose your own interests, while I thought you would choose your lover.”",
        "“What was the bet?”",
        "Since she said “originally,” it must be different from the wager that had just been made.",
        "“The bet was that if my father won, the Himeragi conglomerate would have an overwhelming advantage in the new partnership between our company and Onee-sama’s company, which we were about to start. And if we won― it was Akihito’s freedom.”"
    ]
}