{
    "id": "chapter-101",
    "title": "The Two Facing Each Other",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Akito’s POV**)",
        "“You want to stand next to me… what do you mean by that…?”",
        "I know that she didn’t mean that she wanted to stand next to me in the physical sense.",
        "But I didn’t know what she meant when she said this.",
        "“I want… Akito-kun to consult me… instead of… someone else…”",
        "“―Ah.”",
        "She looked up at me with a clinging look in her eyes and I gulped.",
        "She had asked me about the contents of the conversation, and I had thought that it was possible that she would come to this conclusion, but to be honest, I thought it was unlikely given her personality.",
        "I thought she was the kind of girl who wouldn’t step in as long as I was deceiving her, but it seems I was wrong.",
        "No, should I say that there was a change in her?",
        "So even now, her behavior is different than usual…",
        "Maybe more deception will only create a rift between us…",
        "“I’d like to ask you first, how much did you hear about it, Charlotte-san?”",
        "“I’ve probably heard most of it.”",
        "“I see… So, do you have any idea what this betrayal thing we’ve been talking about is?”",
        "“I have a rough idea… but I don’t know everything.”",
        "When I heard those words, I decided to start from scratch.",
        "I’ve been playing soccer since I was in elementary school, and in middle school I was called up to play for the Japanese national team for my generation, and I was on the soccer team at my public school.",
        "I don’t know why she looked so relieved when I told her about my sister-in-law, but maybe the conversation between Riku and I had made her feel uneasy about something.",
        "I stroked her head apologetically, and she leaned her head against me again, looking happy.",
        "As I pampered her like that, I told her about my past.",
        "I told her about an incident that had happened when I was in the second year of middle school.",
        "“Did your father force you to leave the club on the day of the national tournament…?”",
        "When Charlotte-san heard my story, she asked me back, her voice slightly shaking.",
        "“Well, even though he’s technically our father, he only took custody of me. I knew there was something wrong with him. Me and Kanon-san, my sister-in-law, were called away for something we didn’t need to do, and we weren’t allowed out of the mansion. Because of this, I was supposed to arrive at the venue on the morning of the national tournament – I tried to leave early in the morning, and that’s when the person told me I was leaving the club.”",
        "“Why would he do that…?”",
        "“I hadn’t told anyone why, but apparently the team we were playing against had a sergeant who was an important business partner. That’s why they sold me, I was the commander at the time.”",
        "“How terrible… How is that even allowed…?”",
        "Charlotte-san frowned angrily.",
        "This is a rare expression for a gentle woman.",
        "I responded to her with a dumbfounded smile.",
        "“I was forgiven.”",
        "“Eh…?”",
        "“Because there’s no evidence of such a transaction anywhere.”",
        "Hearing my words, Charlotte-san lowered her eyes sadly.",
        "Then she gently stroked my cheek.",
        "“I knew there was a trick to it. However… that’s why everyone got confused… It’s because Akito-kun wasn’t there…”",
        "“Actually, it’s not just that.”",
        "“Eh…?”",
        "“It wasn’t just me who wasn’t there at the time, but the manager as well.”",
        "“So you’re saying they’re pulling the strings along with the manager, too? But I think they can’t do that with a stranger, unless they were Akito-kun’s relative or something…”",
        "“It would be a different story if the manager was also a family member, right?”",
        "“What do you mean…?”",
        "Charlotte-san tilted her head curiously.",
        "Well, there’s no way to tell just from this.",
        "In the first place, the image of the manager that Charlotte-san and I have in mind is probably different.",
        "“This is something that only my teammates know, but our actual coach was also our manager, Kanon-san.”",
        "“…Um, Akito-kun… there are so many things I want to talk to you about, I honestly don’t know where to start…”",
        "“Erm, I’m sorry…? But it’s the truth. She likes to work behind the scenes to come up with schemes. On the surface, she announced the teacher as the supervisor, but in reality, Kanon-san was giving the orders.”",
        "Well, when I say giving instructions, that person on the bench never gave instructions.",
        "The only thing she did was to tell the teacher when she wanted to replace a player.",
        "The rest of the instructions were all given in the pre-game meeting, and if there was a need to modify the plan due to the flow of the game, I would give the instructions.",
        "That’s why in the game where the problem had occurred, not only I was not in command, but the true coach was not even there.",
        "We were playing against a team that was one of the top candidates to win the tournament― the winner of last year’s tournament and a team that still had most of its main members, so to be honest, it wasn’t even a match.",
        "Akira was badly injured in the game, and many of the players who lost confidence after the loss quit playing soccer, and many of the team members left for the youth team after their leader left and their ace striker went into long-term treatment.",
        "Well, there was no way around it.",
        "In fact, they were good enough to be a mainstay of the youth team right away.",
        "That team wasn’t originally a private one, so they weren’t the only ones who were recruited, but many of them had known each other since elementary school and had moved to the area because they wanted to play soccer with me and Akira.",
        "It seems that Kanon had lent a hand in this, but even so, I don’t think they would have normally moved to be on a team with us.",
        "I betrayed the talented people who were willing to go that far to be on the team with me.",
        "I still feel really sorry for what I did.",
        "“But if you had such a reason, you wouldn’t have blamed Akito-kun…”",
        "“No, middle school students are more childish than we think. They want to blame someone else. So, when I was emotional, everyone blamed me― and I also blamed Kanon-san.”",
        "Because of this, there was now a huge rift between me and Kanon-san.",
        "Even though we were talking in turn, there was one thing that Charlotte-san misunderstood.",
        "It was not when we were young that Kanon-san and I became siblings, but a week before the national tournament."
    ]
}