{
    "id": "chapter-69",
    "title": "The Beautiful Transfer Student Who Acts Like a Cat is Cute",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "At first, I thought that we would definitely be disturbed on our date.",
        "I know they say it won’t be a problem if we go far away, but honestly, in my heart, I was worried that no matter how far we went, we would run into someone we knew. I was worried.",
        "But what the heck― so far, everything was going surprisingly well.",
        "We are now at a famous shopping mall in Kurashiki, and we are stopping by a pet store in the mall.",
        "The reason why we are in a pet store is because Charlotte-san’s eyes were glued to this store when we passed by it.",
        "The reason is simple.",
        "There was a very cute kitten staring at us and purring.",
        "I glanced to my right.",
        "And there it was―.",
        "“Nyan-nyan!♪”",
        "―There was a precious being who was human but speaking like a cat.",
        "Naturally, this precious being is Charlotte-san, and she is talking to the kitten with her hands curled up as if she were imitating a cat.",
        "The cat replies with a meow, but I’m pretty sure they’re not talking to each other.",
        "Afterwards, I’m so embarrassed even though I’m not the one doing it.",
        "Fortunately, Charlotte-san is mewing in a low voice and the people around her don’t notice, but I feel unusually embarrassed when I see her.",
        "But Charlotte-san was so cute as a cat that I couldn’t take my eyes off her.",
        "What is this dilemma…?",
        "What am I supposed to do here…?",
        "―I suddenly thought, <<Wouldn’t Charlotte-san be even cuter if she wore the cat ears that Emma-chan wore before>> I didn’t know when I became such a pervert…",
        "I’m sure I wasn’t the kind of person who would be attracted to cat ears, but when I see Charlotte-san now, I can’t help but want to see her with cat ears.",
        "Apparently, she has a certain charm that can change people’s sexual preferences.",
        "“Um, Aoyagi-kun… it’s embarrassing to be stared at like that…”",
        "“Oh, sorry…”",
        "As expected, I was staring too much, and Charlotte-san, realizing that I was watching her, protested with reddened cheeks.",
        "It’s just… I know she’s embarrassed, but please don’t look at me up and down while hiding your face in my arms to hide your embarrassment.",
        "This is bad, I feel like my head is going to boil.",
        "Or rather, isn’t she purposely doing this?",
        "…But Charlotte-san, doing this on the ground…",
        "If she’s doing it unconsciously, she’s a natural killer of men.",
        "“I’d like to keep this cat at home…”",
        "Looking at the kitten trying hard to attract Charlotte-san’s attention even through the glass, she muttered with a debauched expression.",
        "It seems that she liked this kitten very much.",
        "It certainly had a beautiful white fur that was well groomed, crinkly eyes and a small nose.",
        "I also think it’s very cute with its droopy ears, which is unusual for a cat.",
        "Also, judging from it’s friendly demeanor, it would definitely be the type of cat that would rub up against you.",
        "So it’s no wonder Charlotte-san wants this one.",
        "This kitten is a Scottish Fold.",
        "It is said that only 20 to 30 percent of Scottish Folds have droopy ears, so this kitten might be a bit rare.",
        "Above all, it’s a friendly and intelligent cat.",
        "Last year it was voted the most popular cat in the world, and I think it’s a good cat to have.",
        "What I’m curious about is the price―150,000 yen…",
        "Yeah, I’ll pretend I didn’t see that.",
        "“I’m pretty sure our apartment doesn’t allow pets.”",
        "“That’s right… And even if it is, there’s no one to take care of it during lunchtime, so it would make the cat feel lonely. So I wish I could have one in the future…”",
        "Charlotte-san said this as she glanced up at my face.",
        "I wondered if I could take this to mean that.",
        "<<I’d like to have a cat in the future>> and she’s begging me for one―.",
        "No, but as expected, that’s too convenient.",
        "Charlotte-san has never said a word about me…",
        "Well, whichever way you look at it, when we grow up, this kitten will be owned by someone else.",
        "However, I vowed secretly in my heart that I would do my best to earn enough money to keep the cat when I grew up.",
        "◆",
        "“This accessory is very cute.”",
        "Charlotte-san showed me with a smile as she picked up a pink heart-shaped accessory from a small store she had found while walking in the mall.",
        "It’s definitely a cute design that girls would love.",
        "The item seems to be well made―Well, it’s reasonably priced though…",
        "When I glanced at the price, I couldn’t help but chuckle as it said 5,000 yen.",
        "It’s a price I could totally afford, but I’d be lying if I said it wasn’t a painful expense.",
        "I would like to see the price of such a book to be affordable for students, but it may be difficult due to the cost of production.",
        "“Oh, umm, I didn’t mean that I wanted Aoyagi-kun to buy it…”",
        "“Yeah, I know. Well, it would have been cool if I could have bought it quickly here, but the price is a bit steep.”",
        "I jokingly smiled back at Charlotte-san, who impatiently corrected me when she saw my expression.",
        "I know that she’s not the kind of girl who would beg me to buy her something.",
        "She’s probably the type of girl who would rather hold back even if she wanted to.",
        "It’s not my fault that I showed it on my face, but I don’t want her to worry too much about it.",
        "―But it’s a date.",
        "I want to give her something as a gift…",
        "I wanted to dress up a little bit, so I looked around for an accessory that was affordable and had a good design.",
        "One― well, two, to be exact, accessories caught my eye.",
        "There was an accessory with two small silver and gold rings on a single chain.",
        "This is the so-called―",
        "“Ah, a pair of rings…”",
        "―Yes, a pairing.",
        "Charlotte-san, who followed my gaze, muttered the words I had in mind.",
        "The price is 5,000 yen, the same as the heart-shaped accessory I just bought.",
        "But since this is a pair of rings, it’s actually 2,500 yen each.",
        "And yet, the design is no less than the heart-shaped accessory.",
        "More importantly, I thought the fact that it was a pair ring was very nice.",
        "The small paper sign said something like “Share this ring with the person you love and it will keep you together forever,” but I would be very happy if Charlotte-san and I could wear matching rings.",
        "I can’t ask her to wear it with me because we’re not even in a relationship, but if we were in a relationship, I’d want to wear it with her.",
        "…Later, I’ll tell Charlotte-san I’m going to the bathroom so she doesn’t see me.",
        "―As I was thinking about this, Charlotte-san reached for the pair of rings.",
        "She then buried her face in my arm, looking up at me with embarrassment.",
        "“Erm…?”",
        "“U-umm… if I buy this, would it be possible… for Aoyagi-kun to wear one of them…?”",
        "When I was confused, Charlotte-san said the words I had been thinking of.",
        "Oh, it’s confirmed now.",
        "She definitely likes me.",
        "“…..I don’t want to.”",
        "“Eh…?”",
        "When I rejected her offer, Charlotte-san’s expression became tainted with despair.",
        "She let go of my hand as if she had lost her strength― and I caught her when she was about to crouch down.",
        "“I’m sorry, I shouldn’t have said that. You know, I was planning to buy one of these and give it to Charlotte-san as a gift.”",
        "“Eh, that’s…”",
        "“It’s our first date alone, so I want to give it to you as a gift. Will you accept it?”",
        "I dared to use the word “date”.",
        "I was already convinced that she liked me, and it would be easier to convince her to give up her purchase.",
        "Charlotte-san looked at my face, blinking repeatedly, as if she couldn’t understand what was being said.",
        "Then, as she began to understand the words, her cheeks, which were red from the start, became even redder, and tears began to form in her eyes.",
        "As it was, she covered her mouth with the palm of her hand and looked very happy―",
        "“Yes, I’d be happy to…!”",
        "―And then she replied.",
        "―I wondered if this was a roundabout way of confessing my love for her, but I made up my mind to make a proper confession before we left.",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Comments: IT’S FINALLY HERE, AT THE BEST NICE NUMBER IT COULD’VE ACTUALLY HAPPENED LEZGOOOOOOOOOOOO THE SHIP HAS FINALLY SAILED!"
    ]
}