{
    "id": "chapter-51",
    "title": "Visible Emotions",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "“I really enjoyed today. Thank you very much, Aoyagi-kun.”",
        "While riding the train back home, Charlotte-san, who was sitting next to me, stared at my face.",
        "Emma was asleep in my arms and there were no other passengers around, so it was as if it was just the two of us.",
        "“I’m glad you enjoyed it… Yeah, I had fun too.”",
        "It was more like a family outing than a date, since Emma-chan was the main attraction today, but I think we still had a great time.",
        "It fills my heart with joy to see a little girl so excited, and when I spoil her, she’s so cute that my cheeks loosen up.",
        "Even though we played all day, I honestly felt more energetic than before we went.",
        "It’s said that sickness is a matter of the mind, but I think my physical strength may be affected by my mind.",
        "“Is it selfish of me… to want to go out and play again…?”",
        "Charlotte-san, who had been looking up at my face, looked at me as if she was trying to see my expression.",
        "Her eyes were glazed as if she was dealing with Emma, and her cheeks were flushed from the evening sun.",
        "When someone stares at you with this kind of expression, it’s almost like a misunderstanding――― No, is this really a misunderstanding?",
        "As it is now, Charlotte-san had been hugging my arm all day today.",
        "Even if the reason for this is to escape the gaze of the people around, she never let go of my hand, even in unnecessary places.",
        "Would she normally do that to an unwilling member of the opposite gender?",
        "I don’t know for sure because I don’t know of any precedent, but at least I wouldn’t do it.",
        "I think Charlotte-san is probably one of those types.",
        "And moreover, she’s been visiting my room every night.",
        "At first, I’m sure she came for Emma-chan’s sake, but lately, she’s been coming into my room even after Emma-chan has gone to bed.",
        "And the two of us usually read a single manga together, shoulder to shoulder.",
        "To top it all off, Charlotte-san was often staring at my face instead of the manga.",
        "…No matter how I think about it, I think she’s aware of me, right?",
        "So when I realized that was also the case when going out with Aki, I thought to myself― no, let’s not do that.",
        "Even if that was the case, there was no way to confirm it with her except by asking her directly.",
        "If I were to ask her, and I was mistaken, it could cause a rift in our relationship, and there was no way I could ask her that.",
        "If so, what should I do―?",
        "“No, you’re not being selfish, I want to go out with Charlotte-san again, too.”",
        "I replied with a smile to Charlotte-san.",
        "I just have to take my time and get closer to her.",
        "Though, I am worried that other guys might take her.",
        "There are a lot of guys who want her, and many of them are more attractive than me.",
        "Akira, for example, may not have the best academic record, but he’s tall, handsome, fast, and athletic.",
        "He’s not in a club, but there’s a reason for that.",
        "He’s always been a soccer fan, but instead of joining a soccer club, he joined a youth team.",
        "I heard that he’s already a starter even though he’s just a first-year, and he will eventually become a professional.",
        "There is no way that such a boy would not be attractive to a girl.",
        "I’m not sure if it’s because of his character or because he’s joking around too much, but Akira has never had a girlfriend.",
        "…No, let’s not say too much about that.",
        "I’ve never had a girlfriend either, so I can’t really speak for anyone else.",
        "That said, what is he going to do about his procrastination…?",
        "Akira seems to be aware of the feelings I have for Charlotte-san, so it would not be a good idea to continue to deceive him.",
        "However, considering Charlotte-san’s situation, it is important to avoid the risk of it becoming publicized, and more importantly, since Akira is in love with Charlotte-san, it may develop into an annoying problem.",
        "I want to avoid that as much as possible.",
        "“W-well then, how about next Saturday?”",
        "I nodded, and Charlotte-san looked up at me with a happy expression on her face.",
        "The conversation came to a conclusion sooner than I had expected.",
        "The point is that she wants to have fun during her next vacation.",
        "If we go out too often, we won’t have enough money… Well, one more day won’t be a problem at all.",
        "“Yes, it’s fine. Is it okay if we go wherever Emma-chan wants to go next?”",
        "“Ah…”",
        "“Hmm?”",
        "When I brought up the subject of Emma-chan, Charlotte-san looked down at the sleeping Emma-chan with a troubled expression on her face.",
        "Was there a problem?",
        "I waited for Charlotte-san, who was looking at Emma-chan and me alternately, to open her mouth.",
        "Then―",
        "“Actually, my mom is coming home next Saturday. So I thought I’d leave Emma-chan with our mother…”",
        "Charlotte-san answered shyly, fidgeting with her index fingers together.",
        "“Eh…? So it’s just the two of us…?”",
        "When I asked her about the part I was curious about, Charlotte-san nodded her head.",
        "“Is it… no good, if it’s just the two of us…?”",
        "“…..No, let’s go out together then.”",
        "I nodded as I felt my body temperature rising as Charlotte-san asked me with an upturned look as if she was looking at my face.",
        "Isn’t this a sign already…?",
        "―These were the words that came to my mind as I was being rocked by the train."
    ]
}