{
    "id": "chapter-127",
    "title": "Desperate Girlfriend",
    "content": [
        "Translator: AJ1703",
        "(**Akihito’s POV**)",
        "“Yes, originally we didn’t have enough bargaining chips to push my Father over the edge.”",
        "That, after all, is probably what I expected when I was talking to President Himeragi.",
        "It’s ironic that all the talk on social networking sites not only annoyed me, but also worked to improve our situation.",
        "“Thank you for everything you’ve told us. We’re good to go.”",
        "I don’t think we need to go any further.",
        "What is more important is what is to come.",
        "“Yes, what’s done is done. The future is more important than those things.”",
        "Kanon-san seemed to have understood my intention.",
        "As usual, she was quick on the uptake.",
        "“So, what should we do from now on, Akito and Charlotte-san?”",
        "“…Eh?”",
        "For a moment, I couldn’t understand what she just said, so I tilted my head.",
        "Come to think of it… didn’t Kanon-san say something about living together with her earlier…?",
        "“It’s a matter of fact that the two of you are engaged to be married, and you’re both in love with each other, and you’ve been living together and flirting with each other half the time without us seeing, I think it would be a good idea for you two to live together.”",
        "“~~~~~!”",
        "Charlotte-san’s face turned red and she writhed in agony as Kanon-san said these embarrassing things with a smile on her face.",
        "I know that Kanon-san has no malice and is saying this with good intentions.",
        "But― this made my face hot with embarrassment.",
        "“Isn’t it a bit too soon for that…?”",
        "“What, you don’t want to…?”",
        "When I said that I thought it was not as good as it was, Charlotte-san gave me a look like a puppy being thrown away.",
        "Even though earlier, she was embarrassed, but at the same time, she seemed to be happy.",
        "“Far from not wanting it, I’m actually happy about it…”",
        "I just feel like there are a lot of things that could go wrong…",
        "“In any case, Akito will join Himeragi, and since you and Charlotte-san are going to be married, you will be living with me from now on, okay?”",
        "“―?”",
        "Kanon-san says this with a smile, and Charlotte-san’s expression twists, looking more shocked than before.",
        "Then she tugged at my clothes.",
        "“A-Akito-kun, come live with us…! That’s better, otherwise no…!”",
        "Apparently, she doesn’t want me and Kanon-san to live alone together.",
        "I guess Charlotte-san doesn’t understand that, even though she will live with us, Kanon-san will be accompanied by Arisa-san one hundred percent of the time.",
        "In Kanon-san’s case, I think she probably already figured this out when she said it…",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Afterword: Sorry for being gone for a long time, the latest chapter as of Christmas in the raws is at Volume 3 (oh wow vol.2 finally ended lmao) Chapter 137. So I’m like 10 chapters behind. The reason why I was gone for a long time was due to my studies and declining health. It’s gotten to the point I was almost bedridden for a month and had to follow-up on the late submissions for my school activities. It’s already Christmas and yet im still taking care of my school-related stuff which sucks ass. I haven’t fully recovered from my sickness yet since apparently, I have a weaking left upper lobe lung and is now been medicating for some medicines and drinking herbals to cleanse out some of the bad stuff in my blood (and no, I don’t smoke or drink alcohol, nor I do dr*gs).",
        "However, I always thank you guys for your support and patience that are still reading this series. I don’t know if you guys still exist, but hey if you’re here, Merry Christmas and I hope you guys enjoy it (or happy holidays if you don’t celebrate). Please remember, that someone out there needs you or will need you (could be someone you haven’t met yet). Whatever troubles you’re facing right now, you’ll get over it eventually. Just like the predicament I have right now even though I feel so hopeless but I am still fighting on (despite my health). Here’s to hopefully, a happier and better year to come!(P.S. I’ll try to upload chapters daily until next year so look out for that.)"
    ]
}