{
    "id": "chapter-74",
    "title": "She Chose The Gothic Lolita Clothing",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "“―W-what do you think…?”",
        "Charlotte-san, who had since put on the clothes she had picked out for herself, opened the curtain of the changing room and asked me.",
        "Her cheeks were dyed red, perhaps she was embarrassed to ask my opinion directly.",
        "She was currently wearing a purple shirt-blouse and a blue skirt.",
        "She has the top three buttons of the shirt blouse open and is wearing it loose.",
        "As she did so, I could see the white shirt she was wearing underneath.",
        "Naturally, it was for show, but it looked a little adventurous for her.",
        "But it looks good on her, and she looks cute.",
        "“Yes, I think it looks good on you.”",
        "“I see… The next one is…”",
        "In spite of the fact that I said it looked good on her, for some reason Charlotte-san changed her clothes once again and went to find another one.",
        "Basically, she couldn’t occupy the changing room, so she could only try on one set of clothes at a time, but if she went out of her way to change, was she not satisfied?",
        "She looked so embarrassed when she first went into the changing room, but now she’s really into it.",
        "“―How about this?”",
        "Charlotte-san came out of the changing room again wearing a blue jacket over a white shirt-blouse and blue wide-legged pants underneath.",
        "Apparently, she was going for a boyish look this time.",
        "I don’t know if she had a change of heart, but she seemed to be trying something new.",
        "…I actually like the boyish look a lot.",
        "Especially when an innocent girl like her dresses in a boyish style, the gap between the two makes me very nervous.",
        "“Yeah, it looks really good on you too.”",
        "“Mou~… Next is…”",
        "That’s strange.",
        "I was supposed to be complimenting her, but for some reason she gave me a look of dissatisfaction.",
        "As I stared at Charlotte-san’s puffy cheeks as she went to look for her next outfit, I tilted my head, unsure of her true intentions.",
        "A few moments later, Charlotte-san walked into the changing room with a new set of clothes.",
        "For a moment, I thought I saw some really strange clothes, but since it was Charlotte-san, I was sure I was mistaken.",
        "However, the next person to come out was Charlotte-san, dressed in a gothic lolita outfit.",
        "An outfit that looks like a maid’s uniform in black and white.",
        "With fluttering all over her body, it was a gothic lolita outfit no matter who you looked at.",
        "And for some reason, Charlotte-san had politely used a hair elastic to pull her hair into twin tails.",
        "Why is she carrying a hair elastic if she doesn’t wear her hair in a bun?",
        "What the heck is her choice of twin-tails?",
        "―But what I want to ask the most is why she chose to wear a gothic lolita outfit.",
        "Is that it?",
        "Does this girl still think I’m a lolicon?",
        "Sure, I haven’t been able to prove myself because I’m planning to do it at the end of the day, but no matter how much I want to, this isn’t…!",
        "―but I’m afraid to say so since it looks terrific on her.",
        "Although she looks mature, perhaps because she’s originally a foreigner, gothic lolita clothes look great on her.",
        "No, yeah… no matter how you look at it, it’s just too cute…",
        "“Is this cute…?”",
        "“Oh, um… yes, it’s very cute.”",
        "It seems that my brain, having to process so much at once, is no longer functioning properly, so I gave my honest opinion of Charlotte-san’s question.",
        "I had been too embarrassed to use the word “cute” before, but her question caught me off guard and I said it.",
        "“I did it. He finally said I was cute! I thought I could definitely pull this off!”",
        "Perhaps she was too happy that I said she was cute, but with a big smile on her face, Charlotte-san was pleased.",
        "Apparently, the reason she was so stubborn was because I didn’t tell her she was cute.",
        "It was so cute to see her innocently frolicking.",
        "Perhaps it’s because of her clothes, but she looks like a child having a good time.",
        "But then again, I guess she thinks I’m a lolicon.",
        "I guess people’s sexual preferences don’t change that much, but I’m not a lolicon to begin with, so I’m not convinced that she believes me.",
        "However, I only said that she was “very cute” when she wore a gothic lolita outfit, so her suspicion of me as a lolicon has even deepened.",
        "“Then let’s buy this―”",
        "“Wait a minute!”",
        "I hurriedly stopped Charlotte-san, who was about to buy a gothic lolita outfit without a second thought.",
        "Then she looked up at me as if to ask, “Is there a problem?, as if there was a problem.",
        "It’s true that it looks good on her.",
        "But if she walked around in such a dress, she would be the center of attention, for better or worse.",
        "In fact, for Charlotte-san, who doesn’t want to be the center of attention, it would be a bad thing.",
        "So why would she want to buy a gothic lolita outfit?",
        "No matter how much of a foreigner she is, I don’t think she would make such an error in judgment…",
        "“Are you really going to buy that?”",
        "“Because Aoyagi-kun only said that this dress was cute…”",
        "When I asked, “Are you insane?” Charlotte-san puffed out her cheeks and sulked.",
        "It seems that she’s really upset about the fact that I didn’t tell her she looked cute in other clothes.",
        "“I-I’m sorry. I was too embarrassed to say that earlier..”",
        "“So you’re saying that this dress was so cute that you were able to say it was cute even beyond that embarrassment?”",
        "That’s a bit of a misunderstanding.",
        "It’s another reason why my thinking has slowed down.",
        "“Look, Charlotte-san, you’re cute in any outfit, so let’s not choose this one, okay?”",
        "She was sulking, so I told her gently.",
        "The other person was Charlotte-san, who was kind and understanding.",
        "That was enough to convince her to listen and accept.",
        "―Well, more like reluctantly, but I’m glad that she changed her mind.",
        "As a result of our discussion, Charlotte-san bought the second dress, which was more boyish.",
        "She said it was a style she didn’t have and that she liked my reaction to it better.",
        "We left the clothing store without an incident, but I was having some second thoughts about her.",
        "The more I got to know her, the more I felt like I was seeing a side of her that I didn’t know existed.",
        "One thing I’ve learned is that she’s actually a childish, spoiled girl who pretends to be an adult.",
        "The reason why she’s acting like an adult may be because she’s taking care of the young Emma-chan.",
        "Both sides are very attractive for me, and when I first met her, I thought the more mature Charlotte-san was the ideal person for me.",
        "But now, I like her more because she’s more childish and sweet.",
        "That’s why I thought this way―",
        "―I want her to be able to pamper herself without hesitation only in front of me."
    ]
}