{
    "id": "chapter-128",
    "title": "Coquettish Girlfriend",
    "content": [
        "Translator: AJ1703",
        "(**Akihito’s POV**)",
        "“There’s no need to panic so much, okay?”",
        "I gently pat Charlotte-san’s head.",
        "This is terribly embarrassing in front of my would-be sister-in-law and her mother, but I feel sorry for Charlotte-san because she is so upset.",
        "“Mhmm…”",
        "Charlotte-san meekly gets patted by me with teary eyes.",
        "It seems that she didn’t want to be living with Kanon-san so much.",
        "“I was so proud of her for flirting with him in front of so many people and telling the world about it.”",
        "“Well, if they are happy, it’s fine, isn’t it?”",
        "The two of them have been looking at us with very kind eyes.",
        "When I remember this later, I’ll feel like going into a hole…",
        "“Well, what do you think of Charlotte-san’s mother?”",
        "“Don’t refer to me as a distant person, just Sophia is fine.”",
        "Onee-san’s name is apparently Sophia.",
        "I had never heard her name before.",
        "“That reminds me, do I call you Onee-san or Mom?”",
        "“Please don’t call her Onee-san, because I don’t like it.”",
        "Charlotte-san looked at Sophia with a smiling face.",
        "Well, I suppose you don’t want your own mother to be called Onee-san by her boyfriend, do you?",
        "“Lottie would think it’s terrible just because she’s so young.”",
        "“You know that’s not what I’m talking about!?”",
        "Charlotte-san responded to Sophia-san’s sarcastic remark with a sultry look.",
        "I don’t think I’ve ever seen her this way before.",
        "“Then I guess I’ll call you Sophia-san.”",
        "I could have called her “Onee-san” just like in the past, but Charlotte-san didn’t seem to like it, so I decided not to.",
        "Mom is a bit too much for me, so I decided not to call her that.",
        "“Yeah, that’s fine. And I agree with the idea of you two living together. I can fulfill my promise to Akihito-kun, and since I have to go back to England and so on. I feel safer as well, knowing that Akihito-kun and Kanon-chan are watching over Lottie and Emma.”",
        "Sophia-san is the president of the company, and it seems that the head office is in England.",
        "She is only in Japan temporarily, but she will probably have to go back to the England as well.",
        "Perhaps she is still going back and forth between England and Japan.",
        "“So it’s up to Akihito to decide, and we don’t even have to ask Emma-chan about it.”",
        "Emma-chan would probably be happy if I asked her to live with us.",
        "I know how much the little girl adores me, as you can imagine.",
        "And also, Charlotte-san wants to live with me.",
        "So, my answer was already clear.",
        "“Then, let me take you at your word.”",
        "This is how Charlotte-san and I came to live together."
    ]
}