{
    "id": "chapter-87",
    "title": "Different Thoughts",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "The fact that I’m crazy about Charlotte-san is a fact that I can’t disguise.",
        "I don’t know why she doesn’t seem to think so, but for me, Charlotte-san is the best.",
        "I think she’s the girl I never want to hurt and never want her to be sad.",
        "…And the truth is, I’ve noticed it.",
        "That how much it would hurt her if I told her I was leaving her.",
        "I knew there was no way I could do that.",
        "And I don’t want to let her go either.",
        "“I’m sorry, Charlotte-san…”",
        "“Like I said, Akito-kun is…!”",
        "Charlotte-san pulled away from my hand and looked into my face.",
        "Her face was small and puffy like a sulking child, and I was sorry but she looked cute.",
        "“No, that’s not what I meant. I just wanted to apologize for thinking of making any stupid choices.”",
        "“Eh…?”",
        "Charlotte-san’s eyes shook as she heard my words with a smile.",
        "Sure, I don’t know much about her, but I think she’s a natural for being quite perceptive.",
        "It wouldn’t be surprising if she had noticed something that she just didn’t want to hear.",
        "“I’m sorry, I know you’ll be surprised if I suddenly say something like this.”",
        "But I didn’t mention the fact that Charlotte-san might have noticed something, and I apologized again for saying something so abruptly.",
        "Then, for some reason, Charlotte-san put her hand on my cheek.",
        "“……….I’m sorry, Akito-kun.”",
        "“Eh?”",
        "All of a sudden, I didn’t know why she was apologizing to me.",
        "In response, Charlotte-san looked into my eyes and slowly opened her mouth.",
        "“The truth is, I was going to wait until Akito-kun spoke to me… I’m sorry, I couldn’t resist… Please, don’t force me to laugh anymore…”",
        "“―!”",
        "Charlotte-san, who looks so sad that tears are almost flowing from her eyes, tells me, and I gulp.",
        "She would never have known what had happened to me.",
        "Arisa-san showed up after Charlotte-san went home, and Charlotte-san came back after Arisa-san left and I lost consciousness for a long time.",
        "So they must not have bumped into each other, and she must not know what I was told.",
        "Could it be that the earlier cancelled message had affected her?",
        "She hadn’t mentioned it, but I might have made her feel uncomfortable by doing something I normally wouldn’t do.",
        "But how does that lead to forcing a smile?",
        "If that were the case, she would have rather asked me why I lied to her about cancelling the meeting.",
        "If that’s the case, there must be another reason―",
        "“―Don’t try to find a reason. I won’t ask you what you are hiding. But please don’t force yourself to smile anymore…”",
        "The voice was so small and thin that it was almost muffled, but strangely enough I could hear it clearly.",
        "It was obvious to me what she was going through right now.",
        "Had I not been smiling in front of her properly?",
        "“……….What are you talking about, Charlotte-san? I’m not forcing myself to smile. Why would I force myself to laugh when I’m being hugged by my lovely girlfriend?””",
        "I thought about smiling better― this time, I tried to sound as cheerful as I could.",
        "I can’t let her worry about me.",
        "I want her to keep smiling.",
        "That’s what I was trying to do.",
        "“I see… I’m sorry, I misunderstood.”",
        "When Charlotte-san heard my words, she stammered a bit and then smiled back at me in a cute way.",
        "It seems a little forced, but it can’t be helped.",
        "Let’s just push it through.",
        "“Rather, let’s go on a date since it’s a good opportunity. I was so sleepy that I sent you a message earlier, but thanks to you, Charlotte-san, I’m completely awake.”",
        "I suggested a date to Charlotte-san to change the atmosphere.",
        "In fact, we could stay at home and make out, but if we stay at home, I might remember things and not be able to make an expression.",
        "That’s why I suggested that we go out to play, just to get some fresh air.",
        "“Akito-kun… don’t push yourself too hard, okay? You need to get a good night’s sleep.”",
        "Charlotte-san didn’t mention what she had just said, but smiled back at me jokingly.",
        "Charlotte-san didn’t want to leave me, even though she said she needed to get some sleep, so I guess it was just words and she wanted to go out and play too.",
        "“We’ve only been going out for two days, I still want to hang out with you.”",
        "“Fufu, thank you. But is it fine, aren’t you working as a private tutor?”",
        "“Oh, I’ve been given the day off beforehand, so I’ll be fine.”",
        "I thought there was a good chance that my confession would go well based on Charlotte-san’s behavior, so I took the next day off as well, although I felt bad for Aki.",
        "It was the beginning of our relationship and I knew I wouldn’t want to be separated from Charlotte-san.",
        "“Oh, by the way, you’re dressed boyishly today, aren’t you? Charlotte-san is so girly that she represents girls, but she also looks great in boyish outfits.”",
        "She wore a white drop-shoulder top that was much larger than what Charlotte-san usually wears, and dark blue half pants that were also larger.",
        "She also wears a black hat on her head.",
        "It’s not the kind of outfit you’d expect from such a gentle girl, and yet it’s strangely attractive enough to catch my eye.",
        "It seems that she immediately put on the outfit she bought yesterday.",
        "“Mou~, there’s nothing to compliment, is there?”",
        "“No, it really looks good on you. I mean, I think it’s too cute.”",
        "“I-Is that so…”",
        "When I praised her for being cute, Charlotte-san shyly twisted in my arms.",
        "I’m really happy when I’m with her.",
        "Even my wounded heart felt strangely healed when I was with her.",
        "Perhaps it was because of this that I became more and more positive.",
        "“Shall we go have fun then?”",
        "“Y-Yes…!”",
        "When I called out to her, Charlotte-san nodded happily.",
        "She’s really cute and innocent.",
        "“Is there anywhere you want to go?”",
        "“I’m happy to go anywhere with you, Akito-kun, so please go wherever you like.”",
        "“I-I see, well then, what should we do―”",
        "―I had a bad day this morning, but talking with Charlotte-san made me feel better, and I pondered where to go while being hugged by my cute little girlfriend."
    ]
}