{
    "id": "chapter-110",
    "title": "The Decision",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Akito’s POV**)",
        "“Well… first of all, let me say that I just heard about the marriage agreement today.”",
        "I didn’t want her to think that I had been hiding the arrangement from her, so I told her what she needed to know first.",
        "I’m not sure if Charlotte-san understood that, but she nodded her head and urged me to go on.",
        "Apparently, she was going to listen to everything I had to say.",
        "“And I don’t mean to accept the marriage, either. I’ve already got Charlotte-san to take care of me.”",
        "“Akito-kun…”",
        "I smiled, and Charlotte-san smiled back happily and pressed her face against my chest.",
        "I thought to myself, “Does that mean she’s relieved?”",
        "―Charlotte-san’s cheeks were puffed up when I looked up at her about ten minutes later.",
        "“Akito-kun.”",
        "“What’s the matter?”",
        "“Why didn’t you tell me about this when you heard about it?”",
        "I thought she was convinced― but Charlotte-san didn’t seem to be from the looks of it.",
        "The expression on her face clearly showed that she was completely sulking.",
        "“Let’s see…”",
        "“I was hoping that since I’m your girlfriend, you could talk to me about girl-related matters…”",
        "I see, so that’s the reason why she’s sulking…",
        "I think she already understood from my expression alone and talking that I was fine, but she didn’t like the fact that the conversation ended without her knowing anything about it.",
        "To be honest, I didn’t want her to worry, but if Charlotte-san wants me to talk to her, I’ll have to do it in the future.",
        "―No, I hope we don’t have to talk about this in the future.",
        "“I’m sorry, I didn’t want to worry you.”",
        "“I understand that… but I still feel lonely.”",
        "“Yeah, I’m sorry. I’ll talk to you next time if something happens, okay?”",
        "“…………”",
        "When I asked her to forgive me, Charlotte-san silently offered her head to me.",
        "I could immediately understand what it meant now.",
        "“Is this all right?”",
        "“Yes…”",
        "I gently stroked her head and Charlotte-san leaned her body against mine.",
        "She really has become a pampered child.",
        "I couldn’t have imagined this when I first met her.",
        "I hugged her body gently, and continued to stroke her head carefully.",
        "I have some business to attend to later, but I’d rather just leave it at that and enjoy our time together.",
        "…Well, if I do that, I’m going to face hell later, so of course I’m making a move.",
        "“Well, let’s go. And as for the marriage agreement thing, let’s just say no to it.”",
        "“Okay…!”",
        "I said this to Charlotte-san as I held out my left hand, and she nodded happily and took my hand in hers.",
        "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~",
        "Author’s Afterword:",
        "The cover illustration for “Otonari Asobi” has been released!",
        "Like, it’s so good!!",
        "(This is posted in the activity report.) [TLN: Part of syosetu website I think, the illus is below this afterword anyway]",
        "I hope you guys will take a look!",
        "And we’ve already started taking reservations.",
        "We hope you’ll make a reservation so that we can make sure you get your order in the midst of the corona outbreak…!",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Afterword: God, Charlotte-san and Emma look so adorable~!",
        "I’m going to do the Light Novel series too, so I hope you guys can also read it soon. Its’ release date is on February 25, 2022. Let’s hope I’m not busy at the time and in good health so that I can finish the volume in like a week! *Flashbacks to me posting like 70 chapters of this web novel in like a week lol*",
        "Editor’s Afterword: Truly God Bless this freaking year already. There’s so much to watch and read this year that I can’t even catch up to the past seasonal anime. Anyways, congrats to NekoKuro-sensei for the official announcement of Transfer Student’s Light Novel!",
        "God I’m gonna have too much fun editing this LN."
    ]
}