{
    "id": "chapter-90",
    "title": "You've Changed a Lot",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "“―That’s an amusement park, right…!?”",
        "When we arrived at the leisure park, Charlotte-san’s excitement rose when she saw the attractions in the park.",
        "Her eyes sparkled so brightly that you could see it even from the side.",
        "“Do you like amusement parks?”",
        "“That’s part of it, but I’ve always wanted to go to an amusement park…”",
        "When I called out to her, Charlotte-san squirmed and shyly twisted her head.",
        "Then she glanced up at my face and gave me a look as if expecting something.",
        "Yeah, what’s with this cute little creature?",
        "I tried my best to hold back the grin on my face as I opened my mouth.",
        "“I wonder if you’re longing to be here, or if you feel like you haven’t been able to visit much before.”",
        "“Well, it’s true that my parents are very busy, so I haven’t been able to visit them… But this time it’s different…”",
        "I thought that she really wanted to come and play, but for some reason Charlotte-san’s lips twitched and she sulked.",
        "I thought her sulking face was cute, but I opened my mouth again.",
        "“If that’s not it, what do you mean then?”",
        "“It’s…”",
        "When I asked her, she just fidgeted shyly and refused to say the rest.",
        "So I waited for her to say more, but when she did, she gave me a troubled smile.",
        "“Akito-kun, you’re usually very perceptive, but when it comes to something like this, you suddenly become insensitive, don’t you think? Are you enjoying teasing me, by any chance?”",
        "“Eh, no, not really, but…”",
        "“So you say, as if you’re like a main character from a romantic comedy. Girls would be in trouble for this…”",
        "Charlotte-san smiled as if she was joking, but it looked as if she was in some kind of trouble.",
        "Yeah, what do you mean by like a main character from a romantic comedy?",
        "I’ve been reading manga with Charlotte-san lately, so I know more about it than I used to, but I still don’t read enough to really understand it.",
        "And as far as romantic comedies go, Charlotte-san didn’t show me any either.",
        "“Well, sorry.”",
        "At any rate, I apologize to Charlotte-san since I seem to have annoyed her.",
        "Then, she immediately starts to panic.",
        "“Oh, no, I’m not accusing you of anything…!”",
        "“Haha, I know. I’m sorry for bothering you.””",
        "I know that Charlotte-san is not the kind of girl who would blame me.",
        "This is why I didn’t take it that seriously either.",
        "“Okay, so which one shall we ride first?”",
        "After a short break in the conversation, I asked Charlotte-san which attraction we should line up for.",
        "However―",
        "“Oh, um, I’m sorry but… I’d like to go pick some flowers.”",
        "For some reason, Charlotte-san, who’s not embarrassed but is fidgeting, said this to me while sounding a little bit embarrassed. [TLN: Idk, the line is literally like this like wtf so don’t blame me.]",
        "She must be embarrassed to say such a thing because she is a girl, but she really knows her Japanese well.",
        "“Oh, I get it. Go ahead.”",
        "“I-I’m sorry…”",
        "Charlotte-san apologized apologetically and ran towards the building.",
        "It seems that I have been putting up with a lot.",
        "At any rate, she stands out, and it seems to be pretty standard to pick up girls in these places, so it’s probably best to go with her.",
        "Of course, I would wait a little further away from the building so that she wouldn’t be embarrassed.",
        "When I tried to move with that in mind―",
        "“―Looks like you’re having fun, Akito.”",
        "Someone called out to me from behind.",
        "When I turned around to hear a voice that didn’t sound familiar, there was a handsome man standing there with a face that looked like a representative of a gentleman.",
        "“You…”",
        "“Hey, Akito. Do you remember me?”",
        "As soon as his eyes met mine, he gave me a smile that was so nice it could make a girl swoon.",
        "In fact, there were yellow cheers from several places.",
        "“―Hey, that guy is…!",
        "“No doubt about it, he’s the guy who’s been all over TV and magazines lately…!”",
        "“Eh, isn’t that bad!? Is it really him?”",
        "“Isn’t he!? There aren’t many guys as handsome as him!”",
        "…Yeah, I mean, he’s getting too much attention.",
        "“Well, well, it seems I’ve drawn attention to myself.”",
        "He didn’t seem to care much about the attention he was getting.",
        "I guess he’s gotten used to it.",
        "He’s quite a celebrity now…",
        "“It’s no wonder you’re here, you’ve been selected to compete for the Olympics at just 16 years old, you’ve skipped a grade, and you’ve produced results that are being touted as the future of Japan… Riku.”",
        "I called out his name, resisting the urge to press my hand to my forehead.",
        "This guy is Kannagi Riku, a former teammate of mine and Akira’s who is currently on the Olympic team.",
        "“Hey, I’m glad you remember me. It’s been two years since I’ve seen you.”",
        "“What are you doing here? You’re not the kind of guy who comes here to hang out, are you?”",
        "“Haha, I could say the same about you. You betrayed us, quit soccer, and now you’re here with your girlfriend. That Akito Aoyagi has changed a lot now, huh.”",
        "Riku cowered his shoulders and egged me on.",
        "What is this guy trying to do…?",
        "“―Eh, Akito Aoyagi is that…?”",
        "“Who is that?”",
        "“You’re a soccer fan and you don’t know? Look, it’s him!”",
        "“Ehh!? What’s this!?”",
        "Hearing Riku’s words, one of the girls who were watching around us reacted, and in response, the crowd began to buzz even more.",
        "Good grief… Just what the heck is he thinking, this guy…",
        "“We’re in the public’s eyes, don’t bring it up now. If you want to talk about it, I’ll tell you next time.”",
        "I turned my back on Riku as I knew from the situation around me that it was impossible for me to stay here anymore.",
        "I felt sorry for Charlotte-san once she came back, but it would be better to leave immediately.",
        "If I don’t, I’ll make her feel bad as well.",
        "“Ah, wait, Akito.”",
        "“Of course you can’t stay if you’re such a bad influence, you idiot. I don’t know what you think you’re doing, but I’m going to hate you for putting a damper on my date with her.”",
        "“Well, just wait. This will be over soon.”",
        "Riku said and walked over to the girls.",
        "And then he began to sign their jubilant clothes.",
        "If he did this without permission, he would normally be offended, but since he’s a popular and handsome guy who’s even on TV, he’s allowed to do it.",
        "That’s why good looking people are…",
        "I decided to watch the scene in disgust.",
        "Normally, I would hide and wait for Charlotte-san to come back, but I owe this guy a favor.",
        "So, I had no choice but to wait if this was going to stop.",
        "And I don’t want to disappoint Charlotte-san, who was looking forward to the amusement park.",
        "“―So, don’t tell anyone I’m here, and forget about what we talked about earlier.”",
        "“””””Yes…!”””””",
        "When he finished writing his signature, Riku winked with his index finger in front of his nose, which made the girls nod their heads with a heart in their eyes.",
        "He had completely captured the girls’ hearts.",
        "“―Okay, we’re good now.”",
        "After the girls left, Riku took out his hat from his bag and smiled at me while wearing it deeply.",
        "To such Riku―",
        "“Yeah, I hate you for now.” ― I replied.",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Comments: I initially planned to do 10 chapters today but my father called out to me very early in the morning to go somewhere with him and I didn’t even manage to take a bath. It was already night time when we returned home and he used the pc until very late at night. I had to rush until c90 so I’m sorry if there’s been some unclear lines here and there and it’s already 12:09AM when I finished this~ (Update at 9:30AM as of this writing: I waited for Matsu until 3am but I fell asleep and just woke up to his message. Sorry we were late to release these!)",
        "Editor’s Comment: It’s 4:21AM as of writing and editing this chapter and I apologize about that. I was quite tired because I had to get my credentials (which can be done by 2 years ago yes blame me for my lazy *ss.) and I fell asleep."
    ]
}