{
    "id": "chapter-103",
    "title": "The Situation is Beyond Imagination",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Akito’s POV**)",
        "“Disappointed?”",
        "It was no surprise that she was disappointed in me for not only letting her hear about my dark past, but also confiding in her that I was someone who would return the favor.",
        "So I asked her, but she shook her head slowly and kindly.",
        "“No, I’m not disappointed. I believe that even the kind Akito-kun was trapped to the point of becoming so, and I don’t blame you for losing your composure after hearing what they had done to you.”",
        "Charlotte-san, who said this, reaches her hand to my cheek and gently caresses it.",
        "She’s not hurting right now, but she seems to be comforting me.",
        "Her warmth envelops me, and I feel like letting myself go.",
        "But then―",
        "―*Ding-dong!",
        "As if to interrupt me, an intercom rang in my room.",
        "“Could it be that Emma-chan is back?”",
        "I couldn’t think of anyone else who would be ringing the intercom at this hour, so I asked Charlotte-san.",
        "“But in her case, I think you’ll hear her crying…”",
        "Wouldn’t you have to be crying to hear that?",
        "Isn’t it possible to hear it through the door in the first place?",
        "While wondering about Charlotte-san’s words, I answered the intercom.",
        "Then…",
        "“Hey, Akito! Why aren’t you responding to my call?”",
        "There was Akira in his soccer practice uniform.",
        "Charlotte-san and I looked at each other when we realized who was at the door.",
        "Charlotte-san buried her face in my arm, looking embarrassed.",
        "It was probably impossible to cut the conversation short, since Akira had come to my house to talk about this matter.",
        "If that happens, I won’t be able to keep him inside the room, and he’ll know that I’ve brought Charlotte-san with me.",
        "No, Akira would know that we were together in the first place.",
        "“My phone is so loud…”",
        "“That’s right, of course! You are now famous all over Japan!”",
        "No, Akira.",
        "It’s not the reason why my phone is so noisy, it’s the fact that I’m dating Charlotte.",
        "I opened my mouth with such a tweak in my heart.",
        "“Yeah, I know. It’s because of Riku that people are talking about me on social media, right?”",
        "This bothers me so much that I don’t know what to do about it.",
        "Not to mention the fact that Charlotte-san has stirred up everyone, and that image of her kissing me is probably spreading on social media.",
        "But― apparently, the situation was far beyond my imagination.",
        "“No, not only that, but you’re also being featured on TV!”",
        "“Ha…?”",
        "I couldn’t understand what my best friend was saying for a moment, and I looked at Charlotte-san’s face again.",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Comments: And with that, we’ve reached the latest chapter of the series! It took one and a half weeks to reach here huh. Why did the author have to leave us with this cliffhanger!?!?!? We’re a quarter into Matsu’s goal, help him achieve it by donating in his Ko-Fi. Thanks for all of the support!",
        "Editor’s Comment: To those madlads that had been donating on my ko-fi for the past few days, you guys are the best. As always, we’ve now reached the latest chapter of the We Gradually Grew Closer/Transfer Student and we’ve also reached the quarter of the goal on my ko-fi! Thank you very much, I couldn’t really express my gratitude to you guys on how happy I am."
    ]
}