{
    "id": "chapter-42",
    "title": "The Smiling Sisters",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "“Ahhhh~”",
        "After an uneventful day, Emma-chan sat on my lap and stared at my face with her small mouth wide open.",
        "I was soothed by Emma-chan’s cuteness and put a spoonful of pudding in her mouth.",
        "Then Emma-chan took a bite and started to eat it, gulping it down.",
        "She swallowed the pudding with a gulp, and her cheeks relaxed with satisfaction.",
        "Yes, Emma-chan is a really cute little girl.",
        "I just want to keep feeding her snacks and watching her cute smile.",
        "I stroked her head gently as I gazed at her smile.",
        "This moment is the most healing time I’ve had lately.",
        "I wish this time could go on forever.",
        "“―Emma is being unfair…”",
        "While I was repeatedly feeding Emma-chan and patting her on the head, Charlotte-san, who was sitting across from me, muttered something.",
        "If you look at her closely, you’ll see that her cheeks are puffed up for some reason.",
        "Come to think of it, I think she puffed her cheeks out every time we passed each other after we arrived at school.",
        "Did I do something to her without knowing it…?",
        "“Erm, is there something wrong…?”",
        "“Eh? Ah―”",
        "When I called out to her fearfully, Charlotte-san’s face showed a huff of surprise.",
        "After that, she began to look around as if she was troubled, and then she looked at me as if she couldn’t find what she was looking for.",
        "“Umm, are you okay…?”",
        "“I-I’m fine! I was just thinking about that… thing for a minute!”",
        "“If you have any problems, I can help you, you know?”",
        "“No, no, it’s nothing! It’s not something that requires consulting Aoyagi-kun for advice.”",
        "Charlotte-san is desperately denying it.",
        "It looked like there was something wrong with her, but if she refused to go that far, I couldn’t pry further.",
        "“Hmm…”",
        "When I was wondering what to do, Emma-chan in my arms jerked back.",
        "I loosen my hold on her a little bit, and she takes the spoon from my hand and scoops up the pudding on the plate.",
        "And then―",
        "“Here you go, Lottie.”",
        "―She offered the whole spoon and pudding to Charlotte-san.",
        "It looks like she’s trying to do the same thing to Charlotte-san that I just did to her.",
        "While Charlotte-san and I tilted our heads in wonder, Emma-chan smiled and opened her mouth.",
        "“You want some too, don’t you Lottie? Here you go, say ‘ahhh~'”",
        "It seems that Emma-chan thought that Charlotte-san wanted pudding.",
        "Charlotte-san probably didn’t want pudding, but she couldn’t ignore her sister’s kindness, so she accepted the act.",
        "As she ate, she glanced shyly at my face, which was very cute.",
        "“Is it good?”",
        "Emma-chan, who gave her the pudding, happily asked Charlotte-san what she thought.",
        "“Yes, it’s delicious. Thank you, Emma.”",
        "“Ehehe~”",
        "When Charlotte-san thanked her, Emma-chan smiled even more happily.",
        "Seeing the Bennett sisters smiling at each other made my heart feel clean.",
        "I no longer cared what Charlotte-san had done to deceive me.",
        "◆",
        "(**Aoyagi’s POV**)",
        "“―Hey, hey, Onii-chan.”",
        "I was watching TV with the two of them when Emma-chan, who was in my arms, looked up at me.",
        "“What’s wrong?”",
        "“Tomorrow is a School good night, right? Emma wants to go play with Onii-chan.”",
        "Tomorrow, huh…",
        "It’s true, Emma-chan is right, tomorrow is Saturday, so school is not in session.",
        "However, I have an appointment with Aki…",
        "“That’s not possible, Emma. Aoyagi-kun has a date with a girl tomorrow.”",
        "Before I could say no, Charlotte-san denied it.",
        "I was concerned about her puffy cheeks, but there was something else that bothered me more.",
        "I hurriedly opened my mouth to point it out.",
        "“No, Charlotte-san? It’s true that we have plans, but it’s not a date, okay?”",
        "As expected, I couldn’t overlook this misunderstanding.",
        "It would be a bad thing if people thought I was trying to date another girl.",
        "“…The person you are going out with is Hanazawa-san that you met the other day, right?”",
        "“Yes, it’s her, but…”",
        "“You’re going out alone with her, aren’t you?”",
        "“Well, yeah. I haven’t invited anyone else.”",
        "“By the way, where are you planning to go?”",
        "“We basically go wherever Aki wants to go, so we haven’t decided yet, but we usually go to the zoo, aquarium or movie theater.”",
        "“…..It’s a date no matter how you look at it… And I can’t believe you’ve hung out with her so many times already…”",
        "When I answered Charlotte-san’s question, she was disappointed when I told her about the locations.",
        "I don’t know what she said after she nodded her head, but I knew she had misunderstood me.",
        "“Well, I think you misunderstood me, but it’s not really a date, okay? We’re just going out for fun, okay?”",
        "“…If that’s the case, would you like to have fun with me too?”",
        "“Eh?”",
        "“The day after tomorrow, you can have fun with me, too. Of course, it goes without saying that Emma will also be there…”",
        "“Oh, I see.”",
        "Charlotte-san is trying to make a promise to play with me for Emma-chan’s sake.",
        "She knows she can’t do it tomorrow because I have an appointment with Aki, so she’s probably going to try to convince Emma the day after tomorrow.",
        "…..I’m embarrassed that I expected it for a moment.",
        "Well, I didn’t say it out loud, so I’m sure Charlotte-san doesn’t know that I misunderstood.",
        "More importantly, I have to think about how I’m going to respond to the invitation―",
        "The test starts on Monday.",
        "If I’m going to keep my grades up as usual, I’d like to use Sunday to study since Saturday is already taken…",
        "I glanced at Emma-chan, who was in my arms.",
        "We were speaking in English, but Emma-chan looked up at me with a puzzled expression on her face, as if she didn’t understand our conversation.",
        "If I said no, she’d probably cry…",
        "When I looked over, Charlotte-san, who had invited me, was also staring at my face with an anxious expression.",
        "The expression on her face is as if she is afraid of being rejected.",
        "Well, I guess I’ll just have to force myself.",
        "Besides, to tell you the truth, I want to hang out with Charlotte-san too.",
        "“Sure, let’s go out somewhere on Sunday.”",
        "“A-are you sure!?”",
        "“Yes.”",
        "When I nodded in response to Charlotte-san’s question, her face lit up.",
        "She looked down and made a small gut pose, saying, “Yes, I did it!” which I thought was an overreaction to the fact that she was so happy, but I’m also glad she was happy.",
        "It’s really sweet of Charlotte-san to be so happy for her sister.",
        "―As I looked at Charlotte-san, who was still so happy, I felt a smile on my face as I saw two sisters who were so close to each other."
    ]
}