{
    "id": "chapter-122",
    "title": "Adopted",
    "content": [
        "Translator: AJ1703",
        "(**Akihito’s POV**)",
        "“As if she was your real daughter, huh… Well, as the story goes, I understand that you have known Kanon-san since she was a little girl… but that’s like saying that the Bennett family has been interacting with the Himeragi family for so long…?”",
        "“Yeah, ever since I was very young I think.”",
        "“…I didn’t have any interaction with them though.”",
        "Charlotte-san reacts to her mother’s words with some frustration.",
        "Indeed, for all their interaction, it is strange that Charlotte-san and Kanon-san were not acquainted until recently.",
        "“All I can say is a lot has happened… To begin with, Lottie didn’t even know that I knew the President, did you?”",
        "“…Yeah.”",
        "When I heard about Charlotte-san’s old house, I guessed she was a rich lady.",
        "But she didn’t know much about it herself.",
        "That meant that Charlotte-san’s mother had hidden it from her.",
        "“Sounds like a lot of complications…”",
        "“Well, I guess you could say that a lot of things are intertwined to create the situation we’re in now.”",
        "The mother of Charlotte-san laughed when I complained.",
        "It’s like, really, how many things are intertwined?",
        "“I know you’re probably going to ask, so I’m going to go ahead and tell you, the reason I didn’t tell Lottie is because I don’t intend to make her the president. No matter how you look at it, she’s just not cut out for it.”",
        "“She’s such a good and honest girl.”",
        "Charlotte-san was miffed, but I agreed with her.",
        "She has the ability to organize people and is loved by her subordinates, but she will definitely lose her footing.",
        "Some of the people who rise to the top by following others are those who cheat others or look for weaknesses.",
        "Above all, I only feel like I’m being cheated by bad people.",
        "“Besides, I wanted Lottie to be free to do whatever she wanted.”",
        "“So you were going to leave it to your relatives?”",
        "“No, I don’t have any relatives. The company itself is bigger than the Himeragi conglomerate, but the family was not blessed with many children. Even I was adopted.”",
        "“―!?”",
        "That must have been the first time Charlotte-san had heard of it.",
        "Similarly to me, she stared at her mother’s face in surprise.",
        "Perhaps Charlotte-san’s mother was taking care of me because I reminded her of her past.",
        "“I’ll tell you about that eventually. Right now, we’re focusing on Akihito-kun.”"
    ]
}