{
    "id": "chapter-72",
    "title": "The Crane Game",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "After taking a break and drinking a refreshment at the cafe, we wandered around the department store again.",
        "There was a live concert going on in the plaza, so Charlotte-san and I went to watch it, but there was a slight problem.",
        "There was a girl who sang even better than the others, and I couldn’t help but listen to her, but then Charlotte-san let out a sultry “Mou~…” and pulled my arms tighter around her chest.",
        "No, Charlotte-san is not conscious of her breasts or anything like that… but it made it hard for me to concentrate on the concert and I couldn’t stop thinking about her.",
        "And Charlotte-san was still resting her head on my shoulder with her cheeks puffed out.",
        "I don’t know how long this girl has been sulking, but she’s getting spoiled.",
        "Emma-chan is also quite a spoiled child, so I wonder if her older sister Charlotte-san, was also this much spoiled too?",
        "I wonder what I should do if I go out with her and Charlotte-san becomes a very spoiled girl, too…? No, that’s totally fine, I guess?",
        "Because as I just imagined it, I think she would rather be very cute.",
        "I’d rather spoil her.",
        "…I wonder how she would react if I stroked her head right now?",
        "Will she show me a pampered attitude― No wait, what am I thinking!?",
        "I was just about to go into delusional thinking because of how cute Charlotte-san is, but I came back to myself in a panic.",
        "I almost did something terrible.",
        "If I was in a relationship with her, it would be fine, but stroking the head of a girl my age who I wasn’t in a relationship with, I could be accused of sexual harassment.",
        "I don’t know what to do, but I feel like Charlotte-san is gradually destroying my reason.",
        "I know it’s just a hunch, but if we continue like this, I’m really going to do something terrible.",
        "“Umm, Charlotte-san… I’m sorry, but can you please stop hugging me…?”",
        "You may think why am I only saying this now, but I’m saying it now because I have to.",
        "At any rate, Charlotte-san is too cute for me, and I’ve reached my limit.",
        "“Ehh…? Is it, no good…?”",
        "Naturally, Charlotte-san, having been told that she could not do something she had been allowed to do before, looked at me with a sad expression on her face.",
        "She gazed at me with moist eyes, as if she was pleading with me.",
        "And then she just swooned and tried to let go of my hand.",
        "Oh, my God!",
        "That’s not fair!",
        "Charlotte, you’re really cheating!",
        "“I’m sorry, it’s fine, after all.”",
        "I grabbed Charlotte-san’s hand as she pulled away and led her hand into my arm.",
        "I can’t tell her not to if she looks at me like an abandoned puppy.",
        "I felt twice as guilty as I should have because Charlotte-san was so cute.",
        "“Is it really okay…?”",
        "Charlotte-san asked hesitantly, perhaps because she had already been told not to.",
        "But when I nodded my head, her face lit up and she hugged me.",
        "The reason I didn’t say anything was because I was embarrassed, but when she looked so happy, I was happy too.",
        "It’s just a matter of how long I can hold my reason…",
        "―We walked through the department store with my arms around Charlotte-san, thinking that it would not last too long.",
        "◆",
        "“Ah―Neko-chan…”",
        "Charlotte-san, who was walking with me, suddenly muttered.",
        "In response to the word “Neko-chan,” I looked around, but I couldn’t find a pet store anywhere.",
        "There must be only one pet store in this department store, after all.",
        "Could it be that some stray cats have gotten into the store?",
        "So I followed Charlotte’s gaze and found a UFO catcher in the arcade.",
        "And there are a lot of stuffed cats in it.",
        "Apparently, she was interested in stuffed cats.",
        "“Do you want a stuffed animal?””",
        "“Eh? Oh, I think it’s cute, but I can’t take it, so I give up.”",
        "Yes, it seems that she wants it.",
        "“―Hmm, Aoyagi-kun…?”",
        "As I stepped towards the crane game, Charlotte-san looked up at me curiously.",
        "“I thought you might like to have a look. Do you mind if I have a moment?”",
        "“Yes…”",
        "From Charlotte-san’s point of view, it seemed strange that I would go to a video game arcade.",
        "She was right about that.",
        "I’m not going to go to the arcade on my own.",
        "But I’ve been there a few times with Aki.",
        "And I was always the one who was forced to get what Aki wanted from the crane game.",
        "As I approached the crane game, I tried to see if I could get a stuffed animal.",
        "The stuffed cat that Charlotte was looking at so eagerly was small enough to fit in the palm of her hands.",
        "The crane’s arm is narrow and the shield protecting the hole to drop the stuffed animal is low.",
        "―Yeah, I think I could get it without any problem.",
        "“Which one do you want, Charlotte-san?”",
        "I ask Charlotte-san which one she wants, since there’s a surprisingly large variety of prizes, including one that looks like a tortoiseshell cat and another that looks like a tiger cat.",
        "“Are you going to get it for me…?”",
        "“Yes, I am. Which one do you want?”",
        "“But…”",
        "Charlotte-san is reluctant to play the crane game, as if there is some resistance.",
        "I wonder if she is worried about money.",
        "“Don’t worry, I’m going to do it, so I’ll pay for it.”",
        "“Ah, no, I wasn’t worried about the money…”",
        "She seemed to be having a hard time saying something.",
        "What’s wrong with her?",
        "“Um, I’ll stop if you don’t like it…”",
        "“N-no, I don’t hate it, but… Well, I want that cat over there.”",
        "For some reason, Charlotte-san, who looked as if she had taken the plunge, pointed to a stuffed cat with drooping ears.",
        "I wondered if the model was the same Scottish Fold as the cat in the pet store.",
        "You’re doing something surprisingly elaborate…",
        "“Yeah, I got it. There it is.”",
        "“Ah, money―”",
        "I nodded and took out a hundred yen from my wallet and put it in, and Charlotte-san, who was holding a five hundred yen in her hand, looked troubled.",
        "It’s not a good idea to be too selfish, because it will bother her, but it’s probably okay.",
        "I pretended I hadn’t seen Charlotte-san’s expression and concentrated on the target cat.",
        "However―",
        "“―Ah, so close…!”",
        "The target fell off the crane just before the exit.",
        "As soon as the crane came down, I knew I had messed up, but Charlotte-san seemed to be nervous until the very last second.",
        "But now I know the approximate width of the crane opening.",
        "If I could just burn the image into my mind and fine-tune it―",
        "“―Wow, amazing…!”",
        "Charlotte-san shouted in delight as the target fell into the exit properly the second time.",
        "Her tone of voice has changed from the usual honorific to a tame tone, indicating that she is unusually excited.",
        "I’m sure the real Charlotte-san is very cute and childlike…",
        "“Here you go.”",
        "I took out a stuffed cat from the crane exit and handed it to Charlotte.",
        "Then Charlotte-san hugged the stuffed animal tightly and looked up at me with reddened cheeks."
    ]
}