{
    "id": "chapter-52",
    "title": "The Promise Decided When The Tests Were Over",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "“I’m finished…”",
        "On the last day of the test, as soon as the last test was over, Akira, who was sitting behind me, plopped down on his desk.",
        "While everyone else in the class is talking about what they’re going to do after the test, Akira is the only one with a negative aura and refuses to look up.",
        "It’s kind of painful to watch.",
        "“Hey Akira, what do you mean by ‘finished’? You mean that tests are over, right?”",
        "“Don’t ask me that…”",
        "I asked him about it, but judging from his reaction, it seemed to mean that the test results he would be getting were quite troubling.",
        "At least, it would be nice if he could finish the tests with a score that wouldn’t make Miyu-sensei furious… It would be unfortunate if he got failing marks in all subjects.",
        "In the case of Akira, he didn’t write any notes on his answer sheet for self-grading― or rather, he couldn’t even grade himself because he didn’t have enough time to write notes.",
        "Akira will probably not be able to relax until he gets the test results back.",
        "…That may be just what he needs right now.",
        "There was nothing he could do about the test results after all, even if he had to worry about them now.",
        "It’s better to at least take his mind off of it and let him forget about the test until they were returned.",
        "People can forget the worst things when they are having fun.",
        "That’s why I need Akira to do something for me.",
        "“Akira, it’s fine that you’re lying down, but aren’t you forgetting something? If you don’t hurry up, people will make their own plans for the day, you know?”",
        "“Hmm? Did we have something to do today…?”",
        "“Hey now, we had an agreement. We promised to do it after the test.”",
        "“…Ah, that’s right!”",
        "Akira, who had been lying on his desk thinking for a while, looked up when he understood what I was trying to say.",
        "Apparently, Akira also remembered.",
        "“Guys! Why are you making promises without permission? Did you forget what we’re doing today?”",
        "Akira hurriedly got up from his chair and called out loudly to all of our classmates.",
        "I wondered if he was the one, who had forgotten about it, should say that, but I kept quiet and waited for his next words.",
        "“The tests are finally over! Let’s all have a welcome party for Charlotte-san!”",
        "―Yes, I had made him postpone it before the tests, but now that they were over, we were going to have a welcome party for Charlotte-san as well.",
        "Naturally, I had told Charlotte-san in advance, and made arrangements for her to attend this time.",
        "Emma-chan had started going to a daycare center for child foreigners this week, so I asked the center to take her until late today.",
        "Because of the tests, Charlotte-san and I were separated after breakfast today, but she didn’t seem to be in a hurry when she showed up at school, so I guess she accompanied Emma-chan to the nursery school very early.",
        "Charlotte-san seemed to be very happy when I told her about the welcome party, and I hope she enjoys it.",
        "“Ah, that’s right!”",
        "“Yes, of course. We need to have a welcome party for Charlotte-san!”",
        "As if in response to Akira’s call, the class began to buzz.",
        "It seems that everyone is okay with having Charlotte-san’s welcome party today.",
        "“But what about the place? It’s hard to find a place that can accommodate such a large number of people on such short notice…”",
        "“Oh, that’s…”",
        "Akira looked troubled when one of our classmates asked a very obvious question.",
        "I guess he hadn’t thought about the location at all.",
        "It’s not surprising since I had forgotten about it, and I was expecting this to happen, so it’s not a problem.",
        "“I’ve made a reservation at a restaurant that one of Miyu-sensei’s friends owns. They’re willing to accommodate a certain number of people, and they’re offering a student discount.”",
        "I had heard about the restaurant from Miyu-sensei, and had asked her to talk to her friend about it beforehand.",
        "She also agreed to give me a discount because I was a student.",
        "She is a good person who really cares about her students.",
        "However, there was one condition for her to rent out the restaurant and to give us a discount.",
        "That is, if the food is good, she wants us to advertise it.",
        "I’ll ask Akira to tell everyone about it later.",
        "“Oh, as expected of Akito! You did a great job!”",
        "“Hee~, Aoyagi-kun is surprisingly thoughtful…”",
        "When Akira heard my words, he happily tapped me on the shoulder, which was unusually admiring for a classmate.",
        "At any rate, the shoulder that was hit hurt, so I’ll give it back to Akira.",
        "“It’s time for us to split up and move around!”",
        "With Akira’s call, we all formed small groups and started to move around.",
        "The name, location, and start time of the restaurant have already been communicated through the class group chat, so everyone will be able to get there even if they don’t go together.",
        "Akira’s decision was the right one, since it would be more inconvenient for the people in the city if we were all moving together.",
        "However, since we have to greet the shopkeepers, I guess we should get there first.",
        "“Akira, shall we go ahead?”",
        "“That’s right. Lead the way, Akito.”",
        "“Okay.”",
        "Akira and I picked up our bags and walked out of the classroom past our classmates.",
        "As we did, we passed Charlotte-san, but we didn’t exchange any words with her.",
        "Even though we get along well at home, I try not to talk to her at school.",
        "It was the first promise I made to her, and she kept it.",
        "At school, this is fine.",
        "It’s more of a problem if I get involved with her and they find out about my friendship with her.",
        "At any rate, I’m glad that nothing seems to be wrong.",
        "―After this, as if to taunt me for thinking such a thing, I went to a store where an unexpected trap of God was waiting for me."
    ]
}