{
    "id": "chapter-88",
    "title": "The BakaCouple",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "“―Ehehe~…”",
        "As I was being rattled around on the train, I soon heard laughter coming from next to me.",
        "If you look into her face, you will see that Charlotte-san’s cheeks are slack and loose.",
        "Then, as our eyes met, her cheeks instantly turned bright red.",
        "“You’re in a good mood.”",
        "“Ah, umm… it’s a date, you know.”",
        "I smiled at her cute appearance and she fidgeted, then pressed her face into my arm.",
        "Apparently, she was still getting embarrassed.",
        "We were both sitting in our seats, and since it was around noon, the train was not crowded, so there was no one around, but if she had done this in a crowded place, I would have gotten a lot of jealous looks.",
        "I really can’t help but think Charlotte-san is cute.",
        "So I couldn’t help but pat her on the head, but for some reason she ran away from my hand.",
        "I regretted the unexpected reaction, but when she escaped from my hand, she reached for her hat and started to take it off.",
        "She glanced at me sweetly and then offered her head to me.",
        "Apparently, she wanted to take off her hat when she ran away from my hand.",
        "So I stroked her head again, and she leaned even closer to me.",
        "She shifted her face to my chest and looked up at me shyly but sweetly.",
        "I’m sure there’s no man who doesn’t find her cute.",
        "“Charlotte-san usually acts like an adult, but she’s actually just as spoiled as Emma-chan.”",
        "“I-I feel conflicted when you say that I’m similar to Emma… It’s just that… Even though I act like an adult, I’m still a girl, you know…?”",
        "She puffed out her cheeks a little bit, as if she was thinking about being called the same as the young Emma-chan, but then she quickly turned her gaze away from me, looking embarrassed.",
        "She was so embarrassed that she rephrased her words, but it seemed that she was just trying to act like an adult, but really wanted to be pampered.",
        "Naturally I couldn’t resist, so I slid my hand from Charlotte-san’s head to her cheek and started stroking her.",
        "Then she smiled happily while looking ticklish.",
        "Then she began to stare at my face with feverish eyes.",
        "“Akito-kun…”",
        "“Oh, umm… what’s wrong…?”",
        "“………….”",
        "When I responded to my name, Charlotte-san fell silent.",
        "But her gaze never leaves mine, and she gives off an air of wanting something.",
        "This is――― No, I won’t be fooled by this anymore.",
        "I’ve been misled and embarrassed enough, so I’m not going to let myself think that this is a face that wants to be kissed.",
        "“Would you like it better this way?”",
        "I didn’t want to be embarrassed by the misunderstanding anymore, so I moved my hand from her cheek back to her head.",
        "Then….",
        "“Mou~…Akito-kun is so mean… such a tease…”",
        "Charlotte-san puffed out her cheeks and turned her head away.",
        "That’s strange, did I make a mistake again?",
        "“Do you like it here better…?",
        "“…You’re such a tease…”",
        "I put my hand back on her cheek because she was sulking, but Charlotte-san’s cheeks puffed up even more.",
        "I don’t know what’s wrong with her.",
        "At least I didn’t tease her.",
        "“I’m not teasing you, though…?”",
        "“…………”",
        "When I told her honestly what I was thinking, she gave me a very argumentative look.",
        "The expression on her face was the same as Emma-chan’s when she was sulking, and it made me think that they really are sisters, even if it was out of place.",
        "“What’s wrong with you?”",
        "“You’re trying to make me say it, you’re really such a tease…”",
        "Hmm… No matter what I say, I keep being called such a teaser.",
        "I’m not sure what to do, if I keep petting her, will her mood improve?",
        "Understanding that there’s nothing I can say to her now, I concentrate on stroking Charlotte-san’s cheek and head.",
        "Then, she collapsed into my lap as if she had lost her strength in the process.",
        "“Eh, wait, are you okay…?”",
        "“I-I’m fine…”",
        "When I called out to her, she sounded somewhat listless.",
        "But as I stared at her with concern, she began to move her head.",
        "Then she moved to a position where she could use my lap as a pillow and put her head on it.",
        "This action made me understand.",
        "She just wanted me to give her a lap pillow.",
        "…No, yeah.",
        "Charlotte-san, will you please stop it?",
        "I think my heart is about to burst…",
        "I kept my calm attitude for a long time, but to tell you the truth, I was nervous about Charlotte-san’s pampered mode on the inside.",
        "I’ve already reached my limit, because she’s been taking it easy on me.",
        "She’s cute, but she’s so cute that I don’t think my heart can take it anymore.",
        "―In the end, I kept getting hit by Charlotte’s cuteness until we reached the last stop.",
        "Well, yeah.",
        "We’ve already passed Okayama station, which was our usual stop, and somehow we’re at Fukuyama station, what am I supposed to do with this…?",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Comments: The chapter title was originally something like “bakkapuru no futari”. Hence, the title being “The BakaCouple” which literally means Idiotic Couple kek."
    ]
}