{
    "id": "chapter-100",
    "title": "I'd Like to Stand Next to You",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Akito’s POV**)",
        "“…Do you want to sit on my lap?”",
        "I asked Charlotte-san, who hadn’t moved away from me when we got back to the room.",
        "Then she nodded her head shyly, sat up and looked at me.",
        "Apparently, she was waiting for me to ask her out.",
        "I repositioned myself so that she could sit down, and opened my arms to welcome her in.",
        "“…………”",
        "Charlotte-san sat on my lap and rubbed her cheek against my chest without saying a word.",
        "When she’s in her pampering mode, she’s just like Emma-chan.",
        "They’re related by blood, so I guess that means they truly are sisters.",
        "*Pull pull―",
        "As I stared at Charlotte-san, who was being pampered, for some reason she suddenly looked up at me and began to gently tug at the clothes on my chest.",
        "The heat in her eyes as she gazed at my face showed that she wanted something from me.",
        "―Yes, I’m already well aware that this is not begging for a kiss.",
        "So I reached for her beautiful, silky, silver hair.",
        "“Ehehe~…”",
        "As I gently stroked her head, Charlotte seemed satisfied and resumed rubbing her cheek against my chest.",
        "It was soothing to watch, but at the same time, my heart was beating so fast it hurt like hell.",
        "The destructive power of Charlotte-san in her pampered mode was so different from her normal self that it would have easily destroyed most men’s reasoning.",
        "“I’m sorry for ruining our date…”",
        "When I realized that her mood was getting better and better, I apologized for ruining our date.",
        "“It’s not your fault, Akito-kun…”",
        "The fact that I was involved in this is certainly a big part of it, but it still hurts my heart because Charlotte-san was looking forward to it.",
        "“The next time, I’ll take you to an amusement park.”",
        "“I wonder… when the next one will be…”",
        "Charlotte-san’s bitter smile made my heart ache even more.",
        "It was just a coincidence that the two of us were able to go out on a date alone today, and normally Emma-chan would be here with us.",
        "She’s a kind and caring person who doesn’t treat Emma-chan as a hindrance, but I’m sure she still wants to play alone with me.",
        "To be honest, I also want to play alone with Charlotte-san.",
        "Of course, it’s not that I don’t like having Emma-chan around, but there are a lot of things I can’t do unless it’s just the two of us, so it can’t be helped.",
        "So I wanted to talk to Charlotte-san and her parents next time, if possible.",
        "“Let’s go as soon as possible.”",
        "“Yes…”",
        "When I promised that we would go to the amusement park together, Charlotte-san gave me a sweet look again.",
        "This time, I stroked her cheek.",
        "Then, Charlotte-san gave me a ticklish but happy smile.",
        "She really is a cute girl.",
        "The more I spend time with her, the stronger I feel that I don’t want to leave her.",
        "―After about an hour of petting Charlotte, she slowly sat up.",
        "Maybe she was already satisfied.",
        "I was a little disappointed because I wanted to stroke her a little more, but I didn’t want her to feel persistent, so I let her go.",
        "Then Charlotte-san stared at me from a very close distance.",
        "“What’s wrong?”",
        "I asked her, a little upset that her cute face was so close to mine.",
        "I didn’t know what she was going to say, because the atmosphere was different from before.",
        "I’m sure I didn’t offend her by petting her in the wrong places.",
        "Basically, I just stroked her head, cheeks, sometimes under her chin and neck, but not below that.",
        "So I don’t think it’s possible that Charlotte-san is angry with me…",
        "I stare at Charlotte-san’s face, while I brace myself a bit.",
        "And then―",
        "“I’d like to stand next to you too, Akito-kun…”",
        "Somehow, she said something I didn’t quite understand."
    ]
}