{
    "id": "chapter-36",
    "title": "Reversal of Position",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "“I’m still sleepy…”",
        "I woke up with the sunlight penetrating through the curtains and tried my best to keep my heavy eyelids open as I got ready for school.",
        "I brushed my teeth, fixed my sleeping habits in the shower, and washed my face, but the sleepiness still remained.",
        "Maybe it was because I used to be so alert, but I used to be clear-headed even when I woke up from sleep.",
        "If my body is this full of energy, maybe I should at least start running again.",
        "―*Ding-dong!",
        "“Hmm?  Who could it be this early in the morning?”",
        "I opened the door, wondering since I’ve never had someone come early in the morning before.",
        "From there―",
        "“O-ha-yo-u, Onii-chan!” [TLN: If you don’t even know what “Ohayou” means, I’m not sure you should be even reading here jk xD]",
        "An overly cute angel greeted me with a big smile on her face.",
        "“Oh, Emma-chan? You can speak Japanese now?”",
        "Emma-chan greeted me in Japanese, and I couldn’t help but respond to her in Japanese too.",
        "“…………?”",
        "Emma-chan, who of course did not understand Japanese properly, did not understand what I was saying and tilted her head.",
        "Then she nodded with a smile and looked at me with her arms wide open.",
        "Apparently, she was begging me to hold her.",
        "I don’t think she understood what I was saying, but she nodded appropriately.",
        "Well, it was my fault for speaking to her in Japanese, so I stopped worrying about it and bent down.",
        "When I looked at Emma-chan, I smiled and said, “O-ha-yo-u” in the same way.",
        "She seemed to be learning the Japanese greeting, so I decided to help her get used to it.",
        "“Ah―O-ha-yo-u!”",
        "I guess she was happy that I greeted her in the same way, so she greeted me again in the same way.",
        "It was so cute to see her smiling happily at me.",
        "I could have greeted her in the same way again, but I felt like that would have been a weasel move.",
        "So I decided to fulfill Emma-chan’s first request.",
        "Emma-chan’s eyes sparkled with happiness as I reached for her tiny body.",
        "I hug her tightly so I don’t drop her, then lift her up, and Emma-chan does the same, putting her arms around my neck.",
        "Then she gave me a kiss on the cheek as usual.",
        "This girl really is a spoiled child.",
        "But that’s what makes her so cute, I guess.",
        "When she said “Onii-chan” in Japanese with good pronunciation, I really wanted to make her my sister.",
        "She said she wanted to learn how to speak Japanese a while ago, but I was impressed by the way she was trying to learn it.",
        "Speaking of which, I wondered why Emma-chan had come to my room in the morning.",
        "As I wondered, I felt the presence of someone at the door.",
        "When I looked over, my eyes met Charlotte-san’s. For some reason, she had only her head sticking out of the door and was looking at me.",
        "“Ah… G-good morning…”",
        "I’m not sure if it’s because our eyes met, but Charlotte-san greeted me with a fading voice.",
        "And then, for some reason, her face gradually hid behind the door.",
        "Charlotte-san said she wasn’t afraid of me, but it still looks like she’s afraid of me no matter how I look at it.",
        "After all, she’s trying to hide behind the door because she’s afraid of me, isn’t she?",
        "“Good morning.”",
        "I greeted her with a smile, shocked in my heart but trying not to let her know that I was shocked.",
        "“U-umm, sorry to bother you this early in the morning…”",
        "“No, don’t worry about it, it’s fine, did something happen?”",
        "I stared at Charlotte-san’s face as I dealt with Emma-chan, who was being spoiled in my arms.",
        "Then Charlotte-san came out of the door, but for some reason, she mumbled something in a small voice while fidgeting with her fingers together.",
        "Her voice was so low that I couldn’t make out what she said at all.",
        "“I’m sorry, what did you say?”",
        "I felt bad asking her back, but I couldn’t just give a random reply in this situation.",
        "And since she came all the way early in the morning, I guess it was very important.",
        "“I was wondering… if we could… join you… for breakfast…”",
        "“Eh?”",
        "“Like what I’ve said already… Let’s have breakfast… together…”",
        "“Eh?”",
        "“You’re making me repeat again… Aoyagi-kun, you’re such a bully… Even though you could definitely hear me…?”",
        "When I asked her again and again, Charlotte-san, who had been fidgeting, now puffed up her cheeks and sulked.",
        "No, I was sure that I had heard her the second time, but my brain just couldn’t catch up.",
        "If it was just for breakfast, I would have been invited yesterday.",
        "But the reason why she asked me yesterday was because we were together in the morning.",
        "But today, not only did she come all the way to my house, she asked me out in an embarrassed manner.",
        "This is― is it fine to think of it this way?",
        "Maybe she’s not scared of me, maybe Charlotte was just embarrassed?",
        "…No, calm down, me.",
        "I’m taking it too much for my own good.",
        "If I make a mistake here, I’ll become a narcissistic embarrassment.",
        "Originally, Charlotte-san had a shy side to her.",
        "Maybe she wasn’t scared of me, but it was quite possible that she wasn’t shy out of fondness for me, but she’s just shy because of something that happened.",
        "I’m sure it’s embarrassing enough to invite someone of the opposite gender for breakfast.",
        "“Ah, it’s just… Aoyagi-kun said he wanted to eat my cooking every day… and Emma also wanted to eat with Aoyagi-kun… that’s why… umm…”",
        "When I took too long to reply because I was thinking, Charlotte hurriedly began to speak.",
        "I started to feel sorry for her as her eyes started to tear up.",
        "“I’m sorry, I was just thinking about something. I’m very happy that you came all the way to make breakfast for me. Thank you.”",
        "I smiled and thanked her, hoping that her panic would put her mind at ease.",
        "I was actually very happy that she invited me to eat with them and that she offered to make me breakfast.",
        "Probably, no man would ever refuse such an invitation from her.",
        "On the other hand, if people knew that I was in such a situation, they would probably turn on me out of jealousy…",
        "There is one more thing that occurred to me.",
        "In the past, if she had asked me out to eat with her, or if her face had been near me, I would have freaked out.",
        "But now, for some reason, Charlotte-san is quite nervous, and I am able to stay calm.",
        "I think it’s possible for people to stay calm when someone else is more nervous or uptight than themselves."
    ]
}