{
    "id": "chapter-47",
    "title": "Fortune Brought By Misfortune...?",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "―I was naive.",
        "How stupid was I?",
        "As we got off the train at Okayama station to change trains, I was currently regretting my naivety.",
        "That’s because―",
        "“Hey, look, that girl.”",
        "“What? Oh man… she’s high level… I’ve never seen such a beautiful girl before…”",
        "“What’s that silver-haired beauty? Is she a model?”",
        "“Wow… she’s really beautiful… But she looks like a foreigner, maybe she’s on vacation or something?”",
        "“O-oi, try to talk to her.”",
        "“No way, it’s impossible! They’ll never take you seriously!”",
        "―Charlotte-san, who was walking next to me, was attracting a lot of attention.",
        "Even though it was still early in the day and there were not many people on the street, many people stopped to take a look at her.",
        "But none of them paid any attention to me, who was walking next to her.",
        "Either they don’t think of me as a companion because of my disproportionate size, or they are so fascinated by Charlotte-san that they don’t even notice my presence.",
        "If I go out far enough, I’m unlikely to run into anyone I know, then there would be no problem?",
        "I wanted to complain furiously to myself for thinking that way.",
        "Because of my naive thinking, Charlotte-san, who was attracting a lot of attention, looked very uncomfortable.",
        "In fact, she seemed to be frightened by the attention.",
        "It was a natural reaction to attract so much attention.",
        "I wanted to somehow block her gaze, but it was impossible since she was being watched from all directions.",
        "I should have thought a little more about the station we were getting off at and the zoo we were going into.",
        "I could have at least found a less densely populated station or a zoo, but I was too lax in my thinking, and now, I was giving Charlotte-san a hard time.",
        "One lucky thing was that Emma-chan was asleep in my arms.",
        "She had eaten some chocolate and woke up early in the morning, but the pleasant shaking of the train had put her to sleep.",
        "Now she’s sleeping with her face pressed against my chest.",
        "If she was awake, her cuteness would attract attention, but I don’t have to worry about that since they can’t see her face.",
        "I’ve also hidden her silver hair under my arm to make it as inconspicuous as possible.",
        "This makes it a little difficult to hold her in my arms, but it’s better than giving her a hard time.",
        "If she had been awake, she would have been traumatized.",
        "So I was really glad that she was asleep.",
        "The problem is how to help Charlotte next to me― unfortunately, I don’t have a good idea to deal with her problem right away.",
        "It can’t be helped then…",
        "“Charlotte-san, let’s go home.”",
        "It was with great regret that I told Charlotte-san that we should turn back.",
        "It’s better to turn back than to give her any more pain.",
        "I’m sure Emma-chan will cry, but I’ll have to find some other way to put her in a good mood.",
        "“……….I don’t want to…”",
        "My proposal was surprisingly rejected by Charlotte-san.",
        "To be honest, I thought she wanted to go home more than I did…",
        "“I was really looking forward to today’s event… I’m not going to let something like this stop me…”",
        "“But―”",
        "“It’s okay. It’s no problem. Just― let me indulge you a little…”",
        "Charlotte-san interrupted my words and attached herself to my arm with a tight squeeze.",
        "Then, she buried her face in my arm to hide it.",
        "“””””―Whoa!?”””””",
        "Charlotte-san’s unexpected behavior took me and the bystanders around me by surprise.",
        "I was so nervous and upset that I could not speak and could only move my mouth.",
        "On the other hand, the people around me seemed to be in an uproar as if there was a fire or an accident.",
        "―I was happy to be hugged by Charlotte-san, but at the same time, I thought that we should have left after all because of the commotion that enveloped the station platform.",
        "◆",
        "A man and a woman are walking arm-in-arm― isn’t that situation a date, no matter how you look at it?",
        "At least, that’s what most of the people in this place seem to think.",
        "The gaze that had been directed at Charlotte-san just a moment ago was nowhere to be seen.",
        "Now that Charlotte-san has embraced me, all eyes are on me now.",
        "And the gazes were not the envious gazes that had been directed at Charlotte-san, but mostly jealous ones.",
        "The rest were more like curious glances from women.",
        "It’s very uncomfortable…",
        "―As we waited for the train to come, I feigned calmness and observed my surroundings.",
        "I need to be aware of my surroundings, otherwise I can’t stand this situation.",
        "That’s because the destructive power of Charlotte-san, who was hugging me, was so great.",
        "I felt like my head was about to boil from the sheer cuteness.",
        "Charlotte-san was not only burying her face in my arms, but she was also looking up at me every now and then to see how I looked.",
        "The expression on her face as she looked up at me was that she had red cheeks and her eyes had a hint of warmth in them.",
        "Who wouldn’t think it’s cute to be stared at with such an expression?",
        "“Ngh…”",
        "When I was writhing in my mind about Charlotte-san’s cuteness, Emma-chan, who was in my arms, opened her eyes lightly.",
        "She slowly opens and closes her eyes sleepily, staring at my face in a daze.",
        "“Are you awake?”",
        "I gently stroked Emma-chan’s head and called out to her.",
        "And then she pressed her face into my chest.",
        "“N-no…”",
        "“Ah, you still want to sleep some more.”",
        "“Mhm…”",
        "Emma-chan nodded her head and fell asleep again with a lovely sigh.",
        "It is natural to be sleepy when you wake up from sleep, so it can’t be helped.",
        "Let’s let her sleep like this.",
        "“Aoyagi-kun, you’re kind of like Emma’s father…”",
        "“I’d be very happy to have such a cute daughter, but at least let me be her brother instead.”",
        "I jokingly replied to Charlotte-san’s muttered words.",
        "“…That’s right, a big brother― I do think that’s a good thing. Yes, it would definitely be better for you to be a big brother.”",
        "What’s up with that?",
        "She’s really pushing the idea of an older brother.",
        "…Well, I guess she just doesn’t like the idea of her classmate being treated like a father.",
        "“Are you all good now? If you’re fine, I think it’s time to let go―”",
        "“Can’t I just stay like this for a little while longer…?”",
        "“…Okay.”",
        "I wanted her to let go of me because I was about to lose my sanity, but Charlotte-san’s clinging eyes made me nod.",
        "◆",
        "“Neko-chan, neko-chan♪!”",
        "When we arrived at the zoo, Emma-chan woke up and started to resume her cat-calling.",
        "It’s a good thing that she likes cats, but I’m in a lot of trouble because there are no cats at the zoo.",
        "Obviously, she’s going to sulk when she finds that out",
        "“Charlotte-san, can’t you do something about this…?”",
        "I ask Charlotte-san, who is walking next to me, for help in Japanese so that Emma-chan can’t understand me.",
        "By the way, Charlotte-san’s hug was still going on.",
        "It may be natural, since the people around me don’t loosen their gaze… but honestly, it’s hard for me to act calm.",
        "Let’s hope we don’t run into anyone we know, at least.",
        "It would be really bad if we were to run into someone we know here.",
        "“It’s funny… She didn’t used to be such a cat lover…”",
        "Yeah, I’m sorry.",
        "It’s probably my fault.",
        "Ever since I showed her a cute cat video when we first met, Emma-chan has been asking for cat videos whenever she has free time.",
        "She had always said she liked cats, but I guess showing her so many cute cat videos made her like cats even more.",
        "“Does she have any other animals she likes?”",
        "“Let’s see… I guess Koalas…”",
        "“That’s out of the question…”",
        "There are no koalas in this zoo.",
        "I mean, koalas don’t come around that often, do they?",
        "“Pandas…”",
        "“Still out…”",
        "There are even fewer pandas here.",
        "The closest zoo to us that has pandas is in Kobe Prefecture, right?",
        "These sisters are very demanding of their zoo…",
        "“The other one is―”",
        "“―Hee, I didn’t know you guys had that kind of relationship already.”",
        "“”―Wha!?””",
        "Suddenly, I heard a voice, and the blood drained from my body and I felt a sudden chill down into my spine.",
        "When I looked back fearfully, I saw Miyu-sensei standing there with a smirk on her face.",
        "And next to her, for some reason, was the lolicon teacher in charge of music.",
        "“Yoo-hoo, you three!”",
        "―As I listened to the cheerful voice of the lolicon teacher, I thought to myself, <<Why are these people in a zoo…?>>."
    ]
}