{
    "id": "chapter-91",
    "title": "The Past Revealed and Betrayal",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Charlotte’s POV**)",
        "“Aren’t you being a little hard on me as usual?”",
        "“You’ve always been kind of dangerous…”",
        "“Ehh, I’m shocked… What’s so dangerous about me?”",
        "“Hey, get your face away from me! That’s what I’m talking about!”",
        "“…………”",
        "What the hell is going on here?",
        "When I came back, I found that Akito-kun was being pursued by a person wearing a hat…",
        "Hearing their voice from a distance, it’s quite difficult to determine whether the person he’s talking to is a man or woman.",
        "The person has the same height as Akito-kun, but then again, is that person a man or a woman?",
        "It’s hard to see their face, so I’m not sure.",
        "If it’s a man, I guess it’s fine, but if it’s a woman, it’s a bit of a problem.",
        "Akito-kun is already my boyfriend, so I don’t want him to be pestered by other women.",
        "I decided to hide in the shadows and watch Akito-kun and the others for a little while.",
        "I can hear what they are saying, but I have no intention of eavesdropping.",
        "It’s just that my ears can pick up his voice as long as I can see him.",
        "This is something I can’t help with, okay?",
        "“Why do you hate me so much? We’re friends right, you and I?”",
        "“Don’t mislead me! What if she comes back at a time like this!”",
        "I’m sorry, Akito-kun.",
        "Actually, I’m already back in the vicinity, and I can hear the conversation perfectly.",
        "At any rate, if she is a woman, I would like to hear more about her later.",
        "“You’re always doing that, playing with my mind.”",
        "“I told you to stop. I’m telling you, you’re doing it on purpose!”",
        "“I’m serious, okay? You’re the best thing that’s ever happened to me.”",
        "“Why is this guy the treasure of Japan!?”",
        "The person with the hat pressed hard against Akito-kun, who backed away unhurriedly.",
        "The fact that they referred to themselves as “boku” suggests that he is a man, but sometimes, even women call themselves as “boku” so it’s not to be underestimated. [TLN: “Boku” is “I” in English, they are mainly used by males, while females use “Watashi”.]",
        "In addition, the content is also disturbing.",
        "It is obvious that he has a liking for Akito-kun, and I think I should stop him.",
        "I thought about that, but then I thought about what would happen if I assumed that the person was a man.",
        "Akito-kun is being chased by a man― Isn’t that a so-called BL development?",
        "[EDN: BL means Boys Love for those who don’t know it.]",
        "“…..I’m not sure what they’re talking about at this point, so I think it’s best to wait and see.”",
        "I pondered for a bit and decided to wait a little longer to understand the conversation they’re having.",
        "It’s not that I have any evil thoughts.",
        "I thought that if I interrupted him now, I would not be able to understand the relationship between them.",
        "And if the other party is a man, I don’t think he will steal my Akito-kun.",
        "…There’s no way, right?",
        "“I thought you’d become a little more sane, but it turns out you just stopped wearing cat ears so you’re still the same!”",
        "“What are you talking about, I’ve grown up too. Yes, I’ve learned to be patient.”",
        "“Then why don’t you just wait until I’m gone?”",
        "“I don’t think that’s possible.”",
        "“Why not!?”",
        "I’ve never seen Akito-kun shouting like that before.",
        "He looks like he’s having a lot of fun.",
        "“You know that, right?”",
        "“No, I don’t understand!”",
        "“Fufu, you’re still the same as ever.”",
        "“Hey, seriously, don’t come any closer to my face! Charlotte-san, please come back quickly…!”",
        "I’m sorry, Akito-kun.",
        "I’m a little more curious, so I’d like to observe.",
        "“Fuun~, that girl is called Charlotte-chan, huh? I didn’t know you were into girls like that.”",
        "“I-It doesn’t matter what kind of girl I like…! Anyway, don’t come any closer or I’ll punch you in the face…!”",
        "“I thought you were going to end up with that young lady with the long black hair, did you leave her?”",
        "“―!?”",
        "I gulped from what I heard.",
        "I knew it, Yamato Nadeshiko, who I met this morning, was Akito-kun’s girlfriend!?",
        "I can’t wait to hear the rest of the story…!",
        "“You know the relationship between me and her, right!? And you know that it has something to do with that thing!”",
        "That thing… what exactly is it they’re referring to?",
        "Did they have a big fight or an unwanted breakup…?",
        "At any rate, Akito-kun, I don’t mind, so please confess your relationship as soon as possible.",
        "“Ah, by the way, I wanted to talk to you about that thing, so I followed you.”",
        "“…………”",
        "Immediately after he said he wanted to talk about it, Akito-kun’s mood changed completely.",
        "Just a few minutes ago, he tsukkomi’d himself to the other party’s jokes, but suddenly he became serious.",
        "Rather, he seemed a little tense, and I felt a little scared.",
        "―And this was not the time to be thinking about such things.",
        "This is something that will definitely touch on Akito-kun’s past.",
        "In fact, I was very curious about it, and I wanted to ask him about it.",
        "But I knew that Akito-kun didn’t want me to know about his past.",
        "He must have been in a lot of pain today, but in front of me, he was smiling so that I wouldn’t feel it.",
        "I wanted to respect Akito-kun’s feelings.",
        "That’s why I didn’t go into the matter of him forcing himself to smile and mend his ways as long as he was deceiving me.",
        "I believe that if he feels the need to talk to me, he will do so, and if he doesn’t talk to me now, it’s probably because he doesn’t feel the need to.",
        "It is not good for me to ask him about his past, even though I am unwilling to do so.",
        "So I hurriedly tried to move on, but the words I heard suddenly made me stop unconsciously.",
        "“I’ll be honest, I know the reason why you betrayed us.”",
        "Eh, Akito-kun betrayed them…?",
        "I was curious about what he said, and I couldn’t help but look back at him.",
        "I looked at Akito-kun’s expression, but he was silent, staring at the face of the person with the hat.",
        "“Akira told me about the reason why you didn’t show up for our game in the first round of the All-Japan tournament, which was considered by soccer fans to be the de facto final.”",
        "“Oh, so you heard about that…”",
        "“Yeah, so all my teammates who were selected for the national team at that time know the truth. But― that’s why they haven’t forgiven you.”",
        "You didn’t show up for the first round?",
        "Representing your generation?",
        "And they haven’t forgiven you, Akito-kun?",
        "The new information made me even more confused and I couldn’t move from the spot.",
        "“Well, I guess so. Just like you said earlier, I betrayed you guys too.”",
        "Then, Akito easily admitted his betrayal.",
        "I can’t believe he betrayed anyone.",
        "I really wonder what happened to him…",
        "“That’s right. But the betrayal you think you’ve done is not the same as the betrayal we think we’ve done, is it?”",
        "“What do you mean?”",
        "“It’s true that you didn’t make it to the first round of the All-Japan tournament. But I heard that you were in a situation where you could have continued playing soccer if you wanted to. And yet, you quit playing soccer. That’s a betrayal to those of us who followed you. Isn’t that right, former captain of the national team, the genius game-maker?”",
        "As he said this, he took off the hat he was wearing.",
        "I recognized his face, and I gasped.",
        "The reason why I gasped was not because he had an amazingly beautiful face.",
        "It was because I could see a certain anger in his eyes.",
        "You can’t believe it’s the same person who was wooing Akito-kun just now."
    ]
}