{
    "id": "chapter-123",
    "title": "The Ordeal",
    "content": [
        "Translator: AJ1703",
        "(**Akihito’s POV**)",
        "―Kon, kon, kon.",
        "“May I come in?”",
        "While I was listening to Charlotte-san’s mother, there was a knock at the door.",
        "The clear voice I heard was the owner of this room.",
        "“Of course. Come in, Kanon-chan.”",
        "“Excuse me.”",
        "With her permission, the door slowly opens.",
        "Beyond it, Kanon-san and Arisa-san were bowing.",
        "“Where were we?”",
        "Kanon-san walks in with elegant steps and looks at Charlotte-san’s mother as she sits on the sofa.",
        "“I digressed a bit, but I think I got most of it out of the way. But I still haven’t told them about that thing.”",
        "“I see. Well then, let me explain it to them. That would be the right thing to do.”",
        "“Yes, thank you. Did everything go all right?”",
        "“Yes, everything went pretty much as planned. Thanks to Onee-sama.”",
        "“…………”",
        "Charlotte-san, I suppose, doesn’t like her mother being called “Onee-sama” by a girl not much older than her.",
        "She looked at them with a subtle expression on her face.",
        "If I had a mother, I would certainly be confused if another girl called her “Onee-sama.”",
        "“Akihito, Charlotte-san, first of all, let me say a few words of apology. We are sorry that we have pushed you around so selfishly.”",
        "Kanon-san turned to us and bowed deeply.",
        "“I-It’s fine, that’s just…! There’s no need to apologize…!”",
        "“Please raise your head, Kanon-san, because Charlotte-san and I both know what you’ve been doing for us.”",
        "“Thank you, you two.”",
        "Kanon-san gave a cute smile, which was a complete change from her previous smile.",
        "I could tell there was a hint of relief mixed in with that smile.",
        "She is a smart, well-educated, adult-like woman, but she is one year older than us.",
        "I guess she was anxious, but she was trying not to show it.",
        "“I don’t know where to begin, but since you’ve heard most of what I have to say, I’ll keep it short. It all started a few months ago when there was talk of a political marriage of Akihito. I thought it was not a good idea, so I asked Onee-sama for help.”",
        "A politcal marriage― that reminds me, what happened to that matter?",
        "President Himeragi’s retreat means that the matter is now null and void?",
        "“Why is this suddenly being discussed…?”",
        "“Does Charlotte-san know about the goals you were given?”",
        "“No, I couldn’t tell her…”",
        "I wasn’t in a position to talk about it― but, that’s just an excuse…",
        "“Well, then, that’s where we come in: Charlotte-san, Akihito has been given a goal, an ordeal, so to speak― in order to enter the Himeragi family.”"
    ]
}