{
    "id": "chapter-106",
    "title": "I-I'm Too Embarrassed to Say It...",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Akito’s POV**)",
        "“Well, I had a conversation with what looked like an Ojou-sama today in the hallway with a maid…”",
        "“How…?”",
        "“I just happened to pass her and she said hello.”",
        "I see… So that’s how it is.",
        "It’s true that the timing of Arisa-san’s arrival was a little while after Charlotte-san left.",
        "It’s not surprising that the two of them were talking during that time.",
        "…No, Arisa-san is not interested in anyone but Kanon-san in the first place, so it was Kanon-san who approached her.",
        "If they had seen Charlotte-san leaving my room, it wouldn’t be that surprising if they were interested.",
        "“Did she say anything strange to you?”",
        "“No, she was as elegant as if she were a Yamato Nadeshiko…”",
        "The moment Charlotte-san said that― I was convinced that the woman who was with Arisa-san was Kanon-san.",
        "I don’t know if the reason she didn’t show up at my room was because she didn’t want to see me, or because of the content of what Arisa-san was trying to get me to do.",
        "I don’t know, but one thing I do know is that Kanon-san is definitely the one who pushed Arisa-san.",
        "However, at the same time as I was wondering why she would do such a thing, I also had the contradiction that I couldn’t believe Kanon-san would let her play such a dirty role, no matter how much it was Arisa-san.",
        "Like really, what the heck is going on here…?",
        "“By the way, what did you talk about?”",
        "“Ah, erm, we talked about… how happy I looked and whether I’m interested in being a maid.”",
        "Yeah, how did that conversation come about?",
        "I can’t read the flow of the conversation at all…",
        "“Why did you have that conversation?”",
        "“That’s―oh…”",
        "I couldn’t read the flow of the conversation they had, so I asked how it came about, and Charlotte-san looked as if she’d realized something.",
        "Then, her face instantly turned red and she began to squirm in embarrassment.",
        "Eventually, Charlotte-san began to glance at me, and Akira, who had been silently watching our conversation, glared at me with a very argumentative look.",
        "No, look here man.",
        "I’m innocent here.",
        "“Charlotte-san, what on earth did you talk about with them…?”",
        "“I-I’m too embarrassed to say it…”",
        "“Okay, Akito, you’re going to have to come out with me.”",
        "As Charlotte-san covered her face with her hands in embarrassment, Akira grabbed me by the shoulders like a young man.",
        "It hurts like hell, but I don’t care how jealous he is.",
        "“I didn’t do anything to you. Besides, I’m already dating Charlotte-san and Akira has been supporting me. So it’s strange for you to be angry―”",
        "“That’s not what I’m talking about! Of course I’m jealous of you, you idiot!”",
        "“―!? M-My bad. Don’t you cry now, I feel sorry here, okay…?”",
        "The angry Akira suddenly began to cry out in frustration, and I tried to calm him down, pulling back a little.",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Afterword: Thanks for the 65$ donation to my Ko-Fi from last week! He didn’t specify which series so I’m planning to thank him from every series I’m working on.",
        "I’m grateful for the support, but please let’s help Matsu reach his goal first. I can go later than him. If ever you guys have any extra amount, please do consider supporting us if you enjoy our translations. Just click the button below to do so. Then again, thank you all!"
    ]
}