{
    "id": "chapter-124",
    "title": "The True Identity of The Fiancèe",
    "content": [
        "Translator: AJ1703",
        "Foreword:",
        "Earlier,",
        "Nekokuro’s first new yuri work has just been released…!",
        "It’s a fun story with lots of comedy,",
        "We hope you will enjoy it!",
        "The story is called “Till I Corrupt the Madonna of the School.”",
        "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~",
        "(**Akihito’s POV**)",
        "“That ordeal is…?”",
        "Charlotte-san asks Kanon-san as if looking into the situation.",
        "I guess it’s better if I explain it myself.",
        "“It’s about getting a special recommendation for a certain university. Only students with excellent grades in a particular high school can get that recommendation. So they said that if I was good enough to get it, I would be accepted as a member of the Himeragi Conglomerate.”",
        "That recommendation is so difficult to get that at our high school, only one student gets it every few years or so.",
        "That was the reason I was studying so hard.",
        "I had hurt and disappointed Kanon-san in middle school, and I wanted to make up for it by at least becoming a member of the Himeragi Conglomerate so I could be of service to her.",
        "“Perhaps, the reason Akihito-kun’s last name remained Aoyagi was because…”",
        "“I haven’t been accepted as a member of the Himeragi Conglomerate yet.”",
        "“…………”",
        "Charlotte-san casts her eyes down sadly.",
        "Maybe she feels sympathy for me.",
        "But this was something that had to be done.",
        "The president of the company would never take on an orphan so easily.",
        "“But Akihito’s grades by the summer vacation had proven that he was competent. He was in the single digits on the national standardized test and was highly rated by the teachers. Originally, we also heard about his performance in middle school, and there was a high possibility that Akihito would get a recommendation. That is why we began preparing for the time we will welcome Akihito into our house.”",
        "“Does that mean I’ll be a part of a political marriage?”",
        "“Yes. Political marriages are an effective way to expand the size of a family. Since there were only girls in our family to begin with, they thought they had no choice but to take advantage of Akihito, who was a boy.”",
        "That’s a bit of a tricky way of putting it.",
        "As far as I know, Kanon-san is an only child.",
        "I was a little bothered by the fact that she used the word “girls,” but I guess she just referred to herself in terms of gender.",
        "“What happened after that…? It seems to me that he already got himself a fiancée…” “Let’s start with the conclusion first. The fiancée is Charlotte-san.”",
        "“”Eh…?””",
        "I was not expecting that.",
        "Charlotte-san and I looked at each other unintentionally."
    ]
}