{
    "id": "chapter-65",
    "title": "A Good Man Who Drips Sweat?",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Charlotte’s POV**)",
        "―Finally, the day has come.",
        "Today is a Saturday off from school― yes, it’s the day I’ve been waiting for, the day I can have a date with Aoyagi-kun alone.",
        "For the past few days, I’ve been bothered by Aoyagi-kun’s popularity with other girls, but that will end today.",
        "After all― I’m sure that Aoyagi-kun will confess his feelings to me.",
        "I can’t think of any other reason why he would go to the trouble of proving that he is not a lolicon on our date.",
        "It may be that I’m just interpreting things in a convenient way, but if he wasn’t, he would have done it right there and then without bothering to specify the date.",
        "Because I’m sure he would want to get rid of the lolicon suspicion right now.",
        "The fact that he took the trouble to move the date to Saturday means that it has to be on Saturday, or that Saturday is more convenient for him.",
        "And the only event on Saturday is this date.",
        "If we can go out today, we will be able to be together all the time at school from now on.",
        "School life together with Aoyagi-kun― Just thinking about it makes me happy…",
        "As I put my hands on my cheeks, I couldn’t stop my cheeks from relaxing as I thought about Aoyagi-kun confessing his love to me and what the future holds for us.",
        "―But he’s that Aoyagi-kun, isn’t he?",
        "There is a possibility that he will betray my expectations and try to solve the suspicion of lolicon in an unexpected way.",
        "So I can’t be too careful, but if it happens― I will tell him my feelings.",
        "In Japan, it seems to be common for men to confess their feelings, but there should be no rule against women doing so.",
        "In fact, in many manga, it is often the woman who confesses.",
        "…What if, he turns me down…?",
        "Will I be able to still like him…?",
        "I probably won’t be able to forget this feeling easily even if he rejects me.",
        "But I don’t want to follow him around and most of all I don’t want to cause him any trouble.",
        "I just want to look at him from a distance and continue to hold on to this feeling― that sounds very painful…",
        "If I continue to do that, I’m sure Aoyagi-kun will go out with other girls and live happily ever after.",
        "I want the person I love to be happy, but I don’t think I can do it like the characters in the manga where they go “I wish him happiness and step aside.”",
        "After all, for the past few days, I’ve been extremely jealous of him just because he’s been courting other girls, even though he’s been very sweet to me…",
        "I didn’t know that I was such a jealous girl.",
        "I want to make him happy because I’m sure that I would be jealous if he was flirting with other girls.",
        "And also― I want to flirt with him a lot…",
        "“What are you doing here all by yourself? It’s only 5:30 in the morning…”",
        "As I was thinking about Aoyagi-kun, a sleepy voice spoke to me.",
        "This voice is not Emma’s.",
        "And Emma doesn’t talk like this.",
        "So the voice was coming from Emma’s mother―Our mother.",
        "“Oh, erm, good morning, Mom. It’s nothing. And I woke up at this time because I had a little appointment…”",
        "“This early in the morning?”",
        "“Well, I have to get ready and I can’t take Emma with me today…”",
        "I’m sure that when Emma finds out that I’m going to play with Aoyagi-kun, she will want to follow me.",
        "As much as I would like to take her with me… Today, I want to have a date, just the two of us.",
        "And if Emma is there, Aoyagi-kun will only have fun with Emma, not me…",
        "“Ahh, you’re going on a date with Aoyagi-kun, huh?”",
        "“―Ha!? H-how did you know that…? No, rather than that, how did you know about Aoyagi-kun…?”",
        "“The date was just a hunch based on Lottie’s behavior. As for Aoyagi-kun, he’s a neighbor, so of course I know his name.”",
        "I-I’ve been found out…",
        "“I-it’s not a date…! Moreover, why does that alone bring up Aoyagi-kun’s name?”",
        "I was embarrassed to let my mother know that we were on a date, so I quickly covered it up.",
        "It seems futile, though, as I see the smirk on my mom’s face…",
        "The only thing that doesn’t make sense to me is about Aoyagi-kun.",
        "How come she assumed that my date would be with Aoyagi-kun…?",
        "“The other day, you took Emma into Aoyagi-kun’s house even though it was late at night. Moreover, you were hugging his arm. That’s why I thought you two were dating.”",
        "“Y-You saw us…?”",
        "“Yes, I had to go home that day because I needed something. I don’t want to interfere in my daughter’s love life, but I do have some reservations about her going to her partner’s house in the middle of the night just because her parents aren’t there.”",
        "What a surprise.",
        "I was completely exposed to my mother.",
        "My mom doesn’t nag me, so she doesn’t tell me to stop, but she does seem to be bothered by the fact that I go to the boy’s house at night.",
        "Ugh…I don’t want her to tell me that I can’t go out with him in the future…",
        "“No, we’re just having a normal conversation…”",
        "“Don’t be so frightened, I’m not going to tell you that you can’t visit his house. It’s unusual for you to be close to a boy………. But, the other party is that Aoyagi-kun.”",
        "The mother, who understood from my appearance that I was afraid of being forbidden to go to Aoyagi-kun’s house, acknowledged me with a smile.",
        "However, one word that she muttered caught my attention.",
        "The words “that Aoyagi-kun”, which were muttered in a small voice, sounded as if she knew him.",
        "“So you do know Aoyagi-kun after all?”",
        "“More importantly, look. If you don’t get ready soon, Emma will wake up.”",
        "My mother then told me to go quickly.",
        "I feel like I’ve been misled…",
        "But today I have to dress up well so that Aoyagi-kun will think I’m cute, and if I take too long here, Emma will really wake up.",
        "So I decided not to ask any more questions and get ready myself.",
        "◆",
        "“I-It’s so cold…”",
        "After getting ready, I was outside early in the morning.",
        "The meeting time with Aoyagi-kun was at nine o’clock, but it was still around seven o’clock.",
        "If I stay at home until the meeting time, Emma will wake up, so I decided to leave the house at this hour… Still though, it’s so cold outside…",
        "The reason for this was that I was wearing light clothing today.",
        "All of this is to make Aoyagi-kun think that I’m cute, so I thought it would be okay to wear this kind of an outfit because it’s autumn, but I didn’t expect it to be so cold…",
        "When I was in England, I wore many different kinds of clothes because the temperature varied from day to day, even though the seasons changed, I didn’t really care about what people thought of me when I dressed up.",
        "I was more of a practical person.",
        "However, the reason why I started to dress cute was because I started to hang out with a boy I was interested in.",
        "It really seems that when people change, they change. [TLN: People die if they are killed… lmfao]",
        "Aoyagi-kun, I hope you will be pleased…",
        "“―Haa….Haa…One more time…!”",
        "“Eh…?”",
        "As I was taking a walk to kill time, I heard Aoyagi-kun’s voice from a distance.",
        "I wondered what he was doing out so early in the morning.",
        "Also, he’s sounding like he’s breathing very hard.",
        "I quietly peeked around the corner so that Aoyagi-kun couldn’t see me, and saw him running in the park, wearing what looked like soccer clothes.",
        "He wasn’t jogging or running, but he was making a serious dash.",
        "And once he finished running, he immediately started running again.",
        "It’s not… for your health, is it?",
        "If so, jogging is enough.",
        "Maybe it’s because he was chosen as a member of the relay team?",
        "He’s a serious guy, and he’s training alone so that he doesn’t drag down everyone else― which doesn’t sound like a bad idea, but it doesn’t feel right…",
        "But… that’s not the point here, Aoyagi-kun running hard looks really cool…",
        "There’s a saying that a man is a good man who drips water, but in Aoyagi’s case, he seems to be a good man who drips sweat.",
        "The way he wipes the sweat from his forehead with his right hand is very cool.",
        "I forgot to call out to him and secretly watched him run.",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Comments: Oh, so the gaze from the last chapter was from her mother. Good thing it wasn’t Shinonome-san cuz she would’ve gone down the Yandere path lol."
    ]
}