{
    "id": "chapter-50",
    "title": "The Irresistible Look",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "“This is Emma’s…!”",
        "After I put the cat down, I took Emma-chan in my arms to replace her, and she protested, her cheeks puffed out.",
        "It seems that she is angry with me for carrying the cat― or rather, she’s sulking.",
        "What a cute little girl.",
        "Emma-chan was so cute that I almost felt my cheeks loosen up.",
        "“…..Isn’t it nice to get a hug instead of just a cuddle…..?”",
        "“Hmm? Did you say something, Charlotte-san?”",
        "As I was stroking Emma-chan’s head and pampering her, Charlotte-san was muttering something with a difficult expression on her face.",
        "I’m sure it’s just the usual talking to herself again, but I thought I’d ask her.",
        "“No, it’s nothing, nothing at all. But why don’t we go to the other animals soon? Emma seems to have had enough of cats now.”",
        "Charlotte-san smiled in response to my question, and then looked at Emma-chan in my arms.",
        "Speaking of Emma-chan, she was pressing her face against my chest.",
        "As Charlotte-san said, she must have gotten tired of cats.",
        "If that’s the case, we’d better get out of here.",
        "We’re about to leave the cat rubbing against my leg which is quite regrettable but it’s getting too crowded here.",
        "…Well, it’s not the cats that are attracting the crowds, but Charlotte-san and Emma-chan.",
        "I don’t know where the rumors are coming from, but the customers who come here say, “Oh, that’s her, that’s her. Wow, she’s really cute,” or “Wow, she’s a cute little girl.”",
        "And their eyes were clearly on Charlotte-san and Emma-chan.",
        "Basically, the male customers were looking for Charlotte-san, and the female customers were looking for Emma-chan.",
        "But of course, there were some male visitors who came to see Emma-chan, and some female visitors who came to see Charlotte-san.",
        "But― hey, this is a zoo, right?",
        "I don’t know about the female visitors, but do you think male visitors usually come to the zoo alone or with people of the same gender?",
        "I guess not, but the odds are pretty low.",
        "Who do you think they come with― their girlfriends, their wives, or their children, of course.",
        "But what happens when they are attracted to Charlotte-san―?",
        "“―Mou! I can’t believe you’re looking at another girl!”",
        "This is the kind of thing that would make their partner angry.",
        "No matter how cute Charlotte-san was, even I, who had never been in a relationship with the opposite gender, knew that if I was here with her, I shouldn’t have my eyes on another girl.",
        "It was only natural that she would be upset if they made such a mistake.",
        "Well, it was none of my business, so I wasn’t going to interfere.",
        "I looked sideways at the man who was hurriedly chasing her, and went on to see the next animal as if nothing had happened.",
        "After leaving the cat area, we went on to see some unusual animals that we would never normally see, such as Shetland ponies and other horse-related animals, and birds such as the Formosan parrot.",
        "Among them, Emma-chan especially liked the common marmoset, a small monkey about the size of the palm of your hand.",
        "We didn’t get to touch it, but Emma-chan liked it because it was small and cute.",
        "It’s just― “Emma wants to touch them…!” I was troubled when she began to complain about it, but…",
        "It’s a zoo rule, and there’s nothing we could do about it, so we tried to coax her into putting up with it, but she sulked for a while.",
        "She was in a good mood when she was allowed to hold a guinea pig, a kind of rat, which we found next.",
        "A guinea pig is a type of rat that many people might think of as a negative image, but it was a cute animal that looked like a hamster.",
        "I was never much interested in zoos, but it was interesting to see unusual animals like this.",
        "Aki often wants to go to the zoo, and I think she’ll be happy if I bring her to this zoo next time.",
        "“Charlotte-san, are you having fun?”",
        "I call out to the beautiful silver-haired girl walking next to me.",
        "I’m not going to mention the fact that she’s still hugging me.",
        "If she doesn’t have to worry about people looking at her because of it, then it’s fine.",
        "I don’t care how many jealous glances the guys around us give me, they’re not going to do any real harm.",
        "“Yes, it’s so much fun… It’s like a dream…”",
        "“Haha, you’re exaggerating.”",
        "“…..You probably misunderstood…”",
        "When I tsukkomi’d myself to Charlotte-san for exaggerating that just coming to the zoo was like a dream, she somehow turned her face away from me. [TLN: “tsukkomi” is acting like a straight man in a manzai aka comedy act between two people. Read more here.]",
        "I don’t think she’s in a bad mood― but what the heck happened to her?",
        "She seemed to be sulking.",
        "Charlotte-san’s cheeks seemed to puff out a little, and I reminded myself that she had been sulking.",
        "The Bennett sisters puff up their cheeks when they sulk, so it’s easy to tell.",
        "However, the fact that they show me their various expressions makes me happy because it means that they are opening up to me.",
        "However, I would rather see a smile than a sulking expression.",
        "“Erm, do you want some chocolate?”",
        "I took out the white chocolate that I had prepared for Emma-chan from my shoulder bag and presented it in front of Charlotte-san, who was turning her face away.",
        "Then she giggled and looked up at me.",
        "“Aoyagi-kun, I’m not Emma, so I’m not going to be caught with sweets, okay? …Well, I’ll still take it though.”",
        "Although she said something like she didn’t want to be treated like a child, Charlotte-san still accepted the white chocolate happily.",
        "Even if she’s usually modest, she’s still a girl and probably likes sweets.",
        "The way she put the chocolate in her mouth with a smiling face was very cute.",
        "―*Pull pull.",
        "As I was staring at Charlotte-san’s profile, Emma-chan tugged lightly on my chest.",
        "When I looked at her, she was staring at my face.",
        "It was as if she was saying, “Why aren’t you giving Emma any?”",
        "“Do you want one too, Emma-chan?”",
        "“Yeah…!",
        "When I held up the white chocolate in front of her, she nodded with shining eyes.",
        "But when I tried to give her the chocolate, she didn’t take it and opened her small mouth wide.",
        "It seemed that she wanted me to feed her.",
        "“Here you go, ahh~”",
        "“Ahh~n… nom!”",
        "I put a piece of white chocolate into her mouth, and she started to eat it with her cheeks relaxed.",
        "When she finished, she opened her mouth wide again in the same way.",
        "I guess she still wants more chocolate.",
        "But since she had already eaten a lot of chocolate today, it was not a good idea to give her too much.",
        "So I tried to put it away, but then Emma-chan started to make a silent appeal with her eyes glazed over.",
        "I can’t ignore her when she looks at me like this.",
        "And since I’m carrying her in my arms, I’m in close proximity to her face, so there’s no way I can resist this expression.",
        "“……Here you go, ahh~.”",
        "“Ahh~n.”",
        "In the end, I broke down and let Emma-chan eat the chocolate afterwards.",
        "“…..How nice…”",
        "―Charlotte-san muttered something next to me, not even noticing her condition."
    ]
}