{
    "id": "chapter-83",
    "title": "The Yamato Nadeshiko and The Mother Who's Scarier Than a Horned Demoness",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Charlotte’s POV**)",
        "The story goes back to the time when I left Akito-kun’s room―",
        "―I said it, I said it!",
        "I said it, I said it, I finally said it!",
        "I said that I love him…!",
        "And I called him Akito-kun…!",
        "When I left Akito-kun’s room, I was so embarrassed by my actions that I couldn’t  even move my body.",
        "My face was so hot that it probably would have turned red in the mirror.",
        "I boldly told him how I felt, but I was still very embarrassed.",
        "If there was a hole, I would go in it right now.",
        "But more than that, I felt very happy.",
        "“…Akito-kun. Akito-kun, Akito-kun. Ehehe~…”",
        "I couldn’t take it anymore, so I called out his name again.",
        "That alone made me feel so happy that I couldn’t help but feel my cheeks relax.",
        "I can’t let Akito-kun see this sloppy expression on my face.",
        "But when I imagined being with him, I couldn’t help but feel like I couldn’t resist.",
        "Because I’m really too happy and my heart is full.",
        "And to be honest, I’m very tempted to be pampered by him.",
        "I’m trying my best to hold back from being pampered by him, but I don’t know if I can hold back any longer.",
        "…I’d like to talk to you again soon, Akito-kun.",
        "“―You look so happy.”",
        "“Eh…?”",
        "As I was thinking about Akito-kun, I heard a clear and very elegant voice.",
        "I reflexively looked over and saw a woman about my age staring at me with her hands holding her long, beautiful black hair, which was blowing in the wind that had just started to blow.",
        "She reminded me of a Japanese woman in a manga.",
        "To put it simply, she is very cute and beautiful.",
        "However, she has a somewhat lonely smile on her face.",
        "Next to her, there is a tall and beautiful maid― wait, a maid!?",
        "I couldn’t help but do a double-take.",
        "I was very excited to see a maid who is said to serve a high class family.",
        "This is because maids are very wonderful beings that exist in many manga and anime.",
        "Could you please take a picture with me…?",
        "“She seems to be more interested in you than in me, huh.”",
        "“The maid outfit is unusual for her. And she seems to be quite interested in otaku― or rather, Japanese culture. So please don’t be upset, Ojou-sama.”",
        "“No one is sulking. Well, I’m not thinking of leaving my sister out of this.”",
        "“You’re thinking out loud, aren’t you…?”",
        "When I was surprised by the maid, Yamato Nadeshiko-san smiled, and the maid standing next to her had a troubled expression on her face. [TLN: “Yamato Nadeshiko” is a Japanese term for the “personification of an idealized Japanese woman”.]",
        "I wonder, how do they know about me?",
        "And is Yamato Nadeshiko-san the older sister, even though the maid looks older than her?",
        "But having your sister as a maid?",
        "They surely made me curious about a lot of things.",
        "“How do you do?”",
        "As I was staring at the two of them, Yamato Nadeshiko-san walked up to me and greeted me.",
        "The way she gestures, the way she speaks, and the elegant atmosphere makes her look like an Ojou-sama.",
        "“How do you do?”",
        "As she greeted me, I returned the same greeting.",
        "Then, Yamato Nadeshiko-san gave me a gentle smile.",
        "“Do you like maids?”",
        "“Yes, I like them very much.”",
        "“How about we take a picture together then?”",
        "“A-Are you sure!?”",
        "I couldn’t resist the unexpected suggestion.",
        "It was as if she had read what I had in mind, but I was very happy to have my picture taken with a real maid.",
        "However―",
        "“Ojou-sama, what are you thinking…?”",
        "The maid in the background doesn’t seem to be too keen on the idea.",
        "In fact, she seems to not like it.",
        "“It’s not going to reduce our reputation, so why not?”",
        "“But what if―”",
        "“That’s all right.”",
        "“…Understood.”",
        "The maid tried to suggest something, but as soon as Yamato Nadeshiko-san smiled at her, the maid changed her attitude.",
        "They were exchanging some curious words, but it seemed that we were going to have our picture taken together.",
        "“Oh, my phone―”",
        "“No, let’s use mine for now.”",
        "When I tried to take out my phone, being careful not to drop Emma, Yamato Nadeshiko-san took the phone from the maid and held it up.",
        "It seems to be Yamato Nadeshiko-san’s phone since she said it was hers, but the maid is in charge of it, isn’t she?",
        "“Oh, I was wondering if I could take a picture with Yamato Nadeshiko-san anyway…”",
        "“Yamato Nadeshiko? Are you talking about me, by any chance?”",
        "“Oh, umm… I’m sorry, I don’t know your name, so I took the liberty of…”",
        "“No, no, it’s an honor. And it’s my fault for not telling you my name first.”",
        "Yamato Nadeshiko-san said this, but she did not want to give her name.",
        "She was smiling the whole time, but the look she just gave me made me feel as if she was telling me not to question her.",
        "“Then, I will take your word for it. Arisa, please get ready.”",
        "“Very well.”",
        "Yamato Nadeshiko-san handed the phone back to the maid again.",
        "Then, the maid took out a selfie stick from nowhere.",
        "…Eh? No, really, where was it taken from just now?",
        "“Is there something wrong?”",
        "“Ah, umm… No, it’s nothing.”",
        "When Yamato Nadeshiko-san called out to me with a smile, I decided that I shouldn’t give her a hard time about her maid, so I quickly smiled and covered it up.",
        "I’m sure she’s of the same race as Hanazawa-sensei.",
        "“I’ll take your picture then.”",
        "At the maid’s signal, Yamato Nadeshiko-san, myself, and the maid took our positions so that the three of us could be on the screen.",
        "We thought about what to do with Emma, but decided against it because she might get angry if we captured her sleeping face.",
        "So, it will be just the three of us on screen.",
        "“―Then, could you please give me your contact information?”",
        "When we finished taking the photos, Yamato Nadeshiko smiled at us as she received the phone.",
        "It’s true that the only way to receive the photos is to exchange contact information― but is it okay to do so with someone I’ve never met before?",
        "“Fufu, no need to be so alarmed. After all―”",
        "As she said this, Yamato Nadeshiko-san turned her gaze to the maid.",
        "The maid then somehow unlocked the door to Akito-kun’s neighbor’s room, which was on the opposite side of the building from mine.",
        "“I’m just trying to make friends with you since we live on the same floor.”",
        "“Oh…”",
        "I couldn’t help but look at Yamato Nadeshiko-san and the maid in turn.",
        "It’s true that she has a key, which means she is probably Akito-kun’s neighbor.",
        "However, who would live in this apartment if she had hired a maid?",
        "What’s more, Akito-kun said this about his neighbor before.",
        "<<There’s no sign of anyone else living here, but this room has been rented ever since I started living here.>>",
        "In other words, I think these people have been renting the room for a long time, but why are they renting the room when they hardly live in it?",
        "I’m sorry to say that my suspicions grew a little stronger.",
        "“I see, you’re being even more cautious.”",
        "“Ah, no…”",
        "“Fufu, no need to be deceptive. I’m not angry. This room is actually one of my vacation homes.”",
        "“A vacation home, you say…?”",
        "“Yes. Isn’t Okayama a very nice place, not too rural and not too urban?　I rent it out so that I can come and visit on my days off, although it’s very occasional.”",
        "I see, it’s a rich person’s way of doing things― Well, why not just use a hotel then?",
        "Even if they rented a high class hotel, it would be much cheaper, wouldn’t it?",
        "“―I’m sorry, but I’m really busy, and I’m a little pressed for time. Can we exchange contact information…?”",
        "“Ah, I-I’m so sorry! I understand― Oh…”",
        "I was in the middle of thinking when I was suddenly rushed, so I quickly agreed.",
        "She smiled at me and showed me her account information on the chat application.",
        "She had a very nice smile, and I felt guilty if I refused her now.",
        "“Umm, I’ve sent it to you…”",
        "“Thank you very much.”",
        "In the end, I couldn’t say no, so I exchanged my contact information.",
        "Well, I think it’s safe to say that she seems to be a very kind and nice person, so I think it’s fine.",
        "…Yes, I can only think of it that way for now.",
        "“Still though―you, too, would look great with cat ears.”",
        "“Eh…?”",
        "“No, no, it’s nothing. It’s just that I think you have very nice silver hair.”",
        "“Oh, thank you very much.”",
        "It’s great that she complimented me on my silver hair, but what does she mean by me too?",
        "She sounds as if she knows the precedent…",
        "“Ojou-sama, it’s about time…”",
        "“Yes, I understand. Then we’ll leave you to it.”",
        "The maid whispered to her, and Yamato Nadeshiko-san turned on her heel.",
        "From the whispered words, it seems that time is really running out.",
        "But―",
        "“Oh, and one more thing.”",
        "Yamato Nadeshiko-san stopped, as if there was still something to be done, and looked back at me with a wonderful smile.",
        "“As a thank you for exchanging your contact information, I would like to give you some advice.”",
        "“Advice?”",
        "“Yes. People are not always what they seem to be, so please be careful.”",
        "When she said “advice,” I wondered what it was, but it was a little unexpected.",
        "Does it mean that I should be careful of evil people posing as good people?",
        "“Um, why are you saying that…?”",
        "“I’m sorry to be the one to tell you this, but I wanted to advise you not to look at your partner through colored glasses. Assumptions blind the eyes, and the more obvious they are, the more likely it is that you will notice them when it is too late.”",
        "Yamato Nadeko-san said in a very gentle voice, as if she was talking to a child.",
        "“Umm, thank you for your advice.”",
        "I was a little puzzled by her sudden advice, but I thanked her for her kind words.",
        "Then she smiled again― a nice smile, but pulled it back for a moment.",
        "“No, no………. Believe in him actually.”",
        "“Eh…?”",
        "Did you just say that you believe in him?",
        "Why would you say that…?",
        "“Ojou-sama…?”",
        "“I know, I won’t say any more. So, young lady, we will leave you now. We’ll talk again sometime.”",
        "When the maid called out to her as if to admonish her, Yamato Nadeshiko-san gave a gentle smile and shrugged her shoulders.",
        "The maid gave me a small wave with an elegant gesture, and then walked straight into the room.",
        "“W-What was that about…?”",
        "The morning was full of surprises and I couldn’t hide my confusion.",
        "They were really strange people.",
        "They said it was a vacation home… but no matter how you look at it, it’s strange that they are renting this apartment, isn’t it?",
        "I can’t help but think that there is another purpose for this― Ah…!",
        "I-isn’t this a flag…!?",
        "As I was thinking about it, I noticed a shocking fact.",
        "Normally, it’s impossible for an Ojou-sama to live next door to you!",
        "Yamato Nadeshiko-san is actually a childhood friend of Akito-kun’s. Something went wrong and they fell out, but I think they are looking for an opportunity to make up for it somehow….!? [TLN: How the hell did she easily conclude this!?!?!]",
        "T-That’s no good!",
        "Akito-kun is already my boyfriend…!",
        "There will be no more girls in this story!",
        "This is not the world of manga or anime, it’s the real world…!",
        "“―What’s with all the puffed up cheeks and anger, Charlotte?”",
        "“Oh, Mom! Because―eh? Did you just call me Charlotte…?”",
        "The door to my room opened and my mother approached me, but I froze when I realized something.",
        "“Yeah, what is it? I’m going to listen to your story, so come on inside the house.”",
        "“Eh, umm, no! I’m good! I forgot something at Akito-kun’s place, so―”",
        "“Yes, so you call him Akito-kun now huh. I’ll ask you about that in detail. ―Yeah, I’ll ask you what you were doing before you left in the morning, okay?”",
        "“No, I don’t want to! Akito-kun, help me~!”",
        "I tried to run away, but my mother grabbed me by the arm and dragged me into the house.",
        "―When my mother calls me “Charlotte,” it’s when she’s very angry.",
        "She is usually gentle and kind, but when she gets angry, she becomes much scarier than a Horned Demoness…",
        "Akito-kun, please help me…",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Comments: Oh boi, things are taking it up a notch. Charlotte went big brain in this chapter and somehow broke the 4th wall kek.",
        "Anyways, my brain got fried translating these 3 chapters since the new information has to be consistent. I literally went back to alternating the 3 chapters for any misconception I had which was quite hectic. That’s why I only ended up with 3 chapters released for today. Moreover, I woke up late today and started 4 hours later than usual when translating. I’m not sure whether I’d be able to translate much again tomorrow since my mother is basically forcing me to find a college right now that caters Computer Engineering. Classes are approaching soon in the Philippines and I still haven’t been admitted to any school, sad to say.",
        "Lastly, help Matsu (my Editor) with some funds to buy his new phone. Sometimes when he edits, it gets trippy and it reflects on the edit themselves from time to time. Click the button if you ever want to help him!"
    ]
}