{
    "id": "chapter-68",
    "title": "Riajuus Should Just Explode!",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "―Everyone learns once they have experienced it.",
        "And if you have a successful example, it’s easier to cling to it.",
        "…Yes, I understand this in my head.",
        "I understand― but, what about this…?",
        "I looked down to my right hand side, feeling my heart beating faster every second that has passed.",
        "Then there was Charlotte-san, hugging my right hand and burying her face in it.",
        "She hugged me as soon as I left the room.",
        "I know why she hugged me.",
        "She’s scared of attention because of the experience she got once when she went out with me.",
        "If she was a normal girl, she wouldn’t be getting that kind of attention.",
        "However, when she goes out to hang out, she’s more fashionable than usual, and she’s even cuter than usual.",
        "Even today, she was so cute that I couldn’t take my eyes off her.",
        "So I can understand why people around her are paying attention to her, and I probably would have done the same thing if I were an outsider.",
        "And of course, Charlotte-san would be the center of attention again today.",
        "She’s afraid of that, that’s why she’s trying to hide her face by pressing it against my arm.",
        "I guess she took the same approach because it worked in the past without incident.",
        "Well, I tried to confirm with her why she was hugging me.",
        "At that time, she said―",
        "“Is it, no good…?”",
        "―She looked up at me and asked me back, but I’m pretty sure she was right.",
        "I was thrilled to be with her and to see how cute she was, but I also wanted to do something about it if she couldn’t enjoy herself without taking measures to protect herself like this.",
        "“―So, where are we going today, Aoyagi-kun?”",
        "As we walked to the front of the station, Charlotte-san, looking up at me in front of the ticket machine, asked me where we were headed.",
        "Her cheeks were red, maybe she was embarrassed about the hug.",
        "“I think we’ll go to Kurashiki today. It’s going to be a long trip again, but I thought we could do some shopping there.”",
        "There is a large shopping mall near Okayama Station that is famous all over Japan, but I would rather not go there.",
        "It is, after all, the largest shopping mall in West Japan.",
        "Because of this, it is a place where many students gather even after school on weekdays, so it would be obvious what would happen if I went there with Charlotte-san on a holiday.",
        "If we went there, we were bound to run into someone we knew.",
        "Normally, there’s no such thing as a sure thing, but when I’m with Charlotte-san, I’m so full of happiness that misery hits me as if it were evenly distributed.",
        "“We’re going shopping…?”",
        "I thought she would be happy about it because girls love shopping, but for some reason Charlotte-san looked puzzled.",
        "I wonder if girls enjoyed shopping with their family or female friends, but not with their male friends?",
        "“Erm, would you rather go somewhere else?”",
        "“Ah, no… I like shopping too but, is that okay with you, Aoyagi-kun? I thought boys were not interested in shopping…”",
        "Ah, I see.",
        "She’s worried about me.",
        "It’s true that I rarely spend a lot of time shopping.",
        "I try to pick up what I need in advance and try not to waste money.",
        "However, it’s always fun to go anywhere with Charlotte-san.",
        "I don’t care where we go as long as I can see her smiling face as she enjoys it.",
        "“Yes, I’m fine.”",
        "“Is that so…? Maybe it was because I came in such light clothing that you decided to move me into a warmer room…?”",
        "She’s as perceptive as ever.",
        "It’s true that I switched my plan indoors when I saw what she was wearing.",
        "But of course there are many places where you can have fun indoors.",
        "I chose a shopping date from among the game centers, bowling alleys and other places where we could have fun.",
        "There was nothing for her to worry about since I had decided to go shopping on my own.",
        "But Charlotte-san was too kind to worry about me, wasn’t she?",
        "“Don’t worry about it, I chose to go shopping with Charlotte-san because I wanted to. More importantly, are you sure you’re okay, Charlotte-san? If you want to go somewhere else, don’t hesitate to tell me.”",
        "“No, I’m happy to go anywhere with you, Aoyagi-kun. That’s why I left it to Aoyagi-kun to decide where to go for fun……….. This could be a chance to find out what clothes Aoyagi-kun prefers…”",
        "What should I do? She said something that made me very happy.",
        "The last part was a little too quiet for me to hear, but I was too happy that she was willing to go anywhere with me.",
        "It’s the kind of thing a girl would use to try to impress a guy, but Charlotte-san is not the kind of girl who would do that.",
        "So, it’s safe to assume that she meant it.",
        "In fact― I think it’s a sign that she really likes me, isn’t it?",
        "If I’m wrong about this, I’m going to lose faith in people in the future.",
        "“Let’s go then.”",
        "“Yes…!”",
        "After I charged the money on my electronic card, I called out to Charlotte-san, who happily bought a ticket and nodded with a nice smile on her face.",
        "I wish she would have used an electronic card, but I guess buying a ticket in Japan is fun.",
        "It’s better not to say anything tactless.",
        "With a happy smile on Charlotte-san’s face, we walked through the ticket gate.",
        "“””””Riajuus should just explode…!!!!!”””””",
        "―While being bombarded with such words from those around us…",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Comments: Yeah, PLEASE EXPLODE KEK"
    ]
}