{
    "id": "chapter-109",
    "title": "What Does She Mean By Fiancée?",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Akito’s POV**)",
        "“Umm, I’m sorry about two years ago. I took it out on you and hurt you.”",
        "Even though I had my doubts back then, I told her the words I hadn’t been able to say before.",
        "I hadn’t been able to say it for a long time, but the fact that I could say it so easily now might mean that something inside me had changed.",
        "As I was thinking this, I heard a gentle laugh from over the phone.",
        "《Fufu… so you were still concerned about it huh. Don’t worry, I don’t care about it anymore.》",
        "She didn’t care.",
        "I’m a little relieved to hear that.",
        "―But I still remember the expression on her face right after I took it out on her.",
        "The person who usually never stopped smiling turned pale and broke down in tears as if her blood had been drained, so even an idiot can understand how much I hurt her.",
        "To say that she didn’t care about it was just a plain lie to keep me from caring.",
        "“I’d appreciate it if you told me the truth, instead of deceiving me. I’d like to start all over again with you.”",
        "When I said this, Charlotte-san’s expression, who had been staring at me, tightened.",
        "So I hurriedly shook my head from side to side and patted Charlotte-san on the head while I waited for Kanon-san’s reply, telling her that it was a misunderstanding.",
        "《Don’t you think that you should be a little more careful with your words and actions, Akito?》",
        "Apparently, Kanon-san can understand our situation even if she can’t see it.",
        "She got angry with me in a rather cold voice.",
        "“I’m sorry…”",
        "《Well, that’s fine now. Back to the topic at hand, to tell you the truth, I was indeed hurt.》",
        "I breathed a sigh of relief that she seemed to have let her bitterness end there.",
        "And then I made up my mind to face Kanon-san’s heart instead of running away from it.",
        "“Yes, I understand.”",
        "《But it’s not as bad as you think.》",
        "“Eh?”",
        "《No, it’s a little different. I have been hurt by your words, but I have never thought of blaming you for it.》",
        "“That’s…”",
        "I swallowed the words, “Isn’t that because Kanon-san is that kind of person?”",
        "Kanon-san doesn’t like it when people make assumptions about her personality.",
        "However, there’s still a part of her that never blames others because she’s a kind hearted person.",
        "That’s why I thought that she wasn’t blaming me this time either.",
        "《It’s true that Akito hurt me, but before that, I hurt you. So that was a deserved retribution.》",
        "“No, that’s not what I’m talking about… Besides, it’s not like Kanon-san did anything to me…”",
        "《It’s the same since I was blind to my father’s intentions because I got carried away.》",
        "You got carried away…?",
        "What do you mean?",
        "《I’m sorry too, for taking away something important from Akito.》",
        "“N-No, please don’t apologize! I’m the one who brought it up to apologize!”",
        "《Fufu, then let’s end this conversation here.》",
        "Oh, she got me…",
        "When I heard Kanon-san’s laughter, I realized that I had been led astray by her.",
        "Now I can’t apologize to Kanon-san anymore.",
        "If I continue to talk to her and try to apologize, she will probably try to apologize to me again.",
        "If I don’t end the conversation here, she will try to apologize again, implying that it will be a pointless and repetitive back-and-forth.",
        "“I understand… Now, let’s get to the point.”",
        "I decided that it was pointless to continue the conversation.",
        "Having made that decision, and knowing that Kanon-san was not angry, I decided to get to the point.",
        "However―",
        "《Shall we talk about it directly?》",
        "I was cut off by Kanon-san’s unexpected comment.",
        "“Directly…?”",
        "《It’s an important matter. Would you like to come to our house?》",
        "“Eh, right now?”",
        "《I’ll leave that up to you. But I will tell you that there is a child who is waiting for you impatiently.》",
        "A child who is impatiently waiting for me…?",
        "Kanon-san treated that person as a child, so that person is probably younger than her, but who is it?",
        "No way, could it be my fiancée…?",
        "“Is Kanon-san also involved in this matter after all…?”",
        "《Well, what are you talking about? What I want to know now is whether Akito is coming here or not.》",
        "“…I’m going.”",
        "《I understand. Oh, that’s right― Akito, you can decide if you want to come alone or not.》",
        "Whether to come alone or not― I guess that means whether to take Charlotte-san with me or not.",
        "She’s got a nasty way of saying that again…",
        "I looked over at Charlotte-san.",
        "I really don’t want to involve her in the mess at home, and I don’t want to take her with me if I might be married to someone else.",
        "I didn’t want to cause her any unnecessary worry.",
        "But―",
        "“Charlotte-san, will you come with me?”",
        "“―!? O-Okay…!”",
        "When I invited her, Charlotte-san opened her eyes in surprise, then hurriedly nodded.",
        "I’m sure she was expecting to be left behind.",
        "That’s what I would have done in the past, for sure.",
        "But I had just heard that she doesn’t want that.",
        "That’s why I decided to work together with Charlotte-san to get through this, instead of keeping it to myself.",
        "“Thank you, Charlotte-san.”",
        "“No, I should be the one saying that…!”",
        "Charlotte-san’s face brightened up and she seemed to be in a very good mood.",
        "I can say with confidence that I have not made a mistake in my answer.",
        "《It looks like you’ve decided, I’ll be waiting for you.》",
        "“Yes, I understand.”",
        "《Then, could you give me Charlotte-san for a moment?》",
        "It seems that she wanted to say hello to Charlotte-san before hanging up the phone.",
        "Since Charlotte-san was the owner of this phone, I didn’t pay any attention to it and handed it to her.",
        "Then, after Kanon-san said something to her, Charlotte-san apologetically moved away from me and started talking to Kanon-san.",
        "Then― her expression became darker and darker.",
        "No, what did she say to you…!?",
        "“―Um, Akito-kun…”",
        "Charlotte-san ended the call and called out dejectedly.",
        "“What on earth did she say to you…?”",
        "“What does she mean by fiancée…?”",
        "“…………”",
        "I couldn’t help but fall silent at the words Charlotte-san said to me.",
        "So that’s what you meant, Kanon-san…",
        "We were supposed to talk to each other before we got to the villa…",
        "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~",
        "Author’s Afterword:",
        "If you enjoyed it, I’d appreciate it if you could rate it, give me feedback, or bookmark it!",
        "(No, if you’ve read this far, you’ve probably bookmarked it.)",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Afterword: After almost 3 months, he finally updated two chapters from this series yeeeet! I’m starting to think that Kanon is just referring to Charlotte. Just extended, or made to look like suspense for the readers then it’ll turn out very different from what the MC had expected… I hope that’s the case at least since the author is notorious for doing a lot of sh*tf*ckery in his series lol.",
        "I’d like to thank the people who helped me in giving funds to buy myself a laptop since my parents were finally able to find one for me yesterday (Jan.7)! It was worth $800. I’m tired to put the specs of it here, so if you want to know, feel free to join our group’s discord server instead. Oh yeah, I actually did these two chapters using this laptop, it took longer than I usually do when I’m on PC so I think I probably need more getting used to this. Not to mention, I have the flu right now. It was hard to move my body and I kept coughing. Luckily though, my fever subsided 2 days right when my illness started. Only those two that are left. I hope I feel better soon though."
    ]
}