{
    "id": "chapter-61",
    "title": "Praying to God",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Charlotte’s POV**)",
        "Aoyagi-kun is such a bully…",
        "While Hanazawa-sensei was speaking, my cheeks were puffed up as I stared at Aoyagi-kun.",
        "Aoyagi-kun invited not only Saionji-kun but also Shinonome-san to lunch during the lunch break just now.",
        "I know that he’s a kind person, so he can’t leave a girl like Shinonome-san alone.",
        "Even I wouldn’t want to leave Shinonome-san alone either.",
        "However, when I go to talk to her, the other girls follow me, and Shinonome-san gets scared.",
        "That’s why I can’t talk to her, and the only way to prevent her from being alone is for Aoyagi-kun to make a move.",
        "I understand that.",
        "I know it in my head.",
        "But… I wish he would have at least invited me too.",
        "When he’s friends with other girls in places where I don’t know them, it makes my heart tighten up so much.",
        "…No, it’s a little different.",
        "It’s more heartbreaking when they make out in front of me, and more uncomfortable when they go somewhere I can’t see.",
        "I’m afraid that the person I love will go out with another girl…",
        "Even so, Aoyagi-kun is very popular…",
        "It may be strange that I, as a non-girlfriend, do not want Aoyagi-kun to get along with other girls.",
        "But no matter who you are, you should feel the same way about the person you love.",
        "Of course, I would be more than happy if the relationship was in moderation, but in the case of Shinonome-san, the distance between her and Aoyagi-kun is so close that it makes me worry.",
        "I’m sure you’ll be happy to know that I’m not the only one who has a problem with this.",
        "In addition― her breasts are very large…",
        "According to what I have learned from manga and other sources, gentlemen prefer large breasts.",
        "I think I have some too… but I’m not as big as Shinonome-san…",
        "It feels like her nourishment is going to her breasts, not her height.",
        "Aoyagi-kun’s a lolicon, the smaller the better― No, but when I think about it, the shorter the height and the more childish the face, the more I think of Shinonome-san…",
        "“―Mou~…”",
        "“What’s wrong, Charlotte?”",
        "When I puffed up my cheeks even more, Hanazawa-sensei, who was talking to me, got worried.",
        "I hurriedly remove the air from my mouth and smile at her.",
        "“No, it’s nothing.”",
        "“Fuun~… well, that’s okay. So, back to the topic at hand, each of you should participate in at least two events at the sports festival.”",
        "Hanazawa-sensei smirked at my attitude, then went back to her original topic as if nothing had happened.",
        "Could it be that she had noticed what I was thinking?",
        "Normally, this would be impossible, but since Aoyagi-kun often says that “Hanazawa-sensei is an extraordinary person,” it is not impossible.",
        "However, since she didn’t pursue the matter, she doesn’t seem to have much to worry about.",
        "I’ve often heard that Hanazawa-sensei is very considerate of her students, and I’m sure she wouldn’t want me to get hurt.",
        "…Aoyagi-kun and Saionji-kun seem to be a bit of a bully…",
        "That being said, they were now talking about the sports festival.",
        "Ugh… I hate it.",
        "I’m not very good at exercising and sports stuff…",
        "I am sad that a sorrowful future awaits me, but I return my attention to the teacher’s story.",
        "I’m not going to be able to make any more progress thinking about Aoyagi-kun, so I’ve decided to let him spoil me again this evening and vent this feeling.",
        "“For now, the 200m relay for the boys and the 100m relay for the girls will be chosen in the order of the fastest legs in the class, four men and four women. The men’s team will be Saionji, Kuroiwa, Yamada and Aoyagi. For the women, it’s Namba, Shimizu, Kanai, and Suzuki.”",
        "She must have been looking at the results of the physical fitness test that was held before I came to Japan.",
        "Hanazawa-sensei was holding a sheet of paper in her hand and was reading it out loud.",
        "Despite the fact that there were people from the track and field club, Saionji-kun and Aoyagi-kun, who were not in the athletic club, were included in the results.",
        "By the way, I heard that Saionji-kun is not a member of any school club, but he is a member of a soccer team that trains professionals.",
        "Does that mean that Aoyagi-kun is the fourth fastest boy in our class, even though he doesn’t do any physical activities?",
        "He also played soccer in middle school, so I guess he is athletic.",
        "…It’s not fair.",
        "I think it’s cool that he can study and play athletically, but it’s not fair that he has so much talent.",
        "I want him to share at least a little of his athleticism with me.",
        "After all, I’m not very good at sports…",
        "“Here, here, Miyu-sensei!”",
        "“Hmm? What’s up, Shimizu?”",
        "Hanazawa-sensei tilted her head and asked Shimizu-san, who suddenly raised her hand.",
        "I’m sure that Shimizu-san is the one who sat in front of Aoyagi-kun at the coffee shop yesterday.",
        "“Can I decline that?”",
        "“Why?”",
        "“I don’t want to sweat―”",
        "“―Refused.”",
        "“Ehh!?”",
        "Mr. Shimizu’s request not to participate in the 100-meter relay was quickly dismissed by Hanazawa-sensei.",
        "Everyone in the class looked at Shimizu-san with a look of ‘of course, that’s a given’.",
        "Perhaps it wasn’t the decline that was the problem, but the reason was not good.",
        "However, as a girl, I don’t want to sweat, so I understand the feeling.",
        "After all, the smell would bother them.",
        "“Sensei, I’m actually not feeling well…”",
        "“Well, then you should go to the infirmary. However, I’m sure you’ll be fine by the day of the sports festival, so I’ll include you in the relay team.”",
        "“I just twisted my foot.”",
        "“I twisted my leg earlier and it will be fine. If the twisting is not healed, you will not be able to walk without crutches.”",
        "It seems that Shimizu-san really doesn’t want to go out, and Hanazawa-sensei is always trying to get rid of her for whatever reason.",
        "Since it’s already known that she’s lying, wouldn’t it be better to just say honestly that she doesn’t want to participate so that her withdrawal will be accepted?",
        "It was not a good idea to say that you did not want to sweat, but if you tell her that you really don’t want to go out, I think Hanazawa-sensei will not force you to do it…",
        "“Oh, that’s right! How about Charlotte-san instead of me?”",
        "“Eh…?”",
        "I stared at Shimizu-san, confused by the sudden mention of my name.",
        "Then Shimizu-san said with a smile, as if to say that it was a good idea.",
        "“She hasn’t done the physical fitness test, so I don’t have her 50-meter running time, but she looks like she can work out!”",
        "“It’s true that I haven’t measured Charlotte’s time… But even if you move Charlotte up, you’re still the second fastest member of the team.”",
        "“Ehhh….. Hey, Charlotte-san. Can you take over for me, please? As my substitute, right?”",
        "She must have thought that she would inevitably be forced to run at this point.",
        "So she approached me to change directly as a substitute instead of moving up.",
        "“W-well, but…”",
        "If she was in trouble, I would like to help her, but I’m pretty slow, even for a girl.",
        "If I were to participate in a relay where only the fastest runners were competing, I would be causing trouble for everyone in the class…",
        "“You―”",
        "“Hey, Shimizu-san. You can’t be the only one to say what you want.”",
        "When I was in trouble, a voice interrupted Hanazawa-sensei’s voice and stopped Shimizu-san, echoing in the class.",
        "The voice was low, like a boy’s, but with kindness in it.",
        "“Aoyagi-kun?”",
        "Recognizing the voice, Shimizu-san called out the name of the voice’s owner.",
        "Yes, it was Aoyagi-kun, the man who always helps me when I’m in trouble.",
        "“Miyu-sensei. Can’t you make the participants of this relay either a candidate system or a lottery?”",
        "Aoyagi-kun looked at Shimizu-san for a moment and then called out to Hanazawa-sensei.",
        "“It’s a very important event that has been going on for a long time. While the other classes are trying to win seriously, our class can’t afford to cut corners.”",
        "“I see… There you have it, Shimizu-san. If the other classes are taking their selection seriously, our class must also be decided in order of someone’s foot speed. It’s true that many students don’t want to participate in this kind of event, and to be honest, I don’t want to participate either. But if I don’t participate, I’ll be putting it on someone else’s shoulders. And at the very least, it’s on a girl who is slower than you. You know what that means, don’t you, Shimizu-san?”",
        "Aoyagi-kun said in a gentle voice, trying to make her understand.",
        "I think what Aoyagi-kun is trying to say is that forcing a slow-footed girl to do something like this might embarrass her.",
        "It is inevitable that if a slow runner is mixed in with fast runners, he or she will stand out.",
        "“But I don’t want to go out if I don’t want to… Besides, Charlotte-san might be a fast runner too.”",
        "“Yes, you’re right. But that is not a reason to impose on others. If we don’t know the time now, we shouldn’t include it, even if we will measure Charlotte’s time later. To be honest, it’s not fair to ask her to do something you know she can’t refuse.”",
        "“Ugh… I understand… Sorry, Charlotte-san…”",
        "Shimizu-san nodded reluctantly at Aoyagi-kun’s words and then apologized to me.",
        "Probably because she was showing signs of liking Aoyagi-kun, I think she was afraid that Aoyagi-kun would hate her.",
        "“No, please don’t worry about it. I’m sorry that I couldn’t be of more help to you.”",
        "If I had been faster, I could have taken her place, so I apologized for not being able to do so.",
        "Although I was involved in the situation, I don’t want to leave any grudge behind.",
        "After all, it’s better for everyone to get along.",
        "“Now that we seem to have settled the matter, let’s decide on the next event.”",
        "After deciding that there were no more problems, Hanazawa-sensei started deciding the events that everyone would participate in one after another.",
        "The rest of the events, however, were all on a voluntary basis.",
        "I was chosen to participate in the borrowed relay, an event in which the speed of one’s legs does not matter much.",
        "I would have liked to participate in the non-running 20-person jump rope, but I gave that up because I was sure that I would have been caught as soon as I entered.",
        "―At that time, however, I had a feeling of discomfort.",
        "We were told that each of us would participate in two competitions, but for some reason, Hanazawa-sensei only allowed each of us to participate in one competition at a time.",
        "To explain the reason, Hanazawa-sensei opened her mouth with a grin.",
        "“Okay, so now we have one event for each of us to compete in. The last one is for everyone― the mixed gender tripod relay. This is our traditional event, so it’s mandatory for everyone to participate in.”",
        "Hearing Hanazawa-sensei’s words, the class was in an uproar.",
        "The boys were overjoyed, while the girls were very much against it.",
        "In the midst of all this― I prayed to God that I would be paired up with Aoyagi-kun."
    ]
}