{
    "id": "chapter-135",
    "title": "Meaningful Smile",
    "content": [
        "Translator: AJ1703",
        "(**Akihito’s POV**)",
        "“Onii-chan…!”",
        "Upon finding me, Emma-chan runs up to me with a tattling motion.",
        "With that, Charlotte-san gets off my lap.",
        "Her face had a pensive expression.",
        "I guessed it was because she had been unintentionally left behind.",
        "“Emma-chan, you’re awake.”",
        "I picked up Emma-chan, who had clung to my leg, and made her sit on my lap.",
        "Kanon-san and Sophia-san came through the door apologetically.",
        "“I’m sorry, she just woke up suddenly…”",
        "“When she realized that Akihito-kun was gone, she got out of bed and ran out of the room…”",
        "Well, I guess the anxiety must have hit her because she woke up in a room she didn’t know.",
        "What Sophia-san seems slightly shocked about is that Emma-chan has gone looking for me, even though she’s the mother, I suppose.",
        "“Nnn…”",
        "Emma-chan was relieved to find me and pressed her face against my chest.",
        "Maybe she is trying to sleep again.",
        "A little later, I heard Emma-chan’s cute sleeping breath.",
        "“What should I do…?”",
        "“Hmm… the same thing will probably happen if Akihito-kun is not there when she wakes up again…”",
        "Sophia-san glanced at Charlotte-san with a troubled laugh.",
        "Charlotte-san was still staring at me with a needy look on her face.",
        "I was just about to kiss her, so she seemed to be getting indigestion. [TLN: Yes, it is indeed indigestion, it’s a metaphor for the situation apparently, holy hell it took me 15 minutes for this line.]",
        "“Well, if she wakes up, then that’s just it. She doesn’t wake up easily anyway.”",
        "Saying this, Sophia-san tried to pick up Emma-chan from my arms.",
        "“…………”",
        "She grabbed my clothes tightly and didn’t let go.",
        "She seems to be holding onto it unconsciously because she is asleep.",
        "“Is she holding on so he won’t go away…?”",
        "“That seems to be the case…”",
        "Sophia-san and Kanon-san look at each other as if troubled.",
        "However―.",
        "“Well, fortunately she is sleeping― Akihito, it doesn’t matter as long as you don’t ruffle any feathers, does it?” [TLN: It probably means that it’s okay as long as he’s not moving much.]",
        "Kanon-san gave me a meaningful smile.",
        "Yes, she could see right through me, this face of hers.",
        "“Don’t imagine anything weird.”",
        "“Weird things, you say?”",
        "I denied it, and Kanon-san looked at Charlotte-san with meaningful eyes.",
        "Charlotte-san’s face was red and she was sobbing, with a greedy look on her face.",
        "I understand that she can’t wait― but she is completely out of it.",
        "“Shall we go, Onee-sama?”",
        "“Yeah, it seems that we’re interrupting them.”",
        "And then they left the room, laughing meaningfully.",
        "―No, please.",
        "I feel so awkward, you know?"
    ]
}