{
    "id": "chapter-114",
    "title": "The Bet",
    "content": [
        "Translator: AJ1703",
        "Editor: kyomii",
        "(**Akihito’s POV**)",
        "“―Excuse me, I have brought Akihito-sama and Bennett-sama with me.”",
        "Arisa-san’s words drew the eyes of the two people inside the room to us.",
        "One of them is a pretty, beautiful girl with long, straight black hair.",
        "Her face is more mature than I remember, but she is still beautiful.",
        "She is Kanon-san, who used to take care of me like a little brother.",
        "In front of him sits a man who stares at us, seemingly unable to hide his annoyance.",
        "He is Kanon-san’s father and the current leader of the Himeragi Conglomerate.",
        "He’s also the man who ruined my life.",
        "“Akihito, Charlotte-san, why don’t you sit down first?”",
        "Kanon-san, smiling kindly at us, asked us to sit down while she was standing up.",
        "Chairs were placed on either side of the chair in which Kanon-san was sitting, and she moved to the chair on the left.",
        "Apparently, she wants us to sit on the chairs in the middle and on the right side.",
        "In terms of sitting, she wants me to sit so that I am facing President Himeragi.",
        "I sat in the middle chair and Charlotte-san sat in the chair on the right side.",
        "“I thought you were in the middle of something.”",
        "“No problem, it’s a small matter.”",
        "I asked her since she they were in the middle of a conversation, but Kanon-san just simply denied it with a smile.",
        "But an exasperated President Himeragi spoke up.",
        "“A trivial matter, you say…!? How can you say such a thing while selling out your own father!”",
        "Apparently, President Himehiragi was furious with Kanon-san.",
        "Even if he’s the head of a major company.",
        "He was quick-witted and seemed to have an idea who had leaked the information to the TV station.",
        "“It’s a small matter to me. At least, it is not a big deal compared to the fact that you betrayed me and Akihito. Just as it was no big deal for you to betray us.”",
        "“Who do you think you have been living unimpeded all this time thanks to!? What you have done is a betrayal against me!”",
        "“I don’t care how you see it. More importantly, father. You haven’t forgotten about the bet, have you?”",
        "Bet…?",
        "I don’t know what this is about, but the fact that she brought it up just as I arrived suggests that it has something to do with me.",
        "Moreover, President Himeragi is looking at me impatiently.",
        "“Akihito, may I ask you a question?”",
        "“What is it?”",
        "“Can you tell me why you are here?”",
        "To be honest, I don’t really understand this situation.",
        "But I knew that Kanon-san was not someone who would do something meaningless.",
        "Besides, I was starting to see things from the attitude of Kanon-san and President Himeragi.",
        "So I took a deep breath and looked President Himeragi in the eye.",
        "“I came here today to ask you to cancel the arranged marriage.”",
        "When I replied, President Himeragi, irritated, threw a cup of hot water that was on the table at me.",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Afterword: Merry Christmas to my readers who are celebrating it! I guess happy holidays instead to those who don’t xD",
        "Anyway, as part of my Christmas “gift” to you guys, I have released a bunch of chapters from multiple series. Check our discord server #releases channel to find the other ones I have done. Currently, this chapter is the latest for the web novel version. I’ll be releasing also the light novel version so I hope you guys do read it also if you get the time!I sincerely apologize for the lack of updates in all of my series as I have been busy with my College studies. I hope you guys will continue to support me, and again, Merry Christmas to you all!"
    ]
}