{
    "id": "chapter-32",
    "title": "The Bennett Sisters are Charming Today as Well",
    "content": [
        "(**Aoyagi’s POV**)",
        "“―Nnngh…”",
        "I woke up naturally as the morning sun streamed in through the curtains.",
        "I woke up before the alarm went off, maybe it was already ingrained in my body to wake up at this time.",
        "I picked up my phone and quickly turned it off so that my alarm wouldn’t go off.",
        "Now then, time to wash my face and get ready―.",
        "“Good morning, Aoyagi-kun. How are you feeling?”",
        "“…Eh?”",
        "When I tried to sit up, the girl looked into my face, and I froze.",
        "Unable to comprehend the situation, I stared at the girl who was looking at me― Charlotte Bennett.",
        "When Charlotte saw my face, she smiled happily.",
        "“Your fever seems to be gone now. But just to be sure, could you please take your temperature? I have a thermometer right here.”",
        "Charlotte-san handed me a thermometer, as if she had prepared it while I was asleep.",
        "As I received the thermometer, my mind gradually became clearer and I remembered what had happened yesterday.",
        "I remembered that yesterday, Charlotte mistook me for having a fever and forced me to go to bed…",
        "But why was she in my room when I woke up in the morning?",
        "Don’t tell me she hasn’t been back to her room since yesterday?",
        "“Umm, Charlotte-san? Could it be that you’ve been up all night taking care of me?”",
        "“Don’t worry about it. It was something I did on my own.”",
        "It wasn’t clear, but Charlotte affirmed.",
        "I feel so guilty.",
        "It’s not that I had a fever, it’s just that she swept me off my feet and I fell asleep.",
        "And yet, I had made her stay up all night to take care of me.",
        "I’m a horrible person.",
        "“I’m sorry, Charlotte-san.”",
        "“Just like what I’ve said earlier, don’t worry about it. If anyone is in trouble, we should help each other out, and I did just that.”",
        "“No, that’s not it… I didn’t have a cold and a fever yesterday.”",
        "“Eh?”",
        "“Well… when you touched me, I was embarrassed and my temperature rose, and Charlotte-san thought it was a fever.”",
        "I was embarrassed to tell her everything, but I didn’t want to keep her in the dark after keeping her up all night.",
        "I wanted to at least apologize properly.",
        "“B-but still, it was pretty hot, you know…? I can’t believe it got that hot just because I touched it―”",
        "As if she had something on her mind, Charlotte-san stopped mid-sentence and turned her face away.",
        "The side of Charlotte-san’s face that I could see immediately turned red.",
        "“Just to be sure, I… I touched my forehead with yours… Is it because of that…?”",
        "It seems that Charlotte-san thinks that the reason my temperature rose so quickly was because she put her forehead against mine and my face was very close to hers.",
        "The truth is that it was caused by my hand on her face, but she’s been up all night, so I guess she’s a little out of her head.",
        "I’m kind of grateful that she misunderstood me.",
        "“Erm, that’s why I apologized. I’m sorry for making you take care of me even though I didn’t have a fever…”",
        "“No, no, it’s because I misunderstood… I’m sorry too…”",
        "I don’t know what she’s embarrassed about, but Charlotte-san’s face turns bright red and she begins to fidget.",
        "She’s glancing up at me and looking at my face, which is really cute.",
        "I did feel guilty for making her stay up all night, and I felt sorry for Charlotte-san because looking at her almost filled my heart with joy.",
        "However, such a time came to an abrupt end.",
        "“―Lottie, where are you? Uwaaaaaaaaaaaaaaaaaaaaaa~!”",
        "“–!”",
        "Suddenly, when we heard a little girl crying from another room, Charlotte-san and I looked at each other.",
        "Speaking of which, Charlotte-san is here, but I can’t see Emma-chan.",
        "There’s no way she would leave her little sister alone at home, so she must have let her sleep in another room.",
        "“Lottie~!”",
        "“Emma, I’m here!”",
        "Charlotte-san hurriedly opened the door of her room and called out to Emma.",
        "Then, when Emma saw Charlotte, she stopped crying.",
        "Afterwards, Emma started to run towards us.",
        "I watched her, thinking, “Oh, she’s going to hug Charlotte-san,”―-but for some reason, Emma walked past Charlotte-san, who was waiting for her with her arms outstretched.",
        "And then―",
        "“Onii-chan!”",
        "―She hugged me with a big smile on her face.",
        "“…………”",
        "Charlotte-san, who was waiting with her arms outstretched to hug her, froze when she was ignored.",
        "I don’t know what to say to her.",
        "Speaking of Emma-chan, who had created this awkward atmosphere, she was rubbing her cheek against mine while letting out a happy “ehehe” laugh.",
        "Emma-chan’s height seems to be just right for me, since I’m sitting upright from the futon.",
        "“Hey, hey, Onii-chan. Are you going to start living with us at Emma’s house today?”",
        "As I was thinking about what to do about this situation, Emma-chan pulled away from me and looked into my face.",
        "“Erm, what made you think that?”",
        "“Because you’re in Emma’s house, on her futon!”",
        "“Oh, this isn’t Emma-chan’s house, it’s my house.”",
        "“Eh…? Ah, that’s right! It’s Onii-chan’s house!”",
        "Hearing my words, Emma-chan scampered around and looked surprised.",
        "I thought she cried because she woke up and found herself in a strange room, didn’t she?",
        "Did she just cry because she woke up and Charlotte-san was not there?",
        "Just how much did Charlotte-san spoiled her little sister…",
        "No, well, I do understand Charlotte-san’s desire to be a big sister who really wants to spoil their younger sister. More so, if it’s Emma-chan, who’s the younger sister, I also really want to spoil her too.",
        "“Then, will Emma start living in Onii-chan’s house today?”",
        "“No, that’s not…”",
        "“Ehh~… Emma wants to be a part of Onii-chan’s family…”",
        "What should I do?",
        "Isn’t this child developing her own world too much?",
        "Why is she saying that she wants to be a part of my family?",
        "Well, as far as I’m concerned, a cute little sister like Emma is more than welcome.",
        "But as expected, the law and Charlotte-san will not allow it.",
        "“Fuun~… Then, Emma is fine without me?”",
        "Feeling abandoned by her little sister(?), Charlotte-san looked at Emma-chan and said so with a sultry voice.",
        "Her cheeks seem to be puffy as well.",
        "She’s also surprisingly childish despite her looks…",
        "I thought of this in my mind as I looked at Charlotte-san, who was sulking.",
        "I’m not going to say it out loud though.",
        "If I said that, it’ll make her even more sulky.",
        "“No, Lottie needs to be there too! So, Lottie will also live in Onii-chan’s house as well!”",
        "Oops, what is Emma-chan really saying with a big smile on her face…",
        "I’m sure Charlotte-san won’t take it personally since it’s only a kid saying it.",
        "“What are you even saying, Emma!? That’s just asking for the impossible!”",
        "See?",
        "In any case, in a manga, the heroine would probably say something convenient to the protagonist in this kind of situation, or it would turn out to be a lucky break, but reality is not that sweet.",
        "It would be stupid to expect anything.",
        "“Mouuuuuuuuuuuuu~!”",
        "I’m not sure if it’s because Charlotte-san denied her, but Emma-chan’s cheeks puffed up and she began to press her face against Charlotte-san’s.",
        "I thought that the Bennett sisters were charming today as well, as I looked at Emma-chan, who was being soothed by Charlotte-san with a troubled smile on her face."
    ]
}
