{
    "id": "chapter-84",
    "title": "Thin Books and Punishment",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Charlotte’s POV**)",
        "“―Well, do you have an excuse?”",
        "Mom asked with a gentle smile as she sat me down in a chair and held the sleeping Emma in her arms.",
        "The smile that she has looks like the smile of the devil to me.",
        "“I have none…”",
        "“I know you’re happy to have a boyfriend, and I know it’s easy for you to go out with him because he’s your neighbor, but you have to draw the line, okay? You’re his girlfriend, not his fiancée.”",
        "“But in the future… marriage…”",
        "“Does he have that in mind? What if he’s just after your body―”",
        "“―Wha!? That’s not true! Akito-kun is not that kind of person!”",
        "I was going to be quiet and let her get mad at me, but she insulted me about Akito-kun, so I immediately said something back.",
        "Even if she was my mother, I wouldn’t allow her to say anything bad about Akito-kun.",
        "No, it’s because she’s my mother that I can’t allow it.",
        "“…You know, Charlotte. How much do you actually know about that boy?”",
        "“Eh…?”",
        "The unexpected question caught me off guard, and I was confused because I was angry at her.",
        "Then, she asked again.",
        "“Where was he born? Where did he grow up? Do you know exactly how he’s been living his life?”",
        "“That’s… none of my business right now…”",
        "“In other words, he’s not telling you, is he? Do you ever think that maybe he has a past he wants to hide― or maybe, he just doesn’t trust you?”",
        "“―Ha!? Why do you keep saying such terrible things? I’m just not asking because it’s not a good idea to pry into people’s pasts, and Akito-kun is not the kind of person who would go out of his way to boast about his misfortunes―!”",
        "“Fuun~, so you do know about his misfortune? That’s why you can’t go into it because you don’t know what will come out?”",
        "“―!”",
        "I gulped as I was hit on the point.",
        "However, I immediately opened my mouth to argue.",
        "“M-mom doesn’t know anything about him either…!”",
        "“That’s right, I don’t know anything about him. After all, I’ve never talked to him before.”",
        "“Then don’t say such horrible things!”",
        "“But that doesn’t mean you don’t need to know, does it?”",
        "“―! I don’t care! I’m happy enough as it is, and if Akito-kun doesn’t want me to know, I won’t pry! It’s because I believe in Akito-kun!”",
        "If you say I’m bluffing, then you’re probably right.",
        "In truth, I was thinking deep down.",
        "I wanted to know more about him, but I was afraid to ask him about his past…",
        "As Mom had said, after learning a little about Akito-kun’s past, I was hesitant to go any further.",
        "I was afraid that what I was about to find out would hurt him.",
        "I was also afraid that I would cause him to remember the past that he didn’t want to remember.",
        "So, since yesterday morning, I have made up my mind not to ask him about his past anymore.",
        "When she pointed this out to me, I recoiled, partly because I was angry.",
        "“…One thing your mother can advise you. Knowing a person’s past is not just for suspicion. The present and the past are inseparable. That’s why you need to know about his past.”",
        "Mom stared at me for a little while, and then said in a gentle voice, as if she was telling a child something.",
        "But to me now― it sounded like she was denying Akito-kun by bringing up his past.",
        "“No matter what kind of past Akito-kun has, the one I love is the one right now! So this feeling is―”",
        "“―If you can’t understand these words, something irreversible will happen one day.”",
        "It was a very cold voice that seemed to freeze the air.",
        "A cold and frightening voice that even my mother, who was more terrifying than a Horned Demoness, had never made before.",
        "It was like a voice that froze me to the core, and I stared at her face with some trepidation.",
        "Then she smiled at me.",
        "“That’s all the advice your mother can give you.”",
        "“Mom…?”",
        "For some reason, she turned her back on me and walked to the door with Emma in her arms.",
        "Then, as if by coincidence, the intercom rang.",
        "“―I’ve come for you, President Bennett.”",
        "When Mom opened the door, somehow the maid from earlier bowed her head.",
        "She seemed to have come to pick up Mom, but why would she come to pick her up?",
        "And― what does she mean by “president”…?",
        "It’s not what my mother told me before we came to Japan, is it…?",
        "“Um, Mom…?”",
        "“I’m sorry, Lottie. I’ll tell you all about it one day when I can. In the meantime, you should go and talk to the person you need to talk to right now.”",
        "My mother called me back, and then smiled kindly.",
        "The person you need to talk to right now― she was probably referring to Akito-kun.",
        "Perhaps she’s taking Emma with her so that she can leave us alone.",
        "“Where are you going, Mom…?”",
        "“I’m going to continue an important business meeting I’ve been having since I came to Japan… But, I’ll finish it today.”",
        "I thought she would be off work today since she had been home all day yesterday, but it seems that my mother is going to work now.",
        "But why is she going with the maid?",
        "And why is she taking Emma to a business meeting, but it seems that the maid doesn’t look like she is stopping her.",
        "I feel like there’s something wrong with that… Maybe this is something I shouldn’t get into.",
        "I still have a lot of things I want to talk about with Akito-kun, so I’m grateful to be left alone with him.",
        "“Yes, I understand. Take care, Mom.”",
        "“I’m off.”",
        "I sent her off with a smile, and she nodded back with a smile.",
        "As she was about to leave the room, she stopped as if she remembered something.",
        "Then, she looked back at me and smiled at me again.",
        "I don’t know why, but unlike earlier, I have a very bad feeling about this.",
        "“―Oh yeah, don’t do those thin books you have hidden in your room, okay? That’s not what he’s looking for.”",
        "[EDN: Thin books is a slang term in Japan for…Doujinshi, in other words, Short Magazine/Story. But the word doujinshi itself literally means self-published print works such as manga, novels and magazines. In other words, not all doujinshis are R18, there are also some doujinshis that have a series of published works.]",
        "For a moment, I didn’t understand what was being said.",
        "However, when I understood the meaning of the words, my face became very hot.",
        "“M-Mom!?  Why!?  How did you know!?”",
        "“I don’t know~.”",
        "Mom smiles and laughs happily.",
        "It’s the devil!",
        "I knew that my mom was a devil…!",
        "“President Bennett… is surprisingly a demon…”",
        "“It seems that I really do need to give her some punishment later on. Next time you want to hide something, hide it a little better, Lottie.”",
        "Mom replied to the bitterly smiling maid with a beautiful smile.",
        "Then she smiled at me again and waved her hand at me.",
        "To such a mother, I was exposed to a secret―",
        "“Mom’s an idiooooooooooot!”",
        "I shouted at the top of my lungs.",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Comments: I don’t understand what’s going on anymore, I need to read more."
    ]
}