{
    "id": "chapter-63",
    "title": "Who's Cuter, The Older Sister or The Younger Sister?",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "“―Cuddle.”",
        "When I returned home after my tutoring job, Emma-chan came out of Charlotte-san’s house after hearing the sound of the key and asked for a cuddle.",
        "She seems to have learned what time I come home these days, and Charlotte-san told me before that she was sitting on the front porch waiting for me.",
        "Naturally, Charlotte-san, who’s very protective of her little sister, was standing behind Emma-chan.",
        "I took Emma-chan in my arms first, and as usual, she let out a cute little laugh and rubbed her cheek against mine.",
        "She’s still as sweet as ever.",
        "“I’m sure you’ve already taken it for granted that you can carry Emma in your arms.”",
        "“I can’t say no to her when she asks this much.”",
        "I stroked Emma-chan’s head gently and carefully as I turned to Charlotte-san.",
        "It seems that Charlotte-san has already taken a bath and was wearing pink pajamas with white polka dots on them.",
        "It’s a color that suits her girlish figure well, and I couldn’t help but admire it.",
        "“Umm… I’m embarrassed if you stare at me too much…”",
        "I’m not sure if I’ve been staring too much, but Charlotte-san quickly averted her gaze as she put her right hand, which was lightly clenched into a fist, over her mouth.",
        "And yet, as she glanced up at my face and fidgeted, I felt like fire was going to burst out of my face.",
        "“Onii-chan, is Emma cute too?”",
        "What’s going on all of a sudden?",
        "As I was staring at Charlotte-san, Emma-chan, who was wearing pajamas with a cat ear hood, suddenly looked into my face.",
        "She just said “Emma too”, but I’m pretty sure I didn’t say Charlotte-san was cute, did I?",
        "Could it be that my expression gave me away?",
        "“Emma-chan is also very cute.”",
        "At any rate, I can’t not answer the question if asked, so I answer honestly.",
        "I mean, you don’t have to ask me if Emma-chan is cute or not, but of course she is.",
        "“More than Lottie?”",
        "….This is a hard question to answer.",
        "Isn’t this the question where if you stand up for one of them, the other one will get hurt…?",
        "Moreover, even Charlotte-san was staring at my face when she heard Emma-chan’s words.",
        "How should I answer this?",
        "To begin with, the concept of cuteness is different between Charlotte-san and Emma-chan.",
        "Charlotte-san is cute as a woman, but Emma-chan is cute as a young child.",
        "To be honest, I don’t think we should compare them.",
        "Should I say Emma-chan here so as not to hurt her?",
        "I’m sure Charlotte-san will think that I chose Emma-chan because she’s so young.",
        "Children cry when they don’t know any better, and it’s usually natural to stand up for the younger ones.",
        "“Yes, Emma-chan is cuter.”",
        "“Really!?”",
        "“Ah, it’s true.”",
        "“Ehehe, Onii-chan, I love you!”",
        "She was so happy to hear me say she was cuter that she rubbed her cheek against mine.",
        "She was so cute that I couldn’t help but relax my cheeks.",
        "To be honest, I feel very happy.",
        "But there was something a little unexpected.",
        "I was struck by a strange sensation, and I couldn’t help but look in the direction where the sensation came from.",
        "Then I saw the beautiful exchange student with puffed out cheeks who turned away from me.",
        "“I knew that Aoyagi-kun was a lolicon… Even though I know that Emma is very cute, he didn’t have to be so delirious about her…”",
        "Charlotte-san is muttering something to herself.",
        "What should I do?",
        "I thought there would be no problem if I stood up for Emma-chan, but Charlotte-san is sulking to great acclaim.",
        "“Erm, Charlotte-san…?”",
        "“………….”",
        "I called out to her and she looked at me with her cheeks puffed out.",
        "Isn’t she aware that she’s doing something childish right now?",
        "…Well, I guess it’s okay because she’s so cute.",
        "After all, it was me who made her sulk…",
        "“U-umm, Charlotte-san is… also cute…?”",
        "I held back my embarrassment and said to Charlotte-san the words I would never say to a girl my age.",
        "If I’m not very good at it, I’m sure I’ll be rejected.",
        "But if she’s sulking because her little sister is cuter than her, then the only way to put her in a good mood is to say that she’s also cute.",
        "After all, it’s true that Charlotte-san is cute.",
        "“I-I’m cute…!? Aoyagi-kun told me that I was cute…!”",
        "It was probably a mistake to say it directly, but Charlotte-san turned her face away from me.",
        "I think I might have made a terrible mistake by mistakenly thinking that she might like me.",
        "Oh no, what should I do if she hates me now…?",
        "―But it seems that I had nothing to worry about.",
        "After turning her face away from me, Charlotte-san slowly approached me and gently wrapped her arms around me with her own.",
        "“Cha-Charlotte-san…!?!?”",
        "“Please, don’t look at me…”",
        "As if she was too embarrassed, I looked at her and she pressed her face into my arm like before.",
        "I could tell from her voice that she was very embarrassed.",
        "Wait, what’s up with this girl!?",
        "She’s too cute…!",
        "Charlotte-san’s shyness and sweetness made me squirm.",
        "―Without even noticing a certain gaze staring at us.",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Comments: My guess would be either Emma or Shinonome-san."
    ]
}