{
    "id": "chapter-78",
    "title": "The Girl Who Wouldn't Leave",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "―It had been an hour or so since I had let Charlotte-san sit on my lap and started to hold her gently.",
        "What I did during that time was just to watch Charlotte-san, who was in a good mood in my arms, rubbing her cheek against my chest.",
        "At her request, I kept stroking her head, though.",
        "Charlotte-san has become such a spoiled girl that I’m beginning to wonder if Emma-chan has taken over.",
        "To put it bluntly, she was just too cute.",
        "I’d rather someone praise me for being able to keep my wits about me to this point.",
        "Apparently, I’m a surprisingly strong-willed person.",
        "However, I’ve reached my limit, so I’m going to take action.",
        "“Umm, I think it’s time to talk about the future, is that okay?”",
        "When I called out to her, Charlotte-san looked up at me with a more indulgent expression on her face.",
        "The combination of her feverishly glowing eyes and her bright red face made her look very sexy.",
        "I can’t believe how far this girl is willing to go to destroy my reason.",
        "I’m really reaching my limit.",
        "“Can’t we do this for a little while longer…?”",
        "“…Yeah, it’s fine…”",
        "Since I told her that it’s fine, Charlotte-san pressed her face against my chest.",
        "What I’m thinking and what I’m doing are two different things…",
        "“What Charlotte-san wanted to talk about was whether or not we’re going to tell everyone about our relationship?”",
        "For now, it’s cute, so I don’t give Charlotte-san the benefit of the doubt and ask her the question while I’m holding her.",
        "She looked embarrassed, but nodded her head in agreement.",
        "Apparently, I was right.",
        "“What do you want to do, Charlotte-san?”",
        "I asked Charlotte-san’s opinion first.",
        "I want to prioritize Charlotte-san’s feelings in these matters, and I’m not that particular about it.",
        "I’m sure I’ll get a lot of jealousy if she chose to tell others, but it’ll give me more time to be with Charlotte-san.",
        "It’s not worth comparing which is more important.",
        "On the other hand, if Charlotte-san wanted to hide it, there would be no problem either.",
        "The people around us wouldn’t feel jealous of us, and it’s also possible that we can only get along with each other behind the scenes.",
        "I’ve been in this relationship for a while now, and I’ve come to realize that I apparently like secret relationships.",
        "Not that I have any strange sexual preferences.",
        "“I’m…”",
        "While I was staring at Charlotte-san’s face and thinking about it, she glanced up at me shyly and started fidgeting with her fingers.",
        "Yes, she’s very cute.",
        "“I…I want to tell everyone about it…”",
        "It was a very unexpected answer.",
        "I thought it would be fine either way, but given her personality, I thought she would choose to hide it.",
        "At least, I didn’t think she would choose to announce it herself.",
        "But apparently, she wanted to tell everyone.",
        "I knew she wasn’t just trying to show off, but what was her real intention?",
        "“Okay, then let’s tell everyone.”",
        "I was curious about Charlotte-san’s thoughts, but if I asked her here, she would think that I had a negative opinion, so I accepted her words with a smile.",
        "However―",
        "“〜〜〜〜〜Fua!”",
        "For some reason, Charlotte-san begins to writhe in my arms.",
        "She’s been emotionally unstable since a while ago, but I wonder if she’s okay…?",
        "“A-are you okay?”",
        "“…………”",
        "When I asked her about it, Charlotte-san nodded her head while covering her face with her hands.",
        "It doesn’t look like she’s okay at all, but if she says so,  then I guess she is.",
        "“…This distance is too destructive…”",
        "Charlotte-san is mumbling something in my arms, but her voice is too low to be heard.",
        "However, her eyes, which can be seen through the gap between her fingers, are still as feverish as ever.",
        "“Well, isn’t it time to leave now?”",
        "Thinking that it was really not a good idea to go any further, I tried to gently pull Charlotte-san down from my lap.",
        "But instead of coming down, she squeezed me tightly and clung to my chest.",
        "“I don’t want to leave… today…”",
        "The words were whispered in a muffled voice.",
        "There’s no way I can leave her after hearing her say this.",
        "―In the end, I continued to hug her until Charlotte-san fell asleep, and then I couldn’t let her go until morning came.",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Comments: Help, I need more insulin, or else, I’ll die at this point due to diabetes.",
        "Editor’s Comment: Must be nice having that kind of a girlfriend. Hahaha… *sobs*"
    ]
}