{
    "id": "chapter-40",
    "title": "An Unforeseen Situation",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "“Aoyagi-kun, why don’t we go that way…?”",
        "“Eh? But… that’s a long way around though…?”",
        "Charlotte-san pointed in a direction where there were few people, and it was a long way to go to school.",
        "We didn’t spend too much time trying to get Emma-chan off after all, but we were still heading to school later than usual.",
        "If we continue to take the long way around, we’ll probably arrive at school just in time.",
        "“I know that, but…”",
        "Charlotte-san was still fidgeting as she looked away from me.",
        "Is there a reason why she wants to go another way?",
        "As for me, I’m honestly happy to be able to spend more time with her.",
        "This road in particular is not crowded until we get close to the school.",
        "There is almost no chance that students from the same school will pass by.",
        "After all, the road is a bit steep.",
        "If I were to think about it, I wouldn’t want to get tired before school, and it wouldn’t be good to go just in time.",
        "But if I can be with Charlotte-san, then of course―",
        "“Sure, let’s go that way. I think it’s good to go there once in a while to enjoy a different view.”",
        "―I accepted with a smile.",
        "The reason I gave an appropriate reason was because I didn’t want Charlotte-san to know that I had agreed to this so that I could spend more time with her.",
        "If such a reason were to become known, it would be like declaring that I was interested in her.",
        "I must avoid that at all costs.",
        "“T-thank you so much! I’m sorry about that… I’ve been so selfish today…”",
        "“No, it’s fine. I think we can get along better if you don’t hesitate to tell me.",
        "After a happy smile, Charlotte-san apologized and I told her what I was thinking.",
        "In fact, I think we’re getting along much better now than ever since when we first met.",
        "I still feel like she’s scared of me, but the fact that she tells me that she’s being a bit more selfish than usual is because she thinks that I’m someone she can openly do anything and ask with.",
        "I don’t think she would ever look down on others.",
        "So I think she recognizes that we are close enough that it’s okay to be selfish.",
        "“―What should I do… if I keep doing this… I feel like I want to be spoiled even further…!”",
        "Upon hearing my words, Charlotte-san turned over with her hand on her cheek and was mumbling something.",
        "Does this girl have a habit of talking to herself?",
        "Well, in Charlotte-san’s case, it doesn’t bother me that much because she looks good even when she’s talking to herself.",
        "But just now, it’s a little bad.",
        "“I’m sorry, but if we’re going that way, we should get going soon or else we’ll be late…”",
        "“Ah―I-I’m sorry! L-let’s go then!”",
        "When she came to her senses, Charlotte-san hurriedly looked up and smiled.",
        "Then the two of us moved together― but Charlotte-san was still holding on to the sleeves of my clothes.",
        "―But there was one more thing that I didn’t expect.",
        "“Haa… haa… I’m… I’m sorry… Aoyagi-kun…”",
        "As we were walking towards the school, Charlotte-san, who was walking next to me, apologized to me in a pained voice.",
        "She was breathing hard, and her face was dripping with sweat.",
        "Charlotte-san couldn’t seem to walk by herself anymore, so she hugged my arm as she walked.",
        "The reason why Charlotte-san was like this was because of the detour we took and her weak physical strength.",
        "The path was a little steep with poor footing, and Charlotte-san almost fell at every turn.",
        "If she was a little more careful, she should be fine, but Charlotte-san’s body mass was probably weak.",
        "That’s why she easily loses her stance.",
        "She would then try to force herself back into position, which consumed a lot of energy.",
        "To top it all off, the uphill climb, which could be called a steep hill, put a stop to her.",
        "Charlotte-san, who was trying her best not to bother me, ran out of energy while climbing up the hill.",
        "I had an image of her being able to do anything, but judging by her weakness and lack of stamina, Charlotte-san might not be very good at exercising.",
        "I should have told her beforehand that the road was a bit steep.",
        "“Well, are you okay? If it’s too hard for you, do you want to take a break?”",
        "“But if I do that, we’ll be late. Aoyagi-kun, please go ahead… I’ll be there later…",
        "“I can’t do that, you know? What would you do if something happened to you?”",
        "If I leave Charlotte-san in her current state, she could be in mortal danger from dehydration or sunstroke.",
        "And even though it’s September now, the temperature for the past few years has been the same as summer.",
        "“Ugh… I’m so sorry…”",
        "Charlotte-san apologized again, almost in tears.",
        "I’m sure it’s hard for her to accept that she’s causing me so much trouble.",
        "I’m not going to lie, I never thought I’d be in this situation just going to school.",
        "But what happens, happens, and I’ve agreed to go to school this way.",
        "So it was not her fault.",
        "“It’s okay, you can just put a little more weight on me. Then Charlotte-san will feel more comfortable and we can increase our walking speed. After that, we’ll have something fun to talk about. ―Yes, tell me about the manga you like, Charlotte-san.”",
        "A slender woman like Charlotte-san could walk without any problem even if she had to put all her weight on me, so I decided to talk to her about her favorite topic so that she wouldn’t mind the current situation."
    ]
}