{
    "id": "chapter-73",
    "title": "Eliminating The Escape Routes",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "“Aoyagi-kun…”",
        "“Y-Yeah…?”",
        "As she stares at me with feverish eyes, I reply nervously.",
        "Charlotte-san, you’re forgetting that you’re in a department store, aren’t you?",
        "It’s like begging a lover for something―",
        "“―Could you get me another one of these…?”",
        "“…Eh?”",
        "“Um, one more…”",
        "Perhaps because I asked her back, Charlotte-san began to fidget as if she was having a hard time saying it.",
        "It’s very cute to look at, but I imagined a different kind of begging, and I felt guilty and embarrassed, and I wanted to go into a hole.",
        "Charlotte-san, please don’t ask me for a favor with that look on your face because others will get the wrong idea…",
        "“Erm… It’s fine, but is one not enough?”",
        "“One would probably be taken by Emma… I’d have to give her the other ones, but I didn’t want to give her this one I have…”",
        "When Charlotte-san said this, she hugged the stuffed cat she was holding so carefully even tighter.",
        "It might be a sign that she doesn’t want to give it to anyone else.",
        "I thought it was very cute to watch her being so coy.",
        "“Yeah, I get it. Which one should I take?”",
        "If I took another one, Emma-chan might’ve wanted the stuffed animal that Charlotte-san was holding.",
        "If so, I thought, the problem would be solved if they were identical―",
        "“Oh, let me see… I think that cat will be fine.”",
        "As if she didn’t want theirs to be the same, Charlotte-san pointed to a different stuffed animal.",
        "The stuffed animal looked just like the cat that Emma-chan had loved at the zoo before.",
        "It was easy to get to, so there would be no problem.",
        "―I quickly got the stuffed animal and gave it to Charlotte-san.",
        "Charlotte-san then got a bag of prizes from the arcade clerk and put only Emma-chan’s stuffed cat into the bag.",
        "“Is that stuffed animal okay?”",
        "“Yes, this one is fine.”",
        "Charlotte-san hugged the stuffed cat tightly and then hugged my arm again.",
        "It seems that she will be hugging the stuffed cat for the rest of the day.",
        "I was very happy that she liked it, and Charlotte-san was very cute as she hugged the stuffed animal with care.",
        "Sometimes she laughs and puts her mouth on the back of the stuffed animal’s head to play with it, and it’s just too cute.",
        "I wish this time could go on forever.",
        "As I looked at Charlotte-san, frolicking like a child, I thought I was happy.",
        "◆",
        "“Aoyagi-kun, since we’re here, should we go take a look at some clothes?”",
        "Charlotte-san, who had returned to her normal self and seemed to have had enough of the stuffed animals, asked me.",
        "It was a good opportunity, or rather I had originally planned to come here, but I had taken too many detours to other things.",
        "I nodded and walked over to the store Charlotte-san wanted to go to.",
        "After that, I could only admire her while she browsed.",
        "That’s what I was thinking― but it’s Charlotte-san that I’m dealing with.",
        "Charlotte-san was not the kind of person who would allow such a naive idea.",
        "“What kind of clothes do you like, Aoyagi-kun?”",
        "These were the words that came out of her mouth as soon as we entered the store.",
        "Since I was suddenly asked to talk about it, I stammered.",
        "I’m not sure what kind of clothes that I like.",
        "I don’t know what a girl likes to wear either, but I don’t think Aki or Miyu-sensei― well, she’s not a girl.",
        "At any rate, I’ve only seen Aki.",
        "Recently, I’ve been looking at Charlotte-san’s and Emma-chan’s clothes, but that’s only a small portion of what they usually wear.",
        "I don’t know much about girls’ clothes, so there’s no way I can tell you what I like.",
        "“Umm, I guess anything that looks good for you?”",
        "I couldn’t see the answer, so I used a convenient escape phrase.",
        "Abstract words like this are really convenient.",
        "But―",
        "“Then, what do you think would suit me?”",
        "When I thought I had escaped with this, Charlotte-san blocked my escape route as if to say she would not let me go.",
        "In fact, I feel like I’ve strangled myself with this one.",
        "“Umm…”",
        "To be honest, I don’t know, and I’d like to call the clerk and leave it to them, but since she’s taking the trouble to ask me, I don’t want to do that.",
        "So I’m going to try to think seriously about what would look good on Charlotte-san.",
        "“I-It’s embarrassing when you stare at me like that…”",
        "As I stared at her, Charlotte-san started to get embarrassed as usual.",
        "If I don’t take my eyes off her, she presses her face against my arm to escape my gaze.",
        "What’s with this cute little creature?",
        "She seems to be very embarrassed to be stared at.",
        "But I wouldn’t know what would look good on her if I didn’t see her.",
        "…Well, I’m not even sure even if I get to look at her.",
        "“In the meantime, why don’t you try on a few different outfits and show them to me?”",
        "It’s better to choose something that you actually like looking at than to imagine it.",
        "This is the reason why I suggested it― But for some reason, Charlotte-san nodded her head while her face turned red."
    ]
}