{
    "id": "chapter-55",
    "title": "Is It Too Late Now?",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "“…Shinonome-san, is there something you like?”",
        "The girls in front of me had started some kind of meeting, and Charlotte-san was silently grabbing the sleeves of my clothes while trying not to let anyone around us know.",
        "The reason I didn’t talk to Charlotte-san was partly because I was worried about the people around me, but mostly because I couldn’t grasp what she was thinking right now.",
        "Besides, Charlotte-san wasn’t paying attention to me, she was looking at the girls with a worried look on her face.",
        "Could it be that she’s worried about being left out?",
        "But I have a feeling that this girl would just go along with the conversation.",
        "“Uh, let’s see……….. stuffed animals…”",
        "As I was thinking, Shinonome-san told me what she liked in a frightened, almost vanishingly small voice.",
        "Surprisingly― actually not.",
        "It’s a very cute girlish hobby.",
        "It’s just that her mental age seems a little young to me.",
        "“What kind of stuffed animals do you like?”",
        "“Eh…?”",
        "When I tried to dig a little deeper to expand the conversation somehow, Shinonome-san looked up at me with a surprised voice.",
        "What in the world is going on?",
        "I can’t see her eyes, so it’s really hard to see her expression.",
        "“You’re making fun of me… aren’t you…?”",
        "“Why?”",
        "“Because… it’s a childish hobby…”",
        "Maybe someone made fun of her before about this?",
        "I don’t know how I’ll respond if it happened to me, but I don’t like it when other people make fun or comments about another person’s hobbies.",
        "I think that if you like something, you should be able to like it without worrying about what others think.",
        "“There are many people in the world who still like stuffed animals even when they are grown up, so I don’t think you need to worry about it. Stuffed animals are cute, after all.”",
        "“A-Aoyagi-kun, do you like stuffed animals too…?”",
        "“That’s right… Yes, I like them too.”",
        "“Yes, I do.",
        "When I nodded, I could tell from the faint sound of her voice that Shinonome-san was pleased.",
        "To be honest, I was just talking to her and I don’t actually own any stuffed animals, but I’m not lying because I think cute stuffed animals are cute.",
        "If you ask me if I like them or not, I’d say I like them.",
        "“How about this…?”",
        "What Ms. Shinonome showed me was an image of a doll with a motif of a little girl.",
        "I’ve seen this character somewhere… Ah, that’s right.",
        "It’s an anime character that I’ve been seeing a lot in commercials lately.",
        "I can see from the image that it is very delicately stitched― but I can’t help but wonder if it’s actually handmade because of how intricate it is.",
        "“Did you make this yourself?”",
        "When I asked about the part I was curious about, Shinonome-san nodded enthusiastically.",
        "She seemed to be somewhat proud of it.",
        "“That’s great, you’re really good at it.”",
        "“Ehehe~…”",
        "When I praised her, she let out a happy laugh.",
        "I’ve never talked to her properly before, but she may be a very expressive and well-spoken girl when it comes to her favorite topic.",
        "She talks at her own pace, though, so I need to slow down my pace a bit.",
        "―*Pull pull.",
        "As I was staring at the happy-looking Shinonome-san, for some reason the sleeve of my clothes was suddenly tugged by Charlotte-san’s hand.",
        "I reflexively turned my gaze to her, and she was staring at my face with a somewhat sad expression.",
        "Maybe she was feeling lonely because she was the only one who couldn’t join a conversation.",
        "I guess I went too far with it…",
        "I don’t want people to know about our relationship, but I didn’t want to make Charlotte-san feel lonely.",
        "Especially today, since it was Charlotte-san’s welcome party.",
        "“Charlotte-san, have you settled into your class yet?”",
        "“Ah― yes…! Everyone is very kind, so I was able to fit in right away…!”",
        "When I spoke to Charlotte-san, she answered with a very happy look in her eyes.",
        "Just how lonely was this girl…?",
        "“―Hey, I’m not sure if this is a new thing, but aren’t Charlotte-san and Aoyagi-kun very close?”",
        "“Or rather, Charlotte-san’s expression seems to be completely conscious of Aoyagi-kun…”",
        "“Eh? When did those two become so close…?”",
        "The girls sitting in front of us were glancing at us and saying something again, but I couldn’t hear what they were saying because it was just the three of them talking to each other as usual.",
        "However, I could tell that they were clearly conscious of us.",
        "If it were true, it would be better to stop talking to her right now so that they wouldn’t notice my relationship with Charlotte-san.",
        "However, right now Charlotte-san was expressing with her whole body that she was happy to talk to me.",
        "I’m not so cunning as to be able to shun a girl like that again, and I don’t have strong determination.",
        "That’s why I decided to talk to Charlotte-san in a natural way, so as not to be misunderstood by the people around me.",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Comments: Another 10-chapter release today! That’s about 27k jp characters translated. I might actually get my first vaccine shot tomorrow so I might slow down a bit on the rate of releases, but I’ll try my best to work on it despite the vaccine’s probable side effects.",
        "Also, we’re now 65% done for my laptop goal in Ko-Fi due to the $30 donation so thanks for the support of my translations. If you have any amount to spare, please do consider donating to me as it serves as a desire for me to keep doing massive chapter releases. I’ll still keep doing my best for you guys to bring out the fastest but readable releases~ <3"
    ]
}