{
    "id": "chapter-33",
    "title": "I Gradually Begin to See Her True Nature",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "“―As expected, Charlotte-san’s homemade food is delicious.”",
        "Charlotte-san made breakfast for me as well, so I took advantage of her kindness and ate her homemade breakfast.",
        "On the dining table, there was white rice and the standard miso soup.",
        "There was also fried spinach, bacon, grilled fish with plum flavor, and egg cheese rolls, which is a kind of cheese wrapped in an omelet.",
        "It was all delicious and I felt like I was getting a lot out of my breakfast.",
        "“Fufu, even if you flatter me like that, you won’t get anything else, okay?”",
        "“No, it’s really delicious. I want to eat it every day.”",
        "“Eh…? That means―”",
        "When I said what I sincerely thought, for some reason Charlotte-san turned her face away from me.",
        "I wonder what happened to her?",
        "It seems to me that her ears turned red, I’m not sure though―",
        "―*Pull pull",
        "As I was staring at Charlotte-san, Emma-chan, who was sitting on my lap, pulled on my clothes.",
        "“What’s wrong?”",
        "“When I’m with Onii-chan, I have lots of food. I want to eat with Onii-chan every day!”",
        "“E-emma! Don’t say something unnecessary!”",
        "Charlotte-san reacted sensitively to Emma-chan’s words without malice.",
        "When Charlotte-san turned her head back towards me, her face was bright red from embarrassment.",
        "From Emma-chan’s words and Charlotte-san’s reaction, it seems that she made such an elaborate breakfast because I was here.",
        "What should I do?",
        "I’m sure Charlotte just put a lot of effort into cooking for others, but it still makes me happy to think it was for me.",
        "“T-that’s not true, you know? It’s not like I’m usually cutting corners, okay?”",
        "“Haha, don’t be so upset, I know what you mean.”",
        "“B-but you’re laughing…! You’re actually making fun of me in your mind, aren’t you…!?”",
        "“Even though I don’t!?”",
        "“Mou~…”",
        "E-ehh…?",
        "I don’t know why Charlotte-san was sulking.",
        "I wasn’t really making fun of her though…",
        "But Charlotte-san with her puffy cheeks and childish look is very cute.",
        "Can I assume that the fact that she is showing me this side of herself means that she’s starting to open up to me?",
        "I’m glad that we’re getting to know each other even though we’ve only known each other for a few days.",
        "“―That reminds me, you have a test coming up soon, don’t you?”",
        "As I was washing the dishes I had finished eating, Charlotte-san, who was also washing next to me, brought up the topic of the test.",
        "By the way, the reason we are washing the dishes together is because I feel bad asking her to do it alone every time, so I force her to let me help her.",
        "“Yeah, that’s right. But since the test is after a long break, the scope of the exam will be from the semester’s scope, and about half of it will be from the summer vacation assignments, so Charlotte-san will be exempted, right?”",
        "As expected, the school would not ask Charlotte-san, who had just arrived in Japan, to take the test.",
        "I don’t know how much she studied in England, but it’s unlikely that the speed and scope of her classes are exactly the same as ours.",
        "She will probably take the test in the midterm.",
        "“Yes, I was exempted this time around. Oh, by the way, I heard from Hanazawa-sensei that Aoyagi-kun is the best student in the school, right? I have to do my best to not lose to you, Aoyagi-kun.”",
        "The best in the school?",
        "It is true that in the school year, if you only look at the test results, I have the highest results, but what did Miyu-sensei mean when she said that I am the best in the school…?",
        "Maybe she’s referring to the results of the National Assessment Test, but don’t take the liberty of calling me the best in the school…",
        "I’ll tell that to Miyu-sensei in a roundabout way some other time, but Charlotte-san seems to have a very confident attitude about her studies.",
        "She’s fluent in Japanese and knows it very well, and judging from her usual demeanor, she’s definitely the type who can study.",
        "Maybe Charlotte-san will be the biggest obstacle to my goal…",
        "Well, even if that happens, in the end I’ll just have to do my best.",
        "I don’t want to be one of those people who sometimes try to kick others down to get to the top.",
        "There is nothing for me to gain from someone else’s downfall, and if I kicked them down every time they came up, I would never get anywhere.",
        "So I’m not going to make that mistake.",
        "“I will also do my best not to lose against you, Charlotte-san… As soon as the test is over, the sports festival will be waiting for us, and we will be busy for a while…”",
        "“T-there’s a sports festival…?”",
        "Hmm?",
        "What’s going on?",
        "I just casually brought up the topic of the sports festival, but Charlotte-san froze as she looked at me.",
        "“Erm, what’s wrong?”",
        "“N-no, it’s nothing! …I see that Japan, unlike the UK, puts a lot of effort into exercise… Moreover, it’s also a staple in manga…”",
        "Charlotte-san said it was nothing, but no matter how you look at it, there’s clearly something going on.",
        "I couldn’t make out the latter part of her mumbling, but I wondered if she’s bad at sports?",
        "I was curious and tried to step in a little bit, but―",
        "“―Onii-chan, do you want to play?”",
        "I missed the chance to ask her as Emma-chan clung to my leg in her spare time.",
        "―By the way, Emma and I played together until the very last minute before we left for school."
    ]
}
