{
    "id": "chapter-35",
    "title": "I-It's a Secret...!",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "―What should I do…?",
        "What am I supposed to do…?",
        "It was late in the evening and I was feeling confused.",
        "The reason for this was the pretty girl sitting next to me, almost shoulder to shoulder.",
        "The pretty girl was staring at my face, not paying attention to the manga at hand.",
        "But when I looked at her, she quickly turned her face away.",
        "So I tried to turn my attention back to the manga, but she was staring at me again.",
        "It’s been like this ever since Emma-chan fell asleep.",
        "Honestly, there was no way I could concentrate on the manga if she kept acting like this.",
        "But it’s hard to talk to her when she turns her head away.",
        "So, what am I supposed to do in this situation?",
        "If Charlotte-san is behaving like this, does that mean she’s scared of me because of what happened today?",
        "But then she wouldn’t have asked me to read manga with her.",
        "The same thoughts have been running through my head for a while now, and I feel like I’m lost in a labyrinth with no answers.",
        "At any rate, there’s no way out of this.",
        "I should make up my mind and call out to her.",
        "Thinking that this silent exchange would go on and on until Charlotte-san went home, I decided to break the situation.",
        "Even if it goes in the wrong direction, it might be better than this awkward atmosphere.",
        "“Hey Charlotte-san, do you have a minute?",
        "“Y-yes!? W-what is it!?”",
        "When I saw her reaction when I called out to her, four Kanji characters popped into my head― suspicious behavior.",
        "She glanced up at my face and never made eye contact with me.",
        "It’s settled.",
        "This is― she’s definitely frightened of me!",
        "“It’s umm, I’m sorry about that.”",
        "“Eh? What? W-why are you apologizing?”",
        "I apologized, and Charlotte-san looked at me as if she was surprised.",
        "Our eyes met for the first time ever since this morning.",
        "I think I’m a very simple man to be happy just because our eyes met.",
        "But for now, I should apologize to her properly.",
        "“I know I showed you a frightening scene at lunchtime earlier today. I’m really sorry if I scared you because of that.”",
        "“…………”",
        "I turned my body properly to Charlotte-san and bowed deeply to her, and she fell silent.",
        "I can’t see her face, but I know from the atmosphere I feel that she is staring at me.",
        "I don’t know what she’s thinking right now.",
        "But I wanted her to know that I was not someone who would harm her.",
        "“Tei!”",
        "“―Ack!”",
        "As I waited for her to reply, I suddenly received a cute voice and a weak slap on the head.",
        "I couldn’t hide my confusion at the sudden event and stared at Charlotte-san’s face.",
        "For some reason, Charlotte-san’s cheeks had turned red, and she was puffing out her cheeks in a cute way.",
        "The look on her face makes me even more confused.",
        "Why is she sulking?",
        "“Cha-Charlotte-san?”",
        "“Aoyagi-kun is misunderstanding something here…! I’m not afraid of you, Aoyagi-kun…!”",
        "“Eh? I-is that so?”",
        "“That’s to be expected, you know…! Why am I supposed to be afraid of the one who saved me…!?”",
        "“But then why do you turn your face away to avoid eye contact with me?”",
        "If she’s not afraid, I don’t understand why she’s avoiding eye contact.",
        "“That’s because―”",
        "When I asked the question, Charlotte-san turned away again.",
        "And then, just like before, she glanced at me and looked at my face.",
        "Is she trying to say something she’s not comfortable saying?",
        "I’m not sure, but no matter how I look at it, it looks like she’s scared.",
        "That’s what I thought when I saw Charlotte-san’s condition, but I decided to wait for her to say something anyway.",
        "However―",
        "“I-it’s a secret…!”",
        "I felt like I was fooled when she turned her head away from me with a pout.",
        "I thought, “Why are you deceiving me…?” but Charlotte-san’s sulky look was too cute to pursue the matter any further."
    ]
}
