{
    "id": "chapter-49",
    "title": "Unforgivable Thing",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "Thanks to Sasagawa-sensei’s sacrifice (in which she deserved), we were able to get rid of Miyu-sensei and the others, and we were slowly looking around at the animals.",
        "Emma-chan in particular, who had been in a bad mood earlier, was now in a very good mood.",
        "Do you know why?",
        "―It was here.",
        "There were cats in this zoo.",
        "And you can even touch them.",
        "I thought it was hopeless, so I was grateful for this miracle.",
        "Thanks to this, Emma-chan was smiling and playing with the cats.",
        "“Onii-chan, Onii-chan! This cat is so cute…!”",
        "Emma-chan, who was stroking the kitten’s head with her tiny hands, smiled and spoke to me in a very cute way.",
        "The kitten also rubbed its head on its own, as if it felt good to be petted by Emma-chan.",
        "“Yeah.”",
        "I replied shortly, and decided to watch Emma-chan’s behavior.",
        "The kitten was cute, but to be honest, Emma-chan was even cuter when she was delirious with the kitten.",
        "Speaking of which, could it be that Emma-chan is wearing cat ears because she wanted to play with cats?",
        "As a young child, she might have thought that if she wore the cat ears, she could become one of the cats.",
        "Children are so pure, not without “it”.",
        "“―Meow~?”",
        "“Meow~!”",
        "“Meow~?”",
        "“Meow~! Meow~!”",
        "……….Eh?",
        "I froze in my tracks when I suddenly heard someone speaking like a cat and looked over.",
        "There was Charlotte-san conversing in cat-speak with a cat that was rubbing up against my feet.",
        "She was still hugging my arm, tilting her head and meowing.",
        "The cat was also purring loudly in response to Charlotte-san’s words.",
        "What should I do?",
        "It’s so cute, but what is this girl doing?",
        "I can understand if it’s Emma-chan, but I’m really confused if it’s Charlotte-san.",
        "“Charlotte-san…?”",
        "“Cats are really cute, aren’t they? I want to take one home with me.”",
        "Charlotte-san didn’t seem to notice my confusion, but she didn’t take her eyes off the cat.",
        "Apparently, she is not embarrassed to be seen talking like a cat.",
        "……….Well, I guess it’s fine because she’s cute.",
        "Charlotte-san was so cute that I stopped thinking about it and decided to stare at the cat at my feet, just like she did.",
        "Then the cat opened its mouth wide as if to yawn and then stared into my eyes.",
        "What is it?",
        "Does it have something to say?",
        "“Doesn’t the cat want you to pet it?”",
        "“No. If it did, it would rub its head against my leg…”",
        "If anything, I think it’s more like a flying cancer.",
        "I quickly turned away from the cat.",
        "I learned in a book once that cats will look away when they are not hostile, but will stare at you when they are alarmed or fighting.",
        "Well, this is not an absolute fact either.",
        "If they are close to each other like their owners, it could be an appeal for food or something.",
        "But of course I wasn’t the owner of this cat, much less close to it.",
        "That’s why it must have been wary of me.",
        "It doesn’t make sense that a cat that is supposed to be used to people would be wary of me, though.",
        "Maybe it didn’t like me being hugged by Charlotte-san?",
        "No way…",
        "I couldn’t believe that a mere cat would have such thoughts, and I quickly stopped thinking about it.",
        "“Aoyagi-kun?”",
        "“Hmm?”",
        "“Why did you turn your gaze away from the cat just now?”",
        "Perhaps she was staring at my face, but Charlotte-san seemed to be concerned that I had taken my gaze off the cat.",
        "“It’s because it’s polite to avert your gaze when a cat stares at you. Basically, cats don’t look at each other, even if they are from the same species. It’s because they don’t want to get into unnecessary fights.”",
        "“Hee~, you’re very knowledgeable, Aoyagi-kun.”",
        "“No, I don’t want to be called knowledgeable because of my knowledge of cats…”",
        "I replied with a wry smile to Charlotte-san, who looked at me with admiration.",
        "I’m sure Charlotte-san understood the meaning of the word “knowledgeable” and was just using it as a figure of speech, but it’s not good to be taken as an exaggeration.",
        "However, I was honestly happy that Charlotte-san was impressed with my knowledge.",
        "It’s always nice to be recognized by someone you care about.",
        "“Aoyagi-kun also likes cats, right?”",
        "“I think so. It’s probably my favorite animal.”",
        "“I like cats best, too. We have the same taste, don’t we?”",
        "Charlotte-san’s cheeks relaxed, as if she was happy that we liked the same animals.",
        "As for me, I’m glad that she and I like the same things.",
        "I guess everyone is happy when they share the same tastes as someone they are conscious of.",
        "But in Charlotte-san’s case, I think she’s just happy to have the same taste as her friend.",
        "“Meow~!”",
        "As I nodded at Charlotte-san’s words, a cat rubbed up against my leg.",
        "The cat rubbed its head against my leg and started to purr.",
        "I reached out and stroked the cat’s head, and it purred and squinted at me.",
        "It then rubbed against me even more.",
        "If it’s this cat―",
        "To test it out, I wrapped my right hand around the cat’s buttocks and hind legs, and put my left hand on its stomach.",
        "When I was sure the cat didn’t mind, I picked it up as if it was sitting on my right arm.",
        "“Eh? The cat didn’t run away when you held it?”",
        "“There are a lot of cats that don’t like it, but some of them don’t seem to mind being pampered like this. There are some tips on how to hug them, and I’ve been following them, so I guess this cat doesn’t mind.",
        "“I see…”",
        "Charlotte-san gazed enviously at the cat in my arms.",
        "Maybe she wants to try to hold it too.",
        "I’m not sure if she’ll be able to hold it well, so she’s probably just checking it out.",
        "―*Pull pull.",
        "Hmm…?",
        "While I was distracted by Charlotte-san and the cat, someone tugged on the sleeve of my clothes.",
        "I looked over and saw Emma-chan standing there with her cheeks puffed out for some reason.",
        "“Emma-chan? Why are your cheeks puffed out?”",
        "Emma-chan had been in a good mood just now, but now she seemed to be sulking, so I asked her why.",
        "Then she looked at me with her cheeks puffed out and her arms outstretched.",
        "And then―",
        "“Hug.”",
        "It was as if she was asking me to hold her instead of the cat."
    ]
}