{
    "id": "chapter-58",
    "title": "The Little Girl Who Likes to be Pampered",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "After parting ways with Akira, I was commuting on my way home alone.",
        "Perhaps it’s because I’ve been in a busy environment lately, but I feel lonely walking alone.",
        "In such a situation, if I say that I miss Emma-chan, I’ll probably be recognized as a lolicon.",
        "Of course, I’m not going to say anything about it.",
        "―Hmm?",
        "Suddenly, I heard a notification sound from the phone in my pocket.",
        "Since it’s not a good idea to walk on the road with a phone on hand, I move to the corner of the road and take out my phone.",
        "Thinking that Aki had contacted me, I opened the chat app and found that the person who had sent me the message was Shinonome-san.",
        "It seems that she sent a message immediately.",
        "“Neko-chan (*´▽｀*)”",
        "Along with that message was a picture of a stuffed animal with a white cat motif.",
        "It was probably something she had made herself again.",
        "It was very cute, and it looked like it could have been sold in a store.",
        "Or rather, Shinonome-san is a fan of using emoticons huh.",
        "“It’s cute, another homemade one?”",
        "I figured she was probably waiting for a response, so I sent her a message right away.",
        "The message came back in a few seconds.",
        "Aren’t you replying too fast…?",
        "The image of Shinonome-san’s face in front of my phone, waiting for my reply, came to my mind, and I felt both smiling and heartbroken at the same time.",
        "I’m sure she’s never even used a chat app with her friends before.",
        "I checked the contents―",
        "“I did my best on this one.(｀・ω・´)”",
        "―She had a smug emoji along with it.",
        "What should I do?",
        "I thought it was a little cute the way Shinonome-san sent it to me.",
        "She’s like this when she’s chatting.",
        "“Okaa-san~, there’s a creepy smirking Onii-chan over there~” [TLN: Okaa-san is Mother btw]",
        "“Shh― don’t look!”",
        "…A little girl pointed her finger at me as we passed each other, and then she said something sad.",
        "This kind of thing is Akira’s role, but it’s kind of hard being treated that way too…",
        "I stopped looking at my phone and decided to walk back home.",
        "―After a short walk, I saw a familiar girl walking with a little girl in her arms.",
        "The one who is holding the little girl so carefully is Charlotte-san, whom I left a few hours ago.",
        "The moment I saw her face, I remembered Akira’s words from earlier.",
        "The words that Charlotte-san likes me.",
        "My body instantly became hot.",
        "I’ve been able to talk to her again recently, but I don’t think I’ll be able to talk to her properly if I continue like this.",
        "I thought of something else and somehow managed to clear my head.",
        "“Ah― Aoyagi-kun! What a strange coincidence to meet you here!”",
        "As I managed to forget the words that had just popped into my head, Charlotte-san spoke to me.",
        "If you look at her, you’ll see that she has a very happy expression on her face, and that she’s really happy to see me.",
        "“Erm, yes―”",
        "“…..? ―Ah! Ngh…!”",
        "When I tried to agree with Charlotte-san’s words, Emma-chan, who had been staring at Charlotte-san’s face curiously, looked back at me.",
        "When she noticed my presence, she stretched her arms out to me.",
        "“Emma, be careful! ―Ah, no!”",
        "“Woops…”",
        "Emma-chan stretched her upper body, Charlotte-san lost her balance, but I managed to hold them both.",
        "“”Ah…””",
        "The fact that I held her in my arms meant that we were hugging each other, of course, and Charlotte-san’s face was very close to mine.",
        "If I moved my face a little, I could have kissed her.",
        "The suddenness of the situation caused us to look into each other’s eyes.",
        "Charlotte-san’s face is bright red, and I’m sure mine is as well.",
        "After all, my face felt really hot.",
        "“Ngh…! Muu…!”",
        "Then, Emma-chan, who was sandwiched between us, made a painful sound and started to flail.",
        "“I-I’m sorry, Emma-chan!”",
        "“I’m sorry, Emma!”",
        "With the two of us crushing the little one, we panicked and tried to keep our distance.",
        "But Emma-chan had a firm grip on my clothes, and I couldn’t pull away.",
        "“Come here, Emma-chan.”",
        "I knew I couldn’t stay attached to her, and I knew she wanted to come at me, so I extended my arms to her.",
        "Emma-chan seemed to be happy to have my arm to pick her up as she wished, and attached herself to my body.",
        "This girl really likes to be pampered.",
        "That’s what’s so cute about her.",
        "“I feel like I’m becoming a convenient woman for Emma…”",
        "As I stroked the head of Emma-chan, who was pampered in my arms, Charlotte-san, who was staring at me forlornly, muttered quietly.",
        "I’m not sure if it’s because of the wind, but I could hear her voice now.",
        "I guess she was shocked that she had carried Emma-chan all the way here, but once Emma-chan found me, she left her hands.",
        "The fact that she mumbled in Japanese might have been her concern for Emma-chan.",
        "…I’m sorry, Charlotte-san.",
        "I couldn’t think of any follow-up words for a moment.",
        "Thinking back on the recent past, it is obvious that Emma-chan is showing an attitude of longing towards me, so there is no way to follow up with words.",
        "……*Glance",
        "“Hmm..?”",
        "*Glance… *Glance…",
        "I was staring at Charlotte-san, wondering what to do, and for some reason she started glancing up at me as if to see how I was doing.",
        "I feel like she’s getting closer and closer to me.",
        "“……….Tei!”",
        "“―Huh!?”",
        "Then, I wondered what she was thinking. Charlotte-san, who was slowly approaching me, picked up the sleeve of my clothes with her fingers, as if she had made a daring move.",
        "I wondered what had happened to Charlotte-san, just like at the coffee shop.",
        "“Ah, erm, are we going home like this…?”",
        "―*Nod",
        "When I asked, Charlotte-san gave a small nod.",
        "Seriously now…",
        "The apartment where we live is almost there, or rather, right in front of us, but if she acts like this outside, my embarrassment overcomes me.",
        "However, I also felt happy.",
        "This is a natural reaction after being attached to a beautiful girl like Charlotte-san.",
        "―We walked into the apartment building with a mixture of embarrassment and joy in our hearts.",
        "…Incidentally, the people who passed us in the apartment gave us a warm look.",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Comments: AAAAAAARGHHHHHHH JUST BECOME A COUPLE AT THIS POINT REEEEEEEEEEEEEEEEEEEEEE"
    ]
}