{
    "id": "chapter-118",
    "title": "An important Promise",
    "content": [
        "Translator: AJ1703",
        "(**Akihito’s POV**)",
        "“―I’ll let Emma keep on sleeping. If we wake her up, we won’t be able to talk.”",
        "In Kanon-san’s bed, Emma was sleeping comfortably.",
        "Charlotte-san’s mother was right; if Emma woke up, we would have to deal with her, so it would be better to let her sleep for now.",
        "She was also sleeping so comfortably, it would be a pity to wake her up.",
        "“Now then, where should I start?”",
        "“I have so many questions I want to ask you but…”",
        "Charlotte-san looks at her mother, who is thinking with her hand on her chin, as if she has something to say.",
        "I think this is the first time I’ve heard her speak Japanese with a straight face, and I rarely see this kind of expression on her face.",
        "I guess it’s different when it’s family.",
        "“I think it would be faster if I told the story in chronological order. As Lottie has probably noticed by now, I met Akhito-kun when he was very young. For a time, I treated him like a real son, spending time with him every day.”",
        "Charlotte-san hears this and gives me a sultry look.",
        "For some reason, she appears to be jealous.",
        "…Hmm, I wonder why?",
        "“We met when we were little, so you have nothing to be jealous of or anything like that, you know…?”",
        "For now, I made a follow-up statement.",
        "“That’s true, but… I don’t know Akhito-kun’s childhood, but Mom does…”",
        "Apparently, she doesn’t like the fact that her mother knows about it when she doesn’t.",
        "Really, this girl is…",
        "“Lottie is really possessive, isn’t she?”",
        "“―!?”",
        "When Charlotte-san’s mother said what I thought, Charlotte-san’s face instantly turned red.",
        "It seems I was right on the mark.",
        "“B-But, everyone would like to know about their lover’s childhood…!”",
        "“In Lottie’s case, you’re jealous, aren’t you? It’s not just a desire to know.”",
        "“Mou~, why do you have to be such a tease…!”",
        "It is refreshing to see Charlotte-san like this.",
        "I feel bad for her, but it’s kind of fun to watch.",
        "My girlfriend is too cute after all.",
        "“I don’t mean to tease you, but… If you make too much noise, Emma will wake up and get upset.”",
        "“Ah…”",
        "Charlotte-san shrank back in embarrassment when this was pointed out to her.",
        "I think she might have thought she showed me something that was unseemly.",
        "“I’m glad you guys seem to be getting along.”",
        "“Uuu… I’m so embarrassed…”",
        "Charlotte-san said and reached out the sleeve of my clothes.",
        "Her face was downcast and even her ears were red.",
        "“It seems like you two are the ones who get along.”",
        "Charlotte-san’s mother, who was watching us, smiled kindly.",
        "She has not changed, and I guess she is still the same kind person she was a long time ago.",
        "“Well, back to the story, Akihito-kun, can I tell you about the promise?”",
        "“The promise…?”",
        "Charlotte-san looked at me curiously.",
        "It was already mentioned earlier, but maybe she didn’t pay much attention to it.",
        "“Sure, no problem.”",
        "“Thank you.”",
        "Charlotte-san’s mother thanked me and looked at Charlotte-san.",
        "“As I said before, I thought of Akihito-kun as my real son. This was because he was the same age as Lottie. But― I left my family in England, and I couldn’t stay in Japan, so I couldn’t take Akihito-kun in. So just before I left Japan, I promised Akihito-kun that when he was older, I would come and take him as a family member.”",
        "―That was the most important promise Onee-san had ever made to me.",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Afterword: Someone said some good things so here’s another chapter for you guys to read. The latest chapter is 125 as of writing and uploading this chapter. I’ll probably not be able to post more chapters since it’s weekdays and I have university so I’ll try again during the weekends. Also help, college is expensive asf for a 3rd world country dweller like me. Any amount will do and I’ll try to release more chapters as much as I can."
    ]
}