{
    "id": "chapter-56",
    "title": "My First Friends",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "“Well then, we should call it a day!”",
        "About two hours after we arrived at this cafe, Akira announced to everyone that the party was over.",
        "Aside from the all-you-can-drink beverages, everyone had ordered their own food, so each table had to pay for their order",
        "“It would be a nuisance if we took it all at once, so let’s pay for our table one at a time.”",
        "“Yes, I think that would be best.”",
        "Charlotte-san agreed as soon as I called out to her.",
        "………..In the end, this girl didn’t let go of my sleeve until the welcome party was over…",
        "“Yes, yes, it’s Aoyagi-kun’s treat, right?”",
        "As I looked at Charlotte-san, the girl sitting in front of me raised her hand and said in a roundabout way, “You’re treating us.”",
        "“Give me a break. I can’t handle this many people.”",
        "“Yes. Then buy me a drink the next time it’s just the two of us. If you want, let’s go to karaoke together afterwards.”",
        "Surprisingly, she listened to me honestly and somehow invited me to hang out with her.",
        "“Wait, a minute! Then I want to go out with you guys too!”",
        "“Me too!”",
        "Before I could even open my mouth, the girls on either side hurriedly raised their hands and started insisting that they were going too.",
        "What on earth is happening here?",
        "Did they really not have enough fun just now?",
        "“Eh~, I’d rather hang out with just the two of us, though?”",
        "“That’s not fair!”",
        "“That’s right!”",
        "While I was puzzled, the girls started to argue.",
        "I don’t really have any plans today, so I don’t mind going out, but the thought of going out with girls I don’t know very well makes me a little nervous.",
        "Should I invite Akira to join us?",
        "“―M-me too…! Ah, but I still need to pick up Emma… If I leave her alone with strangers for too long, she’ll cry…”",
        "As I was thinking about asking Akira out, Charlotte-san, who was standing right beside me, was looking at us as if she wanted to join us.",
        "However, it seems that it’s time to pick up Emma, and I’m going to struggle with this alone.",
        "She’s a high school student like me, and I’m sure she still wants to have fun.",
        "I don’t think Charlotte-san is reluctant to take care of her little sister, but that doesn’t mean she doesn’t feel the need to go out and play.",
        "I felt a little sorry for Charlotte-san.",
        "It would not be a good idea to leave her out of the group, especially in this situation.",
        "Hmm…",
        "“I’m sorry, but I have a part-time job later. So I can’t go out with you guys.”",
        "I thought about how I could say no without getting in trouble, so I used my part-time job as an excuse.",
        "The truth is that I’m not working as a tutor today, but there’s no way they can confirm the truth.",
        "“Hee~, Aoyagi-kun, you have a part-time job? What is it all about?”",
        "I was expecting this to be the end of the conversation, but for some reason they were interested in my part-time job as well.",
        "Really, they’re being weirdly aggressive today…",
        "“―Now, now, sorry to interrupt your excitement, but this is the only table left. Can I ask you guys to pay the bill quickly?”",
        "It was obvious that explaining about my tutoring part-time job would be a hassle, so I was hoping to cover it up somehow, and Akira stepped in at the right time.",
        "Thanks to him, the girls’ attention turned from my part-time job to the bill.",
        "Everyone hurriedly took out their wallets and paid for the food they had eaten.",
        "I took it to the cashier as their representative.",
        "For some reason, Akira followed me.",
        "“What’s up?”",
        "“…..It’s nothing, can we talk after this? Considering Akito, you don’t have a part-time job today, do you?”",
        "It’s probably because we’ve known each other for a long time, so Akira knew that I was lying when I said that earlier.",
        "Maybe it was the fact that he knew I was having trouble answering that made him come in and help me out.",
        "…But what bothers me more is the fact that he went out of his way to preface it with the fact that he wanted to talk to me.",
        "It’s not uncommon for Akira and I to preface our conversations with something like that.",
        "It’s only when we have something important to talk about.",
        "Akira was suspicious of me to begin with, and the fact that I was talking to Charlotte-san today may have convinced him…",
        "I think I should be a little more prepared.",
        "―After that, I quickly paid the bill and thanked the manager for what they had done today.",
        "The manager was a very kind and nice person, and she didn’t get angry at all about our noise, and asked us to come back.",
        "It’s hard to believe that such a respectable adult is a friend of Miyu-sensei’s.",
        "“Aoyagi-kun…”",
        "When I returned to the table to get my luggage, Charlotte-san, who had a troubled expression on her face, called my name.",
        "I wondered if there was some kind of trouble.",
        "“What’s wrong?”",
        "“Erm… are you sure you don’t wanna go with them…? You don’t actually have any plans later today, do you…? I’m sure you’ve turned them down out of concern for me―”",
        "I held up a small index finger in front of my nose to Charlotte, who spoke apologetically.",
        "I made sure that no one else could see it and signaled to Charlotte-san not to say anything more.",
        "Then I shook my head with a smile.",
        "“Don’t worry about it. It’s my own decision, not Charlotte-san’s.”",
        "I had originally told her that I was keeping my schedule open, so she knew that I was lying about the part-time job.",
        "And she was smart and perceptive enough to know why I had turned it down.",
        "But in the end, it was me who made the decision, and I didn’t even consult Charlotte-san.",
        "It’s a bit arrogant to say that I stopped going out with her because of her.",
        "“Aoyagi-kun…”",
        "When Charlotte-san heard my words, she looked up at my face with a troubled― but also a happy expression.",
        "I got to the point where I was embarrassed when a cute girl like her looked up at me.",
        "So I tried to look away, but―",
        "“You guys are really close, huh…”",
        "“”―Ah!?””",
        "Suddenly, a voice called out from behind me, startling me.",
        "I hurriedly turned around to see Shinonome-san looking up at me right beside me.",
        "And when I saw her face, I was surprised again in a different way.",
        "Perhaps it’s because there’s more of a height difference between us while we’re standing than when we’re sitting earlier, but I can see her eyes, which had been shrouded in a veil.",
        "But now’s not the time to be surprised by Shinonome-san’s face, there was something I needed to check right away.",
        "“Shi-Shinonome-san? How long have you been there?”",
        "“Hmm…? I’ve been here for a while now though…?”",
        "“Oh, that’s right…”",
        "Apparently, she didn’t come up behind me later, she was just behind me and I didn’t notice.",
        "I’m sorry about that, even though we’re not in the shadows.",
        "But then, how much did she hear?",
        "In some cases, I’ll have to keep my mouth shut…",
        "“Are you two… good friends…?”",
        "Shinonome-san asked me while looking at me and Charlotte-san’s faces alternately, as if she didn’t care that we hadn’t noticed her presence.",
        "It’s not that she’s accusing us of anything, it’s just that she’s curious.",
        "But with this kind of interest, I wondered if she was listening to us.",
        "“Well, we’re classmates.”",
        "“…Because we’re classmates… you were being grabbed on… the sleeves of your clothes…?”",
        "Shinonome-san genuinely asks, tilting her head.",
        "She seemed to have noticed that Charlotte-san was holding onto the sleeve of my clothes earlier.",
        "It’s not surprising, since she’s sitting next to me… I guess she found us.",
        "Fortunately, the one who noticed it was Shinonome-san, who doesn’t seem to talk much to others, and even now her voice is so low that no one but Charlotte-san and I could hear her.",
        "If it was just her, it wouldn’t be too difficult to keep her quiet.",
        "In the meantime, I turned my gaze to Charlotte-san to confirm that she was indeed embarrassed to be seen in her childish state, and she turned her head down while her ears turned red.",
        "It’s best not to touch this.",
        "“Ah… umm… can you please not tell anyone else…?”",
        "I decided to leave the embarrassed Charlotte alone, and asked Shinonome-san to keep it a secret from others.",
        "I think it’s definitely better to be honest with her.",
        "We had been in the same class for half a year, so I knew she was a kind-hearted girl even without talking to her.",
        "“This…”",
        "Hearing my words, Shinonome-san somehow held out her phone to me.",
        "Don’t tell me you’ve been taking… pictures and are going to use them as a threat against us…?",
        "“I’d like to exchange… contact information… also with Bennett-san.”",
        "……….I’m very sorry that I doubted her for a moment.",
        "It seems that she just wanted to exchange contact information.",
        "Normally, she’s not able to talk well with others due to her quick temper.",
        "But for some reason, she was able to talk to me a little better now, so I guess she wanted to exchange contact information.",
        "Charlotte-san and I took out our phones and gave our IDs on the chat app to Shinonome-san.",
        "“Ehehe~… my first friends…”",
        "Shinonome-san smiled happily, but what she said made my heart ache.",
        "Charlotte-san must have felt the same way as I did, because she looked at Shinonome-san with tears in her eyes.",
        "―The two of us made a vow to try to talk more with Shinonome-san from now on.",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Comments: I suddenly felt the desire to protecc Shinonome-san. She’s both precious and sad to look on at the same time."
    ]
}