{
    "id": "chapter-62",
    "title": "Reversal",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Charlotte’s POV**)",
        "“Miyu-sensei, how will we decide on the pairs?”",
        "Looking very happy, Saionji-kun raised his hand and asked the question that everyone was wondering on how to decide on a pair.",
        "If you say that you can pair up with whoever you want, then I’m stuck.",
        "The reason is that I have promised to keep my distance from Aoyagi-kun at school.",
        "If I were to break my promise and ask him to be my partner, it would be an irreversible mistake if he didn’t want to be my partner.",
        "More importantly, my choice of Aoyagi-kun might lead to him being harmed by other boys.",
        "In case you’re wondering, I understand what he thinks of me from his reactions…",
        "If he ends up getting squeezed by other boys like the protagonist of a romantic comedy manga, I’ll be too sorry to look at Aoyagi-kun’s face.",
        "In order to avoid such a situation, I hope you will choose another way…",
        "“This is a game that does not involve scoring, so the pairings are decided by lottery. If you pair up with someone you like, you’ll only have problems. Pairs with a large height difference are allowed to put their hands around their partner’s waist.”",
        "“What’s the point of playing… if it’s an event that doesn’t score points?”",
        "“I don’t know. Apparently, this all started because of the old principal’s incomprehensible reasoning that it would be good if even one pair of men and women could get along through this. I was the only one who was paired with a girl for three years because there were two more girls in the class when I was there. Really, you’ve got to be kidding me…”",
        "I guess I was too shocked, but I could see the dark past of  Hanazawa-sensei.",
        "My classmates were nodding their heads as if they were convinced of something.",
        "“All those who just nodded, I remembered them all, so you can stay behind after this.” [TLN: F to them lmfao]",
        "“””””Ehhhhhhhhhhhhh!?”””””",
        "In an instant, the class was enveloped in a scream as Hanazawa-sensei grasped the situation of the class with her words.",
        "…I’m not sure if there are any complaints from the neighboring classes, etc…",
        "I was curious to see if Aoyagi-kun was nodding, so I looked at him.",
        "He was looking at the face of Saionji-kun in the back seat with a bitter smile that seemed to say, “It can’t be helped.”",
        "I think it’s wonderful when he smiles so bitterly, is it because I’m that much in love with him?",
        "But I don’t feel bad at all.",
        "In fact, I feel very happy.",
        "“Ah―”",
        "As I was staring at Aoyagi-kun, he noticed my gaze and looked at me.",
        "I was so happy that I hid my hand and gave a small wave so that only Aoyagi-kun could see it.",
        "Then he did the same and waved back.",
        "However, is he embarrassed to do this in class?",
        "His cheeks seem to be reddening a little.",
        "His embarrassed face is so cute.",
        "He waved his hand back at me, so I’ll forget about what happened earlier.",
        "“Now, let’s quickly decide on the pairs. We’ve got separate boxes for the men and women, so whoever gets the same number will be the pair. I’ll ask you who’s which number after we’ve all drawn. The order in which we draw the lots is based on attendance numbers, okay?",
        "It seems that Hanazawa-sensei has decided to draw the lottery in the order of attendance numbers.",
        "The first one to draw the lottery― was Aoyagi-kun.",
        "I wondered what number he would draw…?",
        "I stared at Aoyagi-kun.",
        "He got up from his seat and walked naturally to Hanazawa-sensei without any sign of nervousness.",
        "Is it possible that he thinks it doesn’t matter who he is paired with…?",
        "That’s a little shocking…",
        "“All right, come on, next one.”",
        "Aoyagi-kun drew the lottery and sat down in his seat as if nothing had happened.",
        "Unfortunately, the number was not visible.",
        "―But I was not ready to give up yet.",
        "This time, instead of focusing on his gestures, I listened to his voice.",
        "“What number did you get?”",
        "“Number eight.”",
        "What I heard was Saionji-kun’s voice asking for the number, and Aoyagi-kun’s voice answering his question.",
        "The conversation was hushed so that no one around me could hear it, but I, who have much better hearing than most people, was able to hear his number clearly.",
        "It’s a little bit of a bummer that I’m quite sensitive instead of having good hearing… but my good hearing helps me a lot in these situations.",
        "Anyway, that’s number eight…!",
        "“―Okay, Charlotte’s next.”",
        "“Yes.”",
        "I stood up from my seat, nervous as my name was called.",
        "There are forty people in the class.",
        "With a 50/50 split between men and women, the odds of getting number eight are one in twenty.",
        "I can’t help it if I don’t get it, but… I definitely want to get number eight…!",
        "As I stand in front of the box to draw the lottery, I pray to God once again.",
        "I stood in front of the box and prayed to God once again, and drew―――― number seven.",
        "God is so mean…",
        "◆",
        "(**Aoyagi’s POV**)",
        "“I wonder what number you drew, Charlotte-san?”",
        "Akira approached me because Charlotte-san, who drew the lottery, was acting depressed in her seat.",
        "Really, what the heck number did you draw…?",
        "I don’t think she knows who drew what number, so maybe she drew the number 13, the most unlucky number in the West?",
        "If that’s the case, then you’re in a different pair than me…",
        "To be honest, when the lottery was drawn, I was expecting to be paired with Charlotte-san, but I guess that’s just luck.",
        "“I don’t know… Speaking of which, what number did Akira draw?”",
        "I had given him my number when we drew the lottery, but I hadn’t heard from him.",
        "“Hmm? It’s the Lucky Seven. It’s going to be good.”",
        "Akira smiles and shows me the number.",
        "He’s trying to keep his voice low so the others can’t hear, probably because he wants to know who his partner is when he announces it.",
        "Lucky Seven huh…",
        "It sounds like a really good number.",
        "“―Okay, you’ve all drawn. I’m going to call out the numbers of the boys and girls in turn, starting with the winner of the rock-paper-scissors game, and whoever gets their number called should raise their hand at that time.”",
        "It would have been fine if the boys had announced first, but on a whim, Miyu-sensei decided to use rock-paper-scissors to decide even the order of announcement.",
        "It was up to me, who was number one, and the girl, who was number two, to play rock-paper-scissors.",
        "As a result, I lost the rock-paper-scissors game, so the odd-numbered students were chosen by the girls, and the even-numbered students were chosen by the boys.",
        "After that, the numbers were announced as needed, but when the number seven girl was announced, the boys in the class let out a cry of shock and all fell down on their desks.",
        "It must have been because their hopes were dashed.",
        "The girl’s number seven was Charlotte-san, the popular girl.",
        "In other words, her pair drew the same number seven.",
        "It really was a lucky seven, wasn’t it?",
        "Or is this fate?",
        "I don’t believe in fate, but it’s too much of a coincidence.",
        "“Hey, who the hell is number seven? Come on, raise your hand.”",
        "As I was thinking that it was my turn next, Miyu-sensei raised her voice as if she had lost her nerve.",
        "The woman’s number seven has been announced, but the man’s number seven has not appeared.",
        "“Hey, Akira―”",
        "“Miyu-sensei! The number seven is Akito! He’s hesitating because he doesn’t want to incur the wrath of the boys!”",
        "What in the world is he thinking?",
        "Although Akira should be the one who drew the number seven on the boys’ side, Akira said that I was the number seven.",
        "“Wh-what are you…?”",
        "“Hmm? I don’t believe that Aoyagi would ever think such a thing but―― it’s true. Aoyagi is number seven.”",
        "Miyu-sensei, who knew that there was no way I could care about the eyes of the boys after all this time, came to my seat suspiciously, but when she saw the paper lying on my desk, she was convinced that it was number seven.",
        "That’s just ridiculous.",
        "I’m sure it was the number eight paper that was lying on my desk…",
        "“Well, being Charlotte’s partner means making enemies with all the boys in the class, so even Aoyagi was confused. Okay, now for number eight. Who’s number eight for the boys?”",
        "“Ah, here! That’s me!”",
        "Rather than paying attention to the fact that I hadn’t come forward as number seven, Miyu-sensei started looking for the student with the next number, as if she was more concerned about the progress.",
        "And it was Akira who raised his hand, holding up the number eight paper I was supposed to have.",
        "It seems that Akira had switched the numbers without my noticing.",
        "Is this guy really trying to give Charlotte-san over to me?",
        "But this is not the way to do it…",
        "“Akira, I’m glad you’re feeling this way, but this is really…”",
        "“You can be number seven. I’m sure Akito thinks it’s not a good idea to go to such lengths to team up with Charlotte-san, but Charlotte-san would rather have you than me. If you’re going to act for the good of everyone with atonement ・・・・ make sure you take her wishes into account.”",
        "Atonement, huh…",
        "This is the reason why I decided to act for the people around me rather than myself, especially for Akira.",
        "It’s not fair of Akira to bring up the subject.",
        "“…I’m indebted to you, I’ll take advantage of this.”",
        "“Yeah, do that. Well, that being said, my pair is Shinonome-san… I hope I don’t scare her again…”",
        "After Akira smiled at me, he looked at the names on the blackboard and smiled bitterly.",
        "Since it was Shinonome-san who drew the number eight on the girls’ side, he must be remembering the scene from the lunch break earlier.",
        "She had been trying to keep her distance from Akira the whole time.",
        "I hope this is a good opportunity for the two of them to get to know each other…",
        "I glanced at Shinonome-san and saw that she was staring at me for some reason.",
        "Maybe she noticed the exchange between Akira and me.",
        "I wonder if I’ve done something wrong…",
        "I felt bad and turned my face away from Shinonome-san.",
        "This time, my eyes met Charlotte-san’s, who was staring at me with a very happy expression.",
        "…If I can get her to smile at me like this, I’m willing to accept any complaints from Shinonome-san…",
        "I was soothed by Charlotte-san’s smile and decided to apologize to Shinonome-san on the chat application after I left.",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Comments: Akira, best wingman. He’s a true bro, reminds me of the best friend I have that also gave me the paperback of Tsurekano volume 4 as a birthday present last month. Do you guys also have this type of bros? I sure am grateful to have a friend like him."
    ]
}