{
    "id": "chapter-121",
    "title": "Not a Coincidence, But an Inevitability",
    "content": [
        "Translator: AJ1703",
        "(**Akihito’s POV**)",
        "“I have no doubts about that, but…”",
        "I glanced at Charlotte-san’s face.",
        "She was still staring at her mother’s face in frustration.",
        "She didn’t say a word about it, probably because she thought it would interfere with our conversation, so she swallowed it down.",
        "“Was it for us that you didn’t come home very often?”",
        "‘If I was at home, the two of you wouldn’t be able to go visit Akihito-kun, would you?　Especially Lottie, who can’t tell me she’s going to a boy’s house.”",
        "Charlotte-san is shy.",
        "I’m sure she would have had a hard time coming to my room if she had her mother’s eyes on her.",
        "Above all, she would not have been able to stay in my room until late.",
        "For that reason, Charlotte-san’s mother did not come home that much.",
        "And she probably didn’t want me to run into her before we got to know each other and find out that it was all staged.",
        "“I’m sorry that I keep on asking questions, but I think both Charlotte-san and Emma-chan were feeling lonely… What were your thoughts on that?”",
        "“I thought Akihito-kun would fill that hole, and the more lonely she felt, the more she would try to seek something else to fill it, right?”",
        "In other words, she thought that Charlotte-san and Emma-chan would favor me more…",
        "“Why did you go through all that trouble to get us together? You must have a reason, right?”",
        "I can somewhat understand their intentions.",
        "But I don’t understand the timing.",
        "Above all, what they did seemed to be in a hurry.",
        "It was as if they felt they had to get us together right away.",
        "I think that’s why they used a lot of forceful means.",
        "“The reason why I wanted you to get together was because I wanted to fulfill my promise to Akihito-kun. In other words, I chose a natural way to welcome you as my son.”",
        "“You would do this while ignoring Charlotte-san’s feelings?”",
        "“Of course, I’m also thinking about Lottie’s happiness. I had been learning about how you were growing up from Kanon-chan for a long time, and I thought you would help Lottie and make her happy. More importantly, you would be right up Lottie’s alley.”",
        "Looking at her facial expressions, I don’t think she was lying.",
        "It seems that she was seriously thinking about Charlotte-san’s happiness.",
        "That means that she only trusted what Kanon-san had to say about the relationship.",
        "“Besides, if Lottie had not chosen you, I would have thought of another way.”",
        "“In what way?”",
        "“Well, it depends on you, but I was thinking it could be me or Emma.”",
        "“…You’re kidding, right?”",
        "As expected, I could not take the words as they were.",
        "Or rather, I won’t accept that.",
        "Charlotte-san, who was sitting next to me, was giving off a very scary vibe.",
        "“Emma is also very fond of Akihito-kun, so it would have been fine if she would have waited until she was ready to get married. In my case, I was thinking, well, if you’ll let me.”",
        "“―Mou~, I’m already in a relationship with Akihito-kun, so there’s no point in talking nonsense like that, is there?”",
        "Charlotte-san, who had run out of patience, took me in her arms and began staring at her mother as if she wanted to keep her in check.",
        "What should I do here?",
        "She’s beyond sulking, she’s getting really upset…",
        "“That’s right, I think it’s a barbaric thing to do. Well, that’s how I wanted to get you guys together― I thought of that shortly before I came to Japan.”",
        "Perhaps she was aware of Charlotte-san’s reaction, but the mother in question didn’t seem bothered by it and proceeded with her story.",
        "She has a lot of nerve indeed, I thought, but I want her to do something about it.",
        "Charlotte-san’s still holding me in check…",
        "“So, does that mean something is still up then?”",
        "“Yeah, that’s how this whole thing started. To tell you the truth, I feel bad for Akihito-kun, but I was going to let Kanon-chan take care of you.”",
        "Charlotte-san’s mother looked up at the ceiling nostalgically as she said this.",
        "“I’m the one who introduced you to Kanon-chan. I thought it would be a bad idea to leave you alone when we were going to have to leave Japan soon. So I introduced you to Kanon-chan, who was looking for a younger sibling at the time.”",
        "We met when we were practicing soccer in the park with the soccer ball that Onee-san had bought for us.",
        "At that time, she talked to me as if she happened to have spotted me― come to think of it, that was the day after Onee-san disappeared.",
        "That means it was a set-up from the beginning.",
        "“But it wasn’t my intention from the beginning to leave you in charge of everything. I was going to meet you when you got older and could speak English without any problems. But when I saw Kanon-chan happily reporting back to me about your progress, I felt sorry for you.”",
        "When was it that I learned to speak English without any problems?",
        "I don’t remember much, but I think by the time I entered middle school, I could already speak at a daily conversational level without any problems.",
        "It was Kanon-san who helped me with my studies, and she was the one who prepared the study materials so that I could study on my own at the facility.",
        "I knew it was a combination of coincidences, but it was all guided.",
        "It is often said that when a number of coincidences coincide, it is not coincidence anymore, but an inevitability.",
        "“Even though I made a promise to you, I’m sorry. For me, I thought of Kanon-chan as if she was also my real daughter.”"
    ]
}