{
    "id": "chapter-120",
    "title": "Hammering Piece",
    "content": [
        "Translator: AJ1703",
        "(**Akihito’s POV**)",
        "“…………”",
        "Next to me thinking, I can clearly see that Charlotte-san is getting grumpy.",
        "I guess she doesn’t like that they took advantage of the young Emma-chan.",
        "I feel the same way.",
        "Even though Charlotte-san and I are trying to get along, I have my own feelings about them having a little girl as a pretext.",
        "However, Onee-san and Kanon-san are people who think the same way as I do.",
        "I can tell without words that they were conflicted about using Emma-chan.",
        "I am sure that she thought that the only person she would allow a man to have her heart is the one who protected her precious sister.",
        "She is speaking now so matter-of-factly because she accepts that she can’t be blamed.",
        "If that were the case, there would be no way she could complain.",
        "“Can I ask you one more question?”",
        "“Yes, you can ask me anything you want. I’ll answer whatever I can.”",
        "“How long have you known Miyu-sensei, me and Charlotte-san’s homeroom teacher?”",
        "I look straight at Charlotte-san’s mother.",
        "This made Charlotte-san’s mother laugh in annoyance, and Charlotte-san didn’t seem to understand the intent of the question.",
        "“Really now… that’s a very troubling question you just asked… Not to mention, you sound so sure that Hanazawa-sensei was involved in this one.”",
        "“I originally didn’t care, but now I’m convinced. After all, to ensure that Emma-chan would only meet me, you would need someone from the school to cooperate with you.”",
        "“What do you mean…?”",
        "Charlotte-san asks, puzzled.",
        "“Charlotte-san had taken measures to make sure that Emma-chan would never go out on her own again after the day she disappeared, didn’t you?”",
        "“Yes, I did, but…”",
        "“It was a one-time thing, and they couldn’t afford to make any mistakes. If they couldn’t get me to meet her that one time, Charlotte-san would take measures to prevent it from happening the next time onward. Of course, they could still lead Emma-chan outside, but as expected, if I went that far, Charlotte-san would realize that it was done on purpose. That’s why they had to get someone from the school to help them. I was made to sort out the materials room that day by Miyu-sensei, who told me it was my punishment.”",
        "So the timing of my leaving school with Charlotte-san was off.",
        "Most importantly, Miyu-sensei seemed to know that I was going to bring Emma-chan with me.",
        "Charlotte-san had contacted her to say that her little sister was missing, and she saw me with a little girl with silver hair, so she called Charlotte-san with a flash of inspiration― she said it was their characteristic feature to begin with. Once she was contacted by Charlotte-san, she would’ve shared it with the other teachers and let others take care of it.",
        "And yet, it was strange that she stayed in the staff room.",
        "So she must have known.",
        "If she waited, I would bring Emma-chan to her.",
        "My guess was that once I had Emma-chan in my custody, Miyu-sensei would be notified, and she would contact Charlotte-san when the time was right.",
        "“You asked Miyu-sensei, didn’t you? You asked her to hold me back. But I don’t think she would trust someone she wasn’t close to to do what she said. So I think you must have known her from the beginning.”",
        "“…………”",
        "Charlotte-san’s mother stares at me with a sly look on her face.",
        "And then―.",
        "“Truly, you are certainly amazing… You’ve really grown up well.”",
        "She smiled helplessly, as if to say that my guess was correct.",
        "“I’ll tell you one thing first. Hanazawa-sensei cooperated with us because she knew it was for Akhito-kun’s benefit. It was never because we knew each other.”",
        "She prefaced her words with a smile that looked like she had no choice.",
        "“And one more thing. I knew Dr. Hanazawa, but we weren’t really chummy enough to be called close. She has her own reasons for doing what she does. That’s why it was Kanon-chan who asked Hanazawa-sensei to help us.”",
        "“Kanon-san did…? However, she was supposed to be close to the little sister Aki, but not acquainted with her older sister Miyu-sensei…”",
        "“They just made it look that way. Well, it’s not something I can casually mention, and I’m sure Kanon-chan and Hanazawa-sensei don’t like to talk about it either, so I’d better not touch on it.”",
        "Apparently, there are some weighty circumstances on their side as well.",
        "It was Kanon-san who recommended my current high school to me.",
        "She convinced me that it would be the easiest place to achieve my goals, and since it was far from my hometown, I wouldn’t have many acquaintances there.",
        "Akira commutes an hour by train from our hometown, and even Aki now plans to attend our high school next year by moving out of her parents’ house and living at Miyu-sensei’s house.",
        "I was told to enter my current high school because it is a place that I would not be able to go to without doing so― and that’s what I did.",
        "But that’s all a figure of speech, and the truth is that it was a high school where Miyu-sensei is a teacher, so did Kanon-san recommend it to me because of that…?",
        "Isn’t that a bit far-fetched…?",
        "“Let’s get back to the story, shall we? I think it was selfish of me to try to force a rapport between the two of you. But we thought it was in the best interest of both of us. I hope you believe that much.”"
    ]
}