{
    "id": "chapter-34",
    "title": "Reverting Back to the Old Me",
    "content": [
        "(**Aoyagi’s POV**)",
        "“Hey, Akito, you’re in a good mood lately, huh? Did something good happen to you?”",
        "During lunch break, while I was eating my Set A meal in the cafeteria, Akira, who was eating a curry and rice in front of me, looked at me curiously.",
        "I’m not aware that I’m in a good mood, but I am aware that something good has happened.",
        "Of course, it was the fact that I was getting to know Charlotte-san.",
        "When she made me breakfast this morning, I was so happy.",
        "I’m also very happy that Emma-chan has taken a liking to me.",
        "I’m sure I’ll be treated like a lolicon for saying this to a young girl, but her cuteness is off the charts.",
        "She’s Charlotte-san’s little sister, so it goes without saying that she’s the cutest thing I’ve ever seen, and makes me want to spoil her all the time.",
        "She seems to be particularly fond of being carried, and smiles so adorably when you give her a hug.",
        "She really is a very cute girl.",
        "“O-oiii? Are you okay?”",
        "As I remembered Emma-chan’s smile, I saw Akira looking at me with concern.",
        "What on earth could he be worried about?",
        "I’m not sure, but I nodded anyway.",
        "“There’s nothing special about it. It’s business as usual.”",
        "I backtracked a bit, trying to cover up what Akira had asked me.",
        "I’ve decided to keep the matter between me and Charlotte-san a secret, even if it’s Akira, because it would cause trouble for her if people knew about it.",
        "Besides, if it was Akira, there was always the possibility that he would get angry out of jealousy.",
        "Today, he was trying his best to make contact with Charlotte-san.",
        "However, for the first time today, I noticed that when Akira and the other boys were talking to Charlotte-san, her smile was a little strained.",
        "If I recall, from the beginning, the smile that Charlotte-san would put on her face when boys talked to her seemed to be somewhat awkward.",
        "Perhaps she has a weakness for boys.",
        "However, it’s also possible that I’m just imagining things.",
        "In fact, it’s probably more likely for that to be the case.",
        "If she’s not good with boys, she won’t come to my room or serve me a home-cooked meal.",
        "“Fuun~… Speaking of which, have you heard from your current parents…?”",
        "Akira, who was looking at me quizzically, asked me as if he remembered something.",
        "I stopped my chopsticks as I grabbed the fried shrimp, the main part of the Set A meal.",
        "I looked at Akira’s face.",
        "“Ah… M-my bad… That’s a bad topic to touch…”",
        "When our eyes met, Akira apologized to me as if in a panic.",
        "I slowly opened my mouth slowly as I looked away from him.",
        "“It’s not like they’re going to call me. There’s no way my parents would be worried about me, and they’re the ones who kicked me out in the first place.”",
        "The reason I was living alone was simple.",
        "I couldn’t stay at home anymore.",
        "I still remember how they treated me harshly when I was living with them.",
        "To be honest, I don’t think I’ll ever be able to get along with them.",
        "However, they still send me enough money every month to live on, and for that, I am grateful.",
        "I try to keep my hands off that money as much as possible, but it’s still difficult for a high school student to make a living with just a part-time job.",
        "If there is a better way to make money, I would like to do it.",
        "“You know what? Don’t worry about it. I know I invited you before, but you can really come to my house, you know? My parents would love to have you, and they’re rather pestering me to bring you, Akito.”",
        "“Oh, thank you. I’ll come and visit your parents some time to say hello. But I don’t want to cause you guys any trouble, and I don’t have any problems in my life.”",
        "I thanked Akira for his concern.",
        "When I had told Akira that I was going to be kicked out of my house as soon as I entered high school, he and his parents had invited me to come to the Saionji household.",
        "But of course I didn’t want to bother them, so I turned down the invitation.",
        "Akira’s parents still cared about me.",
        "Akira’s parents are more like my parents than my own parents.",
        "That’s how much I’ve been neglected by my parents.",
        "―Well, I guess that’s natural.",
        "After all, I’m not their real son.",
        "I remembered my unpleasant past and ate my meals in silence.",
        "◆",
        "(**Aoyagi’s POV**)",
        "“Hmm? It feels like the class is more rowdy than usual.”",
        "As I was walking back to class with Akira after finishing my meal, I noticed that our class seemed to be in a hustle and bustle.",
        "Since Charlotte-san came to study abroad, people from other classes gather here, so it’s noisy every day, but somehow today it seemed different.",
        "After all, I can even hear them yelling.",
        "Akira and I looked at each other and immediately started running to class.",
        "“―You guys, enough now! We were the ones who asked her out first!”",
        "“You guys are the ones who need to cut the crap! After all, you were the ones who kept pestering her every day! Don’t get cocky just because you’re seniors!”",
        "When I returned to the class, several men were arguing, splitting into two groups with Charlotte-san between them.",
        "It was the second and third year students who have been popping up every lunchtime lately.",
        "My classmates were keeping their distance from the upperclassmen and Charlotte-san, as if they were trying not to get involved.",
        "Charlotte looked troubled and frightened― as she strained to stop them somehow.",
        "“They’re…!”",
        "As soon as I understood what was going on, Akira moved to stop the seniors―but before he could, my body unconsciously moved.",
        "“―You guys, what are you all doing…?”",
        "I grabbed the arms of the two representatives who seemed to be grabbing each other by the chest and squeezed them tightly.",
        "“”O-ouch, ouch, ouch! You, what the hell are you doing!?””",
        "The two of them glared at me, their voices harmonizing together as if they were lying about fighting.",
        "The only thing is― if I put more pressure on them, they would change their color and somehow start trying to pull my arm off.",
        "I thought they were overreacting, but I let go of my grip on their arms.",
        "They were rubbing their arms in pain, but I didn’t care, I looked at the upperclassmen.",
        "“What are all you upperclassmen doing scaring the underclassmen girls? Why the heck do you guys even come to school?”",
        "“”””Ah―!””””",
        "The color of the upperclassmen’s faces changed when they saw my eyes.",
        "They look as if they have seen something they should not have seen.",
        "“N-no, it’s nothing! We just got a little overzealous, that’s all! So please don’t stare at me like that!”",
        "The guy from the third year side who was grabbing each other gave me an excuse with a grimace on his face.",
        "“T-that’s right! We were just making a bit of noise! It was just a joke!”",
        "The guy from the second year also made an excuse with a tight smile, just like the third year.",
        "What was the joke?",
        "If it was a joke that frightened Charlotte-san, it was even more unforgivable.",
        "“―Calm down, Akito. You’re reverting back to your old self.”",
        "With that voice, I was smacked on the head from behind.",
        "That’s when I came back to myself.",
        "“…Excuse me, senpais. Since lunch break is almost over, could you please go back to your classrooms?”",
        "I took a deep breath to let my anger out and asked the troublemakers to leave.",
        "From the looks of the seniors, there would be no more arguing.",
        "“A-ahh, sorry for that, I apologize for the interruption.”",
        "“Oh, we’re going back soon, too.”",
        "The upperclassmen seemed to understand and slunk away.",
        "As I looked at them, I felt a little regret.",
        "I was angry when I saw Charlotte-san’s frightened look, but it was obviously too much.",
        "At the very least, it was not the way to treat a senpai.",
        "I have to thank Akira for stopping me before I went too far.",
        "“―Oh man. I didn’t realize you were in a bad mood until you got back to your old self… I knew I should be careful not to talk about your parents in the future…”",
        "“Hmm? Did you say something, Akira?”",
        "“I-it’s nothing, you know? Yeah, it’s nothing, I promise.”",
        "I thought I heard Akira behind me say something, but it seemed to be my imagination.",
        "It bothered me that he was a little flustered, but oh well, class is about to start, so it can wait until later.",
        "“U-umm, Aoyagi-kun. Thank you very much.”",
        "As I was about to go back to my seat, Charlotte-san came up to me before I knew it and thanked me in a small voice.",
        "I wondered why she was so fidgety and wouldn’t make eye contact with me.",
        "Could it be that she’s scared of me…?",
        "―Charlotte-san’s reluctance to make eye contact with me shocked and depressed me."
    ]
}
