{
    "id": "chapter-44",
    "title": "Staring Into The Mirror",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "“O-ha-yo-u O-nii-chan!”",
        "The next day, Emma-chan came to visit my room early in the morning.",
        "She had promised to go out with me today, and apparently she couldn’t wait to see me.",
        "I was a little worried when I heard that she had sulked and fallen asleep last night, but judging by her behavior, my fears were unfounded.",
        "Young children are quick to change their minds, so maybe they just went to bed and forgot about it.",
        "“O-ha-yo-u”",
        "I greeted her slowly, just as Emma-chan did.",
        "Then she smiled at me, looking very happy.",
        "“Ngh…”",
        "As I was being soothed by Emma-chan’s cute smile, she opened her arms and looked up at me.",
        "This was Emma-chan’s signal for me to hold her.",
        "I’ve learned to do this since she asks me to hold her every time we meet.",
        "I wrapped my arms around Emma-chan’s small body and picked her up tightly, making sure not to drop her.",
        "“Ehehe~, Onii-chan~!”",
        "I gave her a hug as she requested, and she gave me a sweet little peck on the cheek.",
        "This girl really likes to be held, doesn’t she?",
        "She’s always in a good mood whenever I hold her, so I guess she likes to be spoiled this way.",
        "Well, I’m happy, so there’s no problem at all.",
        "More importantly, what happened to Charlotte-san?",
        "It seems that she was not around when Emma-chan came here…",
        "“Hey, Emma-chan. What happened to Charlotte-san?”",
        "I wondered why the older sister, who usually follows her little sister around, wasn’t here, so I asked Emma-chan, who’s still rubbing her cheek against me.",
        "“Hmm…? Lottie, you know, she’s been staring into the mirror.”",
        "“Staring into the mirror?”",
        "What’s up with that?",
        "Charlotte-san, what are you doing by yourself…?",
        "“Yes! That’s why Emma’s all alone!”",
        "Emma-chan said proudly, as if to praise and compliment her.",
        "I think she wants me to praise her for coming here all on her own.",
        "Her proud attitude was cute, but I couldn’t honestly praise her more for her safety in the near future.",
        "“Emma-chan is still very young, so don’t go out by yourself, okay? There are a lot of harmful things outside, you know.”",
        "Emma-chan was still too young to go out alone, so I warned her not to do it again.",
        "This girl is a foreigner, young, and very cute.",
        "If she was walking around alone, she would be an easy target for strange people.",
        "If she were to disappear, Charlotte-san would definitely become depressed.",
        "Above all, I myself would be quite shocked.",
        "I don’t want that to happen by any chance.",
        "“No good…?”",
        "Maybe Emma-chan was shocked that I had warned her, but she looked up at me with her eyes glazed over and stared at me.",
        "Ugh… this is making me feel insanely guilty…",
        "It’s as if I’m bullying the weak.",
        "I think the teary-eyed upturned gaze she does is a foul play.",
        "But I can’t let this look get the better of me.",
        "I can’t let Emma-chan be put in danger.",
        "“Yes, you can’t, it’s dangerous. If you want to go outside, you have to go along with Charlotte-san or your parents, okay?”",
        "“Mou~… okay…”",
        "Emma-chan nodded her head, though she seemed unhappy.",
        "She’s a good girl, she listens very well despite her young age.",
        "“Now, now, Emma-chan’s a good girl.”",
        "“Ehehe~”",
        "When I gently patted her head and praised her, Emma-chan’s teary-eyed expression changed to a smile.",
        "She’s surely a child in this aspect.",
        "―*Ding dong.",
        "As I was patting Emma’s head, the intercom rang.",
        "It was probably Charlotte-san’s arrival.",
        "“Ah, I knew it…!”",
        "I went outside with Emma-chan in my arms, and as expected, Charlotte-san was at the door.",
        "Her cheeks were puffed up and she looked angry, probably because Emma-chan had come to my house alone.",
        "That’s only natural if you find yourself without your little sister at home.",
        "But more than that― Charlotte-san is so cute…",
        "She was dressed in black on top and a pink skirt on the bottom.",
        "Despite the fact that both of them are simple―or rather, because of their simplicity, her charm is enhanced.",
        "The black dress in particular made Charlotte-san’s beautiful silver hair look even more attractive.",
        "I was surprised to see her wearing a black-based outfit, but it suited her well and she looked really cute.",
        "She also looked more mature than usual because she was wearing black tights and a thin layer of makeup on her face.",
        "I finally understood what Emma-chan meant by “staring into the mirror”.",
        "Charlotte-san had gotten dressed up to go out with me today.",
        "She may have just dressed up to go out with her friends, but I’m still happy for her.",
        "“Mou~, that’s not good! Why did you go alone!”",
        "Charlotte-san is pouting at Emma-chan, who is in my arms.",
        "Emma-chan, on the other hand, turned her head away from me.",
        "“It’s not my fault that Lottie is late!”",
        "“I’m sorry I made you wait, but you can’t go alone! We still had an hour to go before the appointed time!”",
        "“I wanted to see Onii-chan quicker! Emma wants to play with her brother as soon as possible!”",
        "“That’s not good, you’ll bother Aoyagi-kun! And you haven’t even changed your clothes yet…!”",
        "The Bennett sisters start to argue with each other, not caring about me.",
        "Well, there’s a saying that the more you fight, the better you get along, and with these sisters, it’s unlikely to turn into a serious fight.",
        "I’m sure they’ll make up in the end, after all, so I’ll let them do what they want here.",
        "As I stared at the two sisters who were still arguing, I thought about my plans for the day with them.",
        "―By the way, after this, Emma-chan would be taken home by Charlotte-san and then come out wearing a very cute outfit."
    ]
}