{
    "id": "chapter-105",
    "title": "Your Foster Sister is in the Room Next Door―",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Akito’s POV**)",
        "“―It’s no good, I couldn’t get through…”",
        "I went back to Charlotte-san with a sigh.",
        "I had a hunch that she wasn’t going to answer my call.",
        "“Who were you calling…?”",
        "“Hmm? Ah, a maid I know, I guess.”",
        "Thinking that she wouldn’t recognize her even if I told Charlotte-san her name, I smiled and told Charlotte-san as she was worried about me.",
        "Then she opened her mouth a little curiously.",
        "“Your Foster Sister, isn’t it…?”",
        "When she muttered this, Akira suddenly― looked at me with a very surprised expression on his face.",
        "He didn’t expect me to talk with her about Kanon-san.",
        "“Oh, that person… I can’t get in touch with her.”",
        "That doesn’t mean she doesn’t have my phone number.",
        "The reason was that I had hurt her so badly in the past that it was difficult for her to contact me.",
        "Of course, the perceptive girl understood this from my words.",
        "“Then we’ll have to call the maid back…”",
        "“No, I think that would be useless.”",
        "“Why is that?”",
        "“She’s blocking my calls…”",
        "“”―!?””",
        "When Charlotte-san and Akira heard my words, they looked very surprised.",
        "I’m sure they didn’t expect to be blocked from receiving calls.",
        "―Of course, I didn’t think so either.",
        "“Maid-san is… Kusanagi-san, right…? How could that person do that to Akito…?”",
        "“I hadn’t called her since I left home, so maybe that’s when she did it…”",
        "“But then, what are you going to do about it…?”",
        "What am I going to do about it― is what he asked me, and I silently pondered about it.",
        "Do I have to go back to that house and talk about it…?",
        "It’s also possible that I’ve been blocked from receiving calls in order to make this happen…",
        "But isn’t the house in turmoil right now…?",
        "In addition, it’s not like anything is going to happen when I get home, and I feel like I’m just going to be treated like a distraction…",
        "I proceeded to consider a number of possibilities.",
        "But all of them were bad ideas, and I was hesitant to take action.",
        "Then Charlotte-san, who had been staring at me in silence, started whispering as if she wanted to say something.",
        "“What’s wrong?”",
        "“Oh, that… Akito-kun, you want to talk to that maid, don’t you…?”",
        "“Well, technically, my foster sister, but…”",
        "I only called Arisa-san in order to have her connect me to Kanon-san, and I need to talk to Kanon-san about this matter.",
        "Obviously, it was that person who set up the whole thing.",
        "She may be a gentle person, but when she gets angry, she becomes a much scarier person than Arisa.",
        "Kanon-san is a typical example of a kind person who’s very scary when she gets angry.",
        "In addition, she is a person who loves to scheme, and if she has to, she will relentlessly push her opponent to the brink of death.",
        "I don’t know why she did it this time, but it seems that her father had angered Kanon-san to such an extent that she was willing to go to such an outrageous extent.",
        "I thought for a moment that maybe it was because she had forced me to talk about marriage― but as expected, that alone would not have made her do this.",
        "In addition, if she was against it, she wouldn’t have done anything to make Arisa hurt me.",
        "The only one who can control Arisa-san is Kanon-san, and Arisa-san doesn’t really listen to anyone but Kanon-san―huh…?",
        "The words that suddenly passed through my head.",
        "I felt very uncomfortable about that.",
        "However―",
        "“This Foster Sister of yours… is probably in the room next door…”",
        "Charlotte-san’s unbelievable words caused me to lose interest in the matter.",
        "“Eh, what do you mean by that…?”",
        "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~",
        "Author’s Afterword:",
        "Thank you for reading!",
        "Actually, In the Shueisha Web Novel Award,",
        "“After Coincidentally Saving the New Transfer Student’s Lost Little Sister Who Lives Next Door, We Gradually Grew Closer”",
        "received the Silver Award!",
        "After two years, it will finally be available in book form!",
        "I’m so happy because I’ve been saying that this work will be published someday!",
        "I’d like to express my gratitude to all my fans and readers who have supported me all these years.",
        "Thank you all so much!!",
        "It’s finally time for you guys to see the cute illustrations of Charlotte and Emma (≧▽≦).",
        "I’m going to do my best to work on the book, so please keep your eyes peeled!",
        "I’m looking forward to your continued support of “Otonari no Asobi”. [TLN: “Otonari no Asobi” is “Playing/Hanging Out Next Door”]",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Afterword: Although this has been announced on c58 of Losing Heroine already, I’ll say it here again. It looks like I’ll be calling “Transfer Student” as “Otonari no Asobi” from now on.",
        "Also, a big thanks to “Exfernal” from Chapter 101 comments. Instead of “sister-in-law” that I had previously used before for the Ojou-sama aka Kanon-san, it’s supposed to be a foster sister. After all, I just checked the actual meaning of sister-in-law for that and it was indeed wrong of me to use it. I’ll be using foster sister from now on, and I’m sorry for the misconception that I might have given the readers. If you guys ever see more mistakes or have suggestions to make, don’t hesitate to leave it in the comments or in the #feedback section of our discord server!",
        "Congratulations too for Nekokuro-sensei in getting this series published into a book! In other words, a light novel! That’s why, we’re getting illustrations soon enough. I’m planning to do it too once it gets here.",
        "Lastly, please help Matsu reach his Ko-Fi goal. It’s so close to being completed! Just click the button widget below to be redirected. Thank you all for the support~!"
    ]
}