{
    "id": "chapter-79",
    "title": "Aoyagi-kun's a Bully...",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "“―Ngh…”",
        "How long has it been since then?",
        "A few hours had passed since the sunlight began to filter through the curtains when Charlotte-san’s eyes slowly began to open.",
        "“‘Are you awake?’",
        "“…………”",
        "I called out to her, and she looked up at me with a sleepy-eyed frown.",
        "Then she froze, as if she could hear a clunking sound.",
        "“…………”",
        "When I thought she had finally started to move, she now started to blink rapidly, crackling and blinking.",
        "I was staring at her, and at the end of it, her face turned bright red.",
        "And to top it all off, she pushed her face into my chest with a bang.",
        "“…Good morning.”",
        "“G-good morninguu…”",
        "In the meantime, I greeted her, and Charlotte-san returned the greeting with a visible reddening of her face so that I could almost hear her puffing sound.",
        "It seems that she is very upset about the fact that she chewed on the greeting.",
        "“Um, do you remember anything…?”",
        "I wasn’t sure what was causing Charlotte-san’s behavior, so I asked her to make sure.",
        "“Let me forget that…”",
        "Apparently, she has a memory of yesterday, too.",
        "That’s why she’s in such agony.",
        "“Yesterday was… that, I was drunk…! It was a one-night stand…!”",
        "Charlotte-san started to make an excuse that is not like her, as if she really wanted to pretend that yesterday did not happen.",
        "“No, you didn’t do anything that should be considered a one-night stand, and you didn’t drink any alcohol in the first place.”",
        "“I-It’s so embarrassing to me that I’d rather want you to forget about it…!”",
        "You say that, but Charlotte-san, you’re still in my arms…",
        "In addition to that, her face is pressed against my chest, is she not aware that she’s currently doing something embarrassing?",
        "“Well, I was surprised… but you don’t have to be so surprised like that… After all, I thought it was cute…”",
        "I was a little stumped, but I told her what I was thinking.",
        "If I had to describe yesterday’s Charlotte-san, I’d say she was too cute.",
        "She was so cute that I almost lost my reason, but there was nothing strange about her.",
        "I’d rather have been with her all day if my heart could take it.",
        "“I-I was really out of my mind yesterday…! A-Aoyagi-kun stroked my head, and even though I was trying my best to hold back from asking to be spoiled, I couldn’t hold back anymore when you said something that made me very happy…! So I borrowed your chest to let off some steam, and then I just couldn’t stop from there…!”",
        "As she said that, Charlotte rubbed her face against my chest, and made a “no” motion.",
        "She was so embarrassed that she couldn’t help but writhe.",
        "I’m not sure of what to do, she’s just too cute.",
        "I’m so thrilled that my heart hurts, but more than that, I’m happy.",
        "“―Kuh… that tickles…”",
        "Charlotte-san was so cute that I couldn’t stand it any longer but stroke her cheek.",
        "Her skin is so smooth and comfortable to the touch, with a hint of heat, that it makes you want to stroke it forever.",
        "At the same time, I realized that I was doing something terrible in front of Charlotte-san, who was writhing and looking up at me with embarrassed, troubled eyes.",
        "“I-I’m sorry…!”",
        "I thought I had done something wrong, and hurriedly removed my hand.",
        "But―",
        "“Oh…”",
        "When I stopped stroking her, Charlotte-san made a very regretful sound.",
        "Then she followed my right hand with her gaze.",
        "This is…",
        "“Did you want me to stroke it some more?”",
        "“…..Aoyagi-kun’s a bully…..”",
        "I asked her to confirm, but I think she took it as if I was trying to humiliate her by making her say it all the way, and Charlotte-san shyly pressed her face against my chest.",
        "After a while, she looked up at me with feverish eyes and shook her head with a small smile.",
        "It’s so cute, it’s really bad.",
        "My head almost boils from Charlotte-san’s cuteness, but I still reach out to touch her cheek again as she requested.",
        "But then―",
        "“―Uwaaaahhhh! Where’s Oniichaaaaaaan!?”",
        "The cries of the absolute ruler made it impossible for us to do so.",
        "―Or rather, before I knew it, it’s not about Charlotte-san anymore but me…"
    ]
}