{
    "id": "chapter-107",
    "title": "Another Way",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Akito’s POV**)",
        "“―Now then, will the demon or the snake come out…?”",
        "After appeasing Akira and sending him on his way, Charlotte-san and I stood in front of the next room.",
        "“You look very nervous…”",
        "“Yeah, I am.”",
        "The person I’m about to meet is someone that I’ve hurt badly in the past.",
        "And there’s always that dreaded “Sadist” in the vicinity.",
        "I’m not mentally strong enough to meet these two people again without a fight.",
        "“Don’t worry, I’m sure they’ll understand when you talk to them.”",
        "When I was nervous, Charlotte-san put her hand on my hand with a gentle voice.",
        "Her face was red, and she must have been embarrassed to do this to herself.",
        "Still, she did her best to reassure me, and I opened my mouth with a smile.",
        "“Thank you. Let’s go, then.”",
        "I rang the intercom.",
        "But then―",
        "“”………….””",
        "―No one came out.",
        "In the silence, Charlotte-san and I looked at each other without thinking.",
        "Then Charlotte-san smiled annoyingly and clapped her hands together.",
        "“Well, it’s not as convenient as in the manga apparently.”",
        "Charlotte-san smiled awkwardly and followed up.",
        "I don’t know why, but I felt more sorry for her than for me.",
        "“I don’t blame you… I wish there was some other way I could contact them…”",
        "“Oh―”",
        "“Hmm? What’s the matter?”",
        "“No, it’s…”",
        "When I looked at Charlotte-san, who seemed to have remembered something, she began to play with her hands in a very apologetic manner.",
        "Her gaze wandered uncomfortably, and she looked somewhat uncomfortable.",
        "I wondered what was really going on.",
        "“Did you think of something?”",
        "“Um, actually…”",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Afterword: Why dafuq is the chapter this short??? Stop giving as cliffhangers sensei and rarely updating the series sadge.",
        "On another hand, I have finished translating the first volume of the Light Novel series [For some reason, a gal in my class became friends with my step-sister. “Can I go to your house today?”]. It’s a school romcom that has a lot of troupes and kinda sugary like transfer student (which is this series).",
        "Lastly, please help me reach my laptop ko-fi goal soon by clicking the button below. At night I want to translate but I just can’t because my father is using the PC. Thank you all for the support!"
    ]
}