{
    "id": "chapter-104",
    "title": "The Mastermind",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Akito’s POV**)",
        "“T-TV…?”",
        "“Oh, um, could it be that a picture of me kissing you is being broadcast all over the country…?”",
        "When I looked at Charlotte-san’s face in confusion, she was looking up at me with tears in her eyes.",
        "Her face was bright red and she was trembling with embarrassment.",
        "Well, if that photo is being broadcasted all over the country, it’s no wonder she’s embarrassed.",
        "It’s just that― that picture is being broadcasted not only all over the country, but all over the world, isn’t it…?",
        "The spread is already being done not only by Japanese but also by foreigners, and in the comment section, there were many praises written by foreigners for Charlotte-san.",
        "It’s possible that her friends in the UK might have seen it too.",
        "To be honest, I don’t think it’s a big deal that the photo was featured on TV after all these years.",
        "“I think it’s too late for that now.”",
        "“Waa~…”",
        "When Charlotte-san heard my words, she pressed her face against my arm in embarrassment.",
        "I’m sure she regrets it a lot.",
        "But I’m pretty sure she was the one who encouraged the spread.",
        "I had no choice but to let her get what she deserved.",
        "“Well, let’s watch TV for now…”",
        "“No, no, no, no! Before that, you have to let me in! And from the looks of it, you’ve got Charlotte-san in your room!”",
        "As I was about to go back to watching TV, I heard Akira’s tsukkomi over the intercom.",
        "Oh, that reminds me, he was at the door.",
        "I was so distracted by Charlotte-san that I momentarily forgot.",
        "It seems that he already knows that Charlotte-san is here, so I’d better let him in…",
        "After concluding that, I unlocked the door and let Akira in.",
        "“…………”",
        "Once inside, Akira fell silent as she saw Charlotte-san’s face turn bright red and she fidgeted.",
        "Charlotte-san then buried her face in my arms again, embarrassed.",
        "The look in Akira’s eyes became frightening.",
        "“Looks like you had a lot of fun when people were worried about you…”",
        "“No, Akira, I think you’ve misunderstood something.”",
        "“Misunderstood!? A girl sticking to a guy with her face all red and squirming after―!”",
        "“Stop it, you idiot…!”",
        "I hurriedly stopped Akira when he was about to say something outrageous.",
        "No, it may be too late, but I don’t want to have that kind of conversation in her presence.",
        "The only thing I can do now is to pretend that Charlotte-san can hear me, even if she can’t.",
        "“I’m sure I didn’t do what you think I did, so don’t say anything like that again.”",
        "“But Charlotte-san’s condition…!”",
        "“This is different!”",
        "“I-Is that right…?”",
        "Akira hears my words and asks Charlotte-san that question instead of me.",
        "Charlotte-san looked very embarrassed, but she was nodding her head as hard as she could.",
        "She seemed to understand what Akira was saying and seemed to have a lot of knowledge in this field.",
        "However, there was no way I could make such a comment to her, and I thought Akira was a brave person for asking Charlotte-san to talk about this.",
        "“Okay, okay, this conversation is over. More importantly, the news on TV. What’s exactly being broadcast on it?”",
        "Thinking that this would only humiliate Charlotte-san, I asked Akira while urging her to move.",
        "Then Akira opened his mouth with a very serious expression on his face.",
        "“No, it’s pretty bad. For now, look at the TV.”",
        "“Is it that bad…?”",
        "I turned on the TV, feeling nervous because Akira’s condition was not normal by any stretch of the imagination.",
        "Then, I saw a scene on the screen of a group of men talking.",
        "“No, I really think this is a big problem, don’t you? I looked back at the footage from that time, and it’s true that if he had been there, the Japanese soccer world might have changed a lot.”",
        "“That’s right. In fact, I wonder why he wasn’t the center of attention at the time.”",
        "“I think it’s because he tried to keep a low profile during the game. He would foreshadow to create a decisive moment, but other than that, he would intentionally make inconspicuous moves to avoid being marked. A single conspicuous move won’t draw that much attention.”",
        "They were talking to each other as they played footage of me playing in the past, but who were they really?",
        "“This is…?”",
        "“The famous soccer commentators raving about you and lamenting the loss of you.”",
        "“No, there’s no point in doing that now― or is this the big deal you were talking about?”",
        "It seemed to be an emergency program being broadcasted on a nationwide station, so it was important.",
        "However, if this is the only thing that happened, Akira should not be in such a panic.",
        "If this is all there is, the content that keeps spreading on SNS is worse.",
        "However―",
        "“No, it’s after this.”",
        "“After this…?”",
        "Akira told me, and I continued to watch the TV in silence.",
        "And then―",
        "“So, the reason why he left the soccer world, the man who could have been a treasure for Japan, as you say―”",
        "As I watched the TV, a gorgeous looking lady who had been listening to me suddenly began to speak with a serious expression on her face.",
        "She talked about how I had abandoned the first game of the national tournament, and how that had caused the team to become confused and the game to break down.",
        "She talked about how I was nicknamed the war criminal and the worst commander in the world.",
        "The people on TV didn’t say anything about it, but listened with serious expressions.",
        "“Akito-kun, shouldn’t you stop watching…?”",
        "Charlotte-san, who had changed her color because of the horrible explanation given to me, looked up at me as if she was worried.",
        "But it’s not like I’m upset about this now.",
        "And since Akira didn’t say anything, I guess he’s not ready to show it yet.",
        "“No, I’m fine. Isn’t that right, Akira?”",
        "“Yeah, just keep watching. You’re going to get a hell of a lot of information.”",
        "“…………”",
        "Because of me and my refusal to stop looking, Charlotte-san squeezed the sleeve of my clothes.",
        "Her expression is dark, and I can tell that I’ve caused her some worry with my kindness.",
        "Normally, I would have patted her on the head, but Akira is here right now, so I can’t really do that.",
        "So instead, I gave her hand a gentle squeeze.",
        "“Oh…”",
        "“It’s fine, okay?”",
        "“Yes…”",
        "When I smiled at her with a gentle smile on my face, Charlotte-san leaned back into my arms again as if she was relieved.",
        "I thought I heard Akira’s tongue clucking, but it must have been my imagination.",
        "While I was dealing with Charlotte-san like this, the TV lady broke off and took a deep breath.",
        "“Here she comes.”",
        "Akira muttered next to me after seeing the lady’s attitude.",
        "And then―",
        "“But today, the truth came out! Aoyagi-kun did not throw the game himself, but it was discovered that there was a mastermind who forced him to do so! And it was the head of the Himeragi Faction― one of Japan’s leading financial groups!”",
        "That’s what the lady said in a high-pitched voice.",
        "When I heard those words, I was astonished at the outrageous statement.",
        "“What’s this…?”",
        "“Right!? Isn’t this bad!?”",
        "“It’s more than just bad…”",
        "I said impatiently to the excited Akira next to me.",
        "Akira seems to be excited that it’s getting interesting and that this is a chance for payback, but I’m not in a position to be honestly happy.",
        "“Every station is broadcasting this! I can’t believe the TV station got the information so quickly!”",
        "“No, it’s too fast, by any means. Even if they knew from what Riku and I had said that there was someone pulling the strings behind the scenes, they couldn’t have identified it this quickly.”",
        "In addition, the other party is the head of a major group.",
        "If you do something like defamation on TV like this, you never know what kind of reprisal you’ll get, and if the information is wrong, the risk is too great.",
        "That’s why they have to be very careful about what they say, but there’s no way they could have done this in less than half a day.",
        "The most likely explanation is that the information was leaked by someone who the TV station could easily believe.",
        "It was also an action that was based on solid evidence.",
        "I don’t think it’s Riku who’s the one doing this.",
        "I don’t think he’s enough to get the TV stations to act like this.",
        "If that’s the case, who is pulling the strings― there was only one person I could think of who could do that.",
        "But I don’t know the motive.",
        "What would be the point of doing something like this now―",
        "“Did he take advantage of the fact that we were the talk of the town on social media…? No, to begin with, the encounter with Riku after that person… appeared… is this really a coincidence…? But if that’s the case, I don’t see any relation to the content of that person’s first appearance in front of me…”",
        "“Akito-kun…?”",
        "What in the world is the purpose of this?",
        "And as I was pondering what to do next, Charlotte-san looked at me anxiously.",
        "I gently pulled her hand away and took out my phone.",
        "“Sorry, I need to contact someone!”",
        "I knew I had to get confirmation right away, so I hurriedly left Charlotte-san and called someone.",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Afterword: So that’s the bait that just happened. Most likely Akito would be going to the Ojou-sama after contacting. Still, what’s the motive? Smh, I have to wait for weeks again before the next update.",
        "Moreover, we have started to work on a new romcom cohabitation-like series! I hope you guys give it a read. There’s 8 chapters as of writing this afterword that I have translated and is currently at chapter 15 in the raws. If you’re curious, please read it here.",
        "Also, Matsu only needs $46 to finish his Ko-Fi goal. Please help him finish his goal to buy a new phone for editing! He and I would very much appreciate it! Thank you always for the support of our translations~!"
    ]
}