{
    "id": "chapter-117",
    "title": "Not the Best Ending",
    "content": [
        "Translator: AJ1703",
        "(**Akihito’s POV**)",
        "“I will not accept this…! This kind of ending, I will never accept it…!”",
        "President Himeragi resisted, ugly and desperate.",
        "It was as if he was afraid that if he broke down at this point, it would be the end of everything.",
        "Kanon-san’s grandfather, who appeared with Charlotte-san’s mother, still said nothing.",
        "It was Kanon-san who opened her mouth.",
        "“Originally, the bet was to free me and Akihito. But while the bet was in progress, something happened that we did not anticipate.”",
        "Kanon-san glances at me as she says this.",
        "First of all, there is no doubt that the world is in an uproar right now.",
        "“The bad reputation of the Himeragi conglomerate is spreading quite widely at the moment. It must be affecting the sales of each company. You are responsible for causing that to happen.”",
        "Apparently, the original bet was exactly as Kanon-san said it was.",
        "What changed was probably the idea that he came up with when we became the talk of the town on social media.",
        "So we decided to get the TV stations involved and push President Himeragi into a corner.",
        "Because of this, he wouldn’t be able to touch us in the future.",
        "I guess the way the story went, they promised to let President Himeragi off the hook if I didn’t choose Charlotte-san.",
        "“If I step down, who will take over…? No one will follow you, you don’t know anything about society…”",
        "“Don’t worry, your grandfather will act on your behalf until I take over. This was officially decided at the shareholders’ meeting.”",
        "When Kanon-san answered, his grandfather nodded his head.",
        "I don’t know the details of the shareholders’ meeting, but normally, everyone would follow the words of President Himeragi, the head of the board.",
        "However, the presence of his grandfather meant that he was in fact the top executive.",
        "Besides, President Himeragi has been involved in some scandals, so I think it is clear which side he will take.",
        "“I…! Even though I have done so much for the company…! And yet, you’re treating me like this!?”",
        "President Himeragi desperately pleads.",
        "However, his words did not reach Kanon-san.",
        "Then, Grandfather, who had remained silent until now, slowly opened his mouth.",
        "“Where did I go wrong… In this competitive society, it’s fine to take measures to rise to the top. But no one will follow a man who thinks only of taking advantage of others. The fact that he was betrayed by his own daughter is proof of that.”",
        "“Dad…”",
        "As response to the grandfather’s words, President Himeragi turned his head down.",
        "I knew it, he still had high respect for the grandfather.",
        "Kanon-san, who had seen that, took my and Charlotte-san’s hands without saying a word to his father.",
        "“I’m sorry I’ve been doing this behind your backs without you guys knowing. Let’s talk about the details in my room.”",
        "“Was this really okay…?”",
        "“It’s probably not the best thing to do. Maybe Akihito could have come up with a way that no one would be unhappy. But I am sorry. I had no choice but to choose this ending.”",
        "She couldn’t choose― maybe it was because of the environment she was in.",
        "It is not easy for a child to defy her parents.",
        "It would be next to impossible for a major conglomerate.",
        "But she worked hard for my freedom and her own.",
        "I think she was probably just doing it for me, not for herself.",
        "She has always been like that.",
        "“Well then, would you please go to my room with Onee-sama first? I still have some things I have to do here. I’m sure that the cute little angel will be waiting for you while she sleeps.”",
        "At Kanon-san’s urging, I moved with Charlotte-san and her mother to Kanon-san’s room.",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Afterwords: Please stop asking when on comments section when I will release next part and saying you’re impatient, I already have said why I can’t TL much. If you’re really feeling impatient then just look for the raw yourself and read it with google translate, let’s see if your mind can take it smh my head."
    ]
}