{
    "id": "chapter-64",
    "title": "Proof I'm Not a Lolicon",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "“Yes, it’s fine. You two are good friends.”",
        "This message was sent from Shinonome-san while I was putting Emma-chan to bed.",
        "After school, I checked with her on the chat app, and she had noticed that Akira and I had switched the papers.",
        "Apparently, he had witnessed Akira secretly replacing the paper.",
        "She doesn’t seem to mind, but there are no emoticons in today’s exchange…",
        "Most importantly, this reply was also late.",
        "“Yes, thank you.”",
        "But there was nothing I could do about worrying about what had passed, so I thanked her honestly.",
        "If it had been another student who had seen this, they would have immediately told Miyu-sensei.",
        "It was because Shinonome-san was so kind that she didn’t say anything.",
        "―Huh?",
        "I stopped watching Emma-chan’s sleeping face and was about to go back to Charlotte-san when I got a message notification on my phone again.",
        "I thought we were done communicating, but had she sent me a good night message?",
        "I thought so and checked the contents―.",
        "“The truth is, I wanted to be paired with Aoyagi-kun, too. (´・ω・`)”",
        "The message was written in a way that made me feel extremely guilty.",
        "If it were true, Shinonome-san and I would have been paired up, and she knows it.",
        "After all, Akira, who had switched papers with me, had become Shinonome-san’s pair.",
        "Well, she says she wanted to be paired with me because we are more familiar with each other than the other students.",
        "It’s not in a romantic sense.",
        "“―You’ve been communicating with Shinonome-san since yesterday, haven’t you?”",
        "“―Wha!?　Cha-Charlotte-san!?!? When did you get behind me…?”",
        "As I was about to reply to Shinonome-san, Charlotte-san, who was supposed to be preparing a manga for me to read, was standing behind me.",
        "Her cheeks were puffed up and she was sulking by all accounts.",
        "I’m not sure why, but I feel like I’ve seen Charlotte-san sulking all the time lately.",
        "“Ah… Well, I was just apologizing for something that happened today.”",
        "“About today…? Could it be that you’re referring to the tripod pair lottery? Aoyagi-kun and Saionji-kun exchanged papers, and originally Aoyagi-kun’s pair was Shinonome-san…”",
        "How did she arrive at such an answer just by saying that it happened today…?",
        "That’s not possible.",
        "Could it be that Charlotte-san also saw Akira switching my lottery paper?",
        "The only other thing I can think of is that she knew my number and Akira’s number beforehand and she noticed it because they were switched― but she didn’t have a chance to find out until the announcement though…",
        "And the fact that she knows that he switched them means that she probably thinks that I switched them because I wanted to pair up with Charlotte-san, right?",
        "In other words, she probably knows that I like her…",
        "“………….”",
        "“Cha-Charlotte-san…!?!?”",
        "As I was going through my thoughts in my head, Charlotte-san came closer to me again.",
        "She didn’t say anything, but her eyes were moist and she was staring upwards at me.",
        "She was so cute that I felt like my head was going to explode, but I guess she had something to say.",
        "“Erm, is there something wrong…?”",
        "“Aoyagi-kun… Between me and Shinonome-san… Who do you really want to be paired up with…? I knew it was going to be Shinonome-san who was small and had a baby-like face, right…?”",
        "The words that came out of her mouth weakly were quite unexpected.",
        "…Wait a minute.",
        "Why are you asking me this question?",
        "Doesn’t the fact that you care about these things mean that you like me no matter what I think?",
        "After that, what’s the point of asking me if I would have preferred “the small, baby-faced Shinonome-san”?",
        "You’re assuming that Shinonome-san, whose eyes are hidden by her bangs, has a baby face, but aren’t you completely mistaking me for someone who likes young children?",
        "“Cha-Charlotte-san! One thing you seem to have misunderstood is that I’m not a pedophile, okay?”",
        "“But you do like Emma-chan a lot.”",
        "“That’s because she’s sweet and cute, and I don’t see her in a sexual way, so that doesn’t make me a lolicon, okay?”",
        "“Mou~…”",
        "Why is she puffing out her cheeks even more?",
        "It’s as if she doesn’t believe me.",
        "“Why wouldn’t you believe me?”",
        "“Ask your chest preferences.”",
        "You think I’m trying to make you think that?",
        "But I don’t have any idea…",
        "The best way to prove it is to confess to Charlotte here.",
        "If I tell her that I like her and that she doesn’t look like a lolita at all, the misconception that I’m a lolicon will soon be cleared up.",
        "However, this would be an act of self-destruction.",
        "If I were to be rejected, our relationship would be over at that point.",
        "Above all, if I’m going to confess, I want to do it in a good atmosphere.",
        "At the very least, it’s not something you do out of emotion to clear up a misunderstanding.",
        "“―Next Saturday, we’ll go out together, right? I’ll prove it to you then that I’m not a lolicon. So why don’t you just trust me for now?”",
        "After thinking about it, I told Charlotte-san with a serious expression on my face.",
        "It may seem like delaying things, but we’ll settle this on Saturday.",
        "In fact, I think this is the best that we can do right now.",
        "“Eh…? Then that means…”",
        "The smart girl might have understood what I was trying to do by clearing up the lolicon misunderstanding during our date this Saturday.",
        "Suddenly, she turned her head down, her face turning bright red.",
        "Then, for some reason, she hugged my arm tightly again.",
        "As she hugged me, I couldn’t say anything else because of her cuteness and embarrassment."
    ]
}