{
    "id": "chapter-66",
    "title": "I Want to Know More About You",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "“Haa~… Haa~… It’s time to stop, I have to get ready…”",
        "I breathe on my shoulder, holding my aching chest with my right hand.",
        "The reason I’m so tired is because I’ve been running since early in the morning.",
        "At first glance, it may seem pointless for me to run as I am not a member of an athletic club.",
        "But there was a purpose to it.",
        "About a month later, our school was going to have a sports festival.",
        "I was chosen to be a member of the relay team.",
        "But even so, I’m sure people will think “It’s just a sports festival…”",
        "I’m sure I wouldn’t have gone as far as I did.",
        "The reason why I’m doing this― is because I don’t want to show Charlotte that I’m imcompetent.",
        "…No, I think it’s because I want to show her how cool I am.",
        "Everyone wants the person they love to see them in a good light.",
        "That’s why I’ve been running since the day after I was selected as a relay member.",
        "One month is more than enough time for me to get my body back into shape after I quitted training.",
        "My goal is to break my best time of 6.1 seconds in 50 meters, which was my best time in middle school.",
        "That time came out in the summer of my eighth year of middle school.",
        "I still remember that it was a pretty fast time for a second year middle school student.",
        "I was even beating Akira at the time.",
        "But now, it’s about 6.5 seconds.",
        "I think I’m still in shape even though I quit exercising after my second year in middle school… If possible, I’d like to break my 6.1 seconds record.",
        "Akira, even though he’s a first year high school student, managed to go under 6 seconds…",
        "Well, I need to go back and get ready now… or else…?",
        "As I picked up my sweatshirt and windbreaker, which I had folded on the bench, I caught sight of a girl hiding behind a wall, looking at me.",
        "She had long, beautiful silver hair that she wore straight down, and she was looking at me with moist eyes.",
        "How long has she been there…?",
        "“Ah―Good morning, Aoyagi-kun.”",
        "As if she thought it was useless to hide anymore, Charlotte-san greeted me as if nothing had happened and walked to my side.",
        "But her cheeks were slightly red, and she started glancing up at me as if she was expecting something.",
        "As I stared at her, wondering what was wrong, she began to fidget and play with the hem of her mini-skirt and her hair.",
        "Could it be that she wanted some feedback on her outfit?",
        "Right now she was wearing a dark blue denim jacket over a white sweatshirt and a black miniskirt.",
        "It’s so cute that I can’t help but admire it, but Charlotte-san, isn’t this kind of outfit a little bit cold for you…?",
        "It’s rather hot right now because my body is warm, but when I went outside in the morning, it was so cold that I couldn’t believe it was autumn.",
        "I’m sure it will warm up by noon, but with the miniskirt and the jacket seemingly too thin, I’m sure it will get colder at night.",
        "“Good morning, Charlotte-san. You look great in those clothes.”",
        "“Ah…yes, thank you very much!”",
        "I didn’t mention that I thought she looked cold, but I honestly complimented her on her outfit.",
        "It was not as if I could say she was cute, but Charlotte-san smiled happily when I complimented her on her outfit.",
        "Apparently, I was right.",
        "Well, that aside, I don’t want to get close to Charlotte-san because I’m sweating a lot right now.",
        "I should take a quick bath to wash off the sweat and then meet her at the meeting place.",
        "“So, Charlotte-san, I’ll see you later―”",
        "“Eh…? Where are you going…?”",
        "“…………”",
        "◆",
        "“―W-well then, I’m gonna go and remove the sweat…”",
        "“Y-yeah…! Take your time…!”",
        "When I called out to her, a nervous Charlotte-san answered me with a tight smile.",
        "To be honest, I’m feeling quite regretful at the moment.",
        "After all, I had brought Charlotte-san into the house when I was about to take a bath.",
        "The reason I brought her here was because when I was about to leave her, she looked at me with eyes like an abandoned puppy, and I couldn’t help but ask her if she wanted to come with me so I asked her anyway…",
        "Since our rooms are next to each other, we should be able to go home at once, but there seems to be a reason why she doesn’t want to go home.",
        "It’s still cold outside, and I’m not comfortable leaving her alone in the cold.",
        "So this was an unavoidable response.",
        "It’s not that I’m expecting anything.",
        "I made an excuse in my mind to someone from somewhere, and headed for the bathroom.",
        "―When I got out of the bath, I saw Charlotte-san looking very nervous.",
        "Her cheeks were bright red, even though she had been in my room many times before and we had been alone together.",
        "It seems that even she is concerned about the fact that the other person is taking a bath when we are alone.",
        "“―Erm, I’m done.”",
        "“―Ah!?”",
        "A few minutes later, after I had taken a bath― or rather, a shower, I called out to her, and Charlotte-san’s body trembled, and she looked up at me fearfully.",
        "I feel like this atmosphere is just like before we did that…",
        "I didn’t dare to put it into words, but all I could think of now was what a man and woman in a relationship would do.",
        "Charlotte-san’s cheeks are still bright red and she still glances at me shyly, so I can’t blame her for thinking of that.",
        "After all, I’m a healthy boy too.",
        "“Ah… Umm… Are we going out now, or wait until it’s time…?”",
        "Perhaps the silence was too much for her, so Charlotte-san opened her mouth.",
        "It was past eight in the morning.",
        "The trains were running, but most of the stores were not open yet.",
        "I really wanted to take her to the amusement park, but with the way she was dressed, it would be better to avoid making her stand in line for a long time outside.",
        "I’m sure she’ll catch a cold if she stays out in the cold in these light clothes.",
        "So we had to kill a little more time because we had to change our plans suddenly and go to Kurashiki for a shopping date.",
        "Incidentally, I hadn’t told Charlotte-san about the amusement park, and she had left it entirely up to me to decide where to go today.",
        "“For the time being, let’s just stay here until it’s time.”",
        "I didn’t have anything else to do, and I didn’t want to be spotted by my classmates walking outside.",
        "So I thought it would be better to stay in my warm room until time.",
        "“I-If that’s the case― can you tell me more about yourself Aoyagi-kun…? I want to know how you lived, what you did, and what I don’t know about you. I want to know more about you, Aoyagi-kun.”",
        "Charlotte-san, whose cheeks were still dyed red, somehow snuggled herself against my body and put her hands on my chest as if begging me for a favor.",
        "I gasped when she looked at me with her red face and moist eyes.",
        "My heart is beating so loudly that I feel like it’s going to burst at her unexpected behavior.",
        "I wonder if she can hear my heartbeat.",
        "I’m worried about that, but since she’s pleading for me, I decide to take this as an opportunity to tell her my story.",
        "The air might get a little heavy, but if it looks bad, we can switch to a date right away.",
        "―I slowly closed my eyes and thought back to the past as I prepared to tell her about my past."
    ]
}