{
    "id": "chapter-126",
    "title": "I Didn't Want to be Seen (Despair)",
    "content": [
        "Translator: AJ1703",
        "(**Akihito’s POV**)",
        "“My freedom, you said…?”",
        "“Not every child who was born into a big family is blessed. They have to live for their families in order to return the benefits they received from their families. Political marriage would be one of them.”",
        "That was certainly something I was prepared for.",
        "Rather, I was trying to atone for my sins towards Kanon-san by becoming a member of the Himeragi Conglomerate and serving the Himeragi family.",
        "Besides, I was also raised with money from the Himeragi Conglomerate, albeit via Kanon-san.",
        "I don’t have any right to say anything about it.",
        "“Becoming the fiancé of Charlotte-san would also mean that you would end up officially joining the Himeragi family, which would mean that you would be made a puppet of my father. That would mean nothing.”",
        "Even though Kanon-san’s side had prepared a partner for me, it was after all a political marriage, and I had to obey President Himeragi’s words afterwards, I suppose.",
        "It seems that she worked to prevent that from happening.",
        "Kanon-san is as kind as Charlotte-san.",
        "She is a person who is willing to do things for me even if she has nothing to gain― or even if she loses something.",
        "So I highly respect and cherish her.",
        "“What was the bet again?”",
        "“Which would Akihito choose, his own interests or his girlfriend?”",
        "“…Please wait, I have two questions that I have to ask.”",
        "Kanon-san smiled at me, but I felt a cold sweat running down my back.",
        "“The day after we started going out, Arisa-san came to my place, right…?”",
        "Yes, how could I forget?",
        "The day after I started going out with Charlotte-san, Arisa-san came to my room.",
        "“Ah~ well, that’s something else.”",
        "But Kanon-san tried to change the subject with a smile.",
        "I started to sweat even more.",
        "“Since when was I being monitored…?”",
        "The fact that she came the next day makes me think that I was being monitored.",
        "No, that’s indeed the part I don’t want to suspect…",
        "“Well, from the beginning, I guess?”",
        "Kanon-san answered as if she had given up, averting her gaze from me.",
        "Where exactly was the beginning…?",
        "“You mean since I started high school?”",
        "“No, ever since you started spending time with me.”",
        "“………….”",
        "Each person has something they don’t want people to know.",
        "There are many things that I don’t want people to know about me in my private life too.",
        "To think that all of this was being watched by someone and being passed to Kanon-san― there is nothing but despair.",
        "I can’t help but think that my date with Charlotte-san and my confession were also being watched.",
        "“Is there anything we can do to make you stop…?”",
        "“You are free from now on. Besides, we are going to live together, so I don’t think it’s necessary.”",
        "Then it’s… just barely safe?",
        "No, it is already hopeless.",
        "“I understand. As far as the details of the bet are concerned, it is what you and President Himeragi were talking about earlier, isn’t it? I don’t know if you made a new bet or not, but you kept the same content, but changed what you were betting on, right?”",
        "Not wanting to delve too deeply into the matter myself, I changed the subject to the other thing that caught my attention.",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Afterword: So uhh, I just finished my summer class and I only have one week again before the new semester starts, basically no break. Why did I take up an engineering course again?",
        "Well anyway, this is the latest chapter for now. The author is focused on the light novel version and is hoping that the series receive an anime adaptation one day. If you like the series, please do support him if you can by buying them. Apart from that, in one of the foreword, he mentioned starting a new yuri webnovel series. Idk if I’ll translate that someday but oh well.",
        "With that, I don’t know which of my other series I’m going to update next but yeah. Also I need a new keyboard, pls I need help, any amount would do T_T"
    ]
}