{
    "id": "chapter-112",
    "title": "You Look Better Now",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Akihito’s POV**)",
        "“Arisa-san…”",
        "I looked at Arisa-san’s face as she stared back at me with a half glare.",
        "Then Charlotte-san stepped in front of me for some reason.",
        "“Charlotte-san…?”",
        "“Um, please don’t say anything bad about Akihito-kun. He’s not the kind of person who would intentionally hurt other people.”",
        "“Hee~…”",
        "I was wondering what was going on because she suddenly stepped forward, but Charlotte-san was actually defending me.",
        "I can’t hide my surprise at the fact that the kind girl I’ve used to know has slightly bared her fangs at a stranger.",
        "Arisa-san, who had her fangs bared, was somehow impressed.",
        "Then she looked at me.",
        "“You should be thanking Ojou-sama and the others.”",
        "“Huh?”",
        "“No, it’s nothing. The ladies are waiting for you, please get in the car.”",
        "What the heck were those words?",
        "I wondered, but Arisa-san lost her intimidating atmosphere and started to guide us like a normal maid.",
        "When I looked at Charlotte-san, she looked up at me as if she was confused.",
        "If I, who knew Arisa-san well, couldn’t understand her, how could Charlotte-san?",
        "“Let’s go.”",
        "So I smiled back at Charlotte-san, trying not to worry her.",
        "Then I asked Charlotte-san to get in first.",
        "“…………”",
        "As I looked at Charlotte-san getting into the limousine, I saw Arisa-san staring at me for some reason.",
        "“What’s up?”",
        "So I call out to her, and she stares at my face with a curt expression.",
        "“Apparently, you’re looking better.”",
        "That’s all what Arisa-san said, and she quickly sat down in the driver’s seat.",
        "She didn’t wait for me to get in the car, as usual.",
        "“Akihito-kun, is there something wrong…?”",
        "“Ah, no… it’s nothing.”",
        "Charlotte-san called out to me anxiously, and I answered with a smile.",
        "We got into the limousine and the doors automatically closed and the car started to move.",
        "“Oh… there are so many dogs looking at us…”",
        "Charlotte-san was surprised to see all the unleashed dogs on the road looking at her.",
        "“They’re smart dogs, they’ll be quiet if you don’t do anything to them.”",
        "“Did Akihito-kun used to play here a lot?”",
        "“No, I don’t think I’ve been here more than a few times.”",
        "“I see…”",
        "Charlotte-san didn’t ask any more questions.",
        "Instead, she rests her head on my shoulder.",
        "Since Arisa-san and I were far enough away that I would not be disturbed, I decided to let her do as she pleased.",
        "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~",
        "Author’s Afterword:",
        "Thank you all for your patience!",
        "Finally, Tomorrow, February 25th, is the release date of “Otonari Asobi” (*´▽｀*)",
        "I hope many of you will be able to get your hands on it!",
        "It has some of the best illustrations I’ve ever seen.",
        "I hope you guys could support me by reading it!",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Afterword:",
        "Yep, I have translated “Otonari Asobi” as I successfully managed to pick up the series, I had to put it into parts since it’s like more than 80 pages long for the first chapter and it was almost midnight when I got the raws, so I had to resort to cutting it into parts, again I’m sorry about that. I hope you guys would also read the light novel version and sensei wasn’t lying when he said it had good illustrations.",
        "As for my predictions from tens of chapters ago, it seems that thanks to Arisa-san’s behavior, aka the maid, my theory about Akihito and Charlotte are the ones getting married off here seems more plausible now.",
        "Also, I just realized when I was TL-ing the Light Novel version of this series, it was supposed to be Akihito Aoyagi, not Akito. I’m very sorry for only noticing it this late into the series. From this chapter on, I would now be putting Akito as Akihito. I know, it’s a major mistake since it’s the main character’s name and I am very sorry about that.",
        "You may buy the light novel raws as support for the author by clicking here."
    ]
}