{
    "id": "chapter-45",
    "title": "The Silver-Haired Young Girl Who Wants to be Spoiled",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "“How is it, Onii-chan?”",
        "Emma-chan, who visited my room again after returning to her own room once, asked me with her arms outstretched and her head tilted.",
        "The meaning of Emma-chan’s open arms this time around was not that she wanted me to hold her.",
        "She was holding her arms out for me to see, showing off the outfit she was wearing.",
        "“Yes, it’s very cute.”",
        "I told her frankly my impressions as I saw them.",
        "The dress Emma-chan was wearing was a pink-based dress with white fluttering.",
        "Her shoes were also pink to match her outfit.",
        "It was a perfect combination for the young Emma-chan.",
        "The Emma-chan of today is as cute as a fairy in a fairy tale.",
        "If anyone says she doesn’t look cute, I suggest they should visit an ophthalmologist immediately.",
        "The only thing I’m curious about is why she’s wearing a cat ear headband.",
        "She hadn’t worn it before, but once she went back to change her clothes, she wore a silver cat-ear headband that matched her hair color.",
        "She’s a very cute little girl, so it suits her well, but I’m not sure I want her to go out like this.",
        "Charlotte-san may have made her wear it as a hobby, but I’m sure people will think that I made her wear it.",
        "I’m afraid that I might be accused of something terrible.",
        "“I understand that you want your little sister to wear cat ears because she’s cute, but can you please not do it today…?”",
        "“W-wait a minute! You made it sound like I was making her wear them!”",
        "I didn’t say it as if, I meant exactly what I said…",
        "Judging by her reaction, Charlotte didn’t make her wear it, did she?",
        "“I don’t know when she got it, but she’s taken it upon herself to wear the cat ear headband! She seems to like it so much that she insists on wearing it too!”",
        "“I see…”",
        "Perhaps she didn’t want me to think that she had a hobby of wearing cat ears, but Charlotte tried hard to explain.",
        "But I know this from our recent relationship.",
        "Charlotte-san is very fond of cat ears and other animal ears.",
        "…Well, let’s not talk about that right now.",
        "More importantly, it is now about Emma-chan’s cat ears.",
        "I’m curious as to when she got them, but I don’t know if she’d be able to explain it properly if I asked her.",
        "I’m not particularly troubled at the moment, so if there’s a time when I can ask her later, I’ll just ask her.",
        "The problem is that Charlotte-san won’t listen to me, which means it’s practically impossible to get Emma-chan to take off her cat ears.",
        "What should I do now―?",
        "I glanced over at Emma-chan.",
        "Then Emma-chan reached for her own cat ears and was happily playing with them.",
        "…Let’s just hope we don’t run into anyone who knows us.",
        "After deciding that it was impossible to get her to take off her cat ears, I prayed to the heavens that I would not see anyone I knew.",
        "I know that praying won’t work, but I can at least pray for comfort.",
        "The only thing I can do is to go far away so that we don’t see anyone we know.",
        "Originally, I was planning to go far away because if anyone saw me hanging out with Charlotte-san, I would be out of luck.",
        "So there was no particular problem.",
        "I’ll just get some strange looks from people passing us by…",
        "“―Hmm. Onii-chan, hug me.”",
        "As I was thinking while feeling half-heartedly resigned, Emma-chan came to my feet and tugged on the sleeve of my clothes.",
        "It’s true, this girl is always looking for a hug.",
        "It’s okay, though, because she’s so happy and cute when I give her a hug.",
        "“Emma, that’s no good. Have a little patience.”",
        "When I tried to hold Emma-chan, Charlotte-san unusually intervened.",
        "She’s been in resignation mode these days, letting her do as she pleases, but has she changed her policy?",
        "Emma-chan, who was interrupted by her older sister, looked up at Charlotte-san with a dissatisfied expression.",
        "The expression on her face felt like she was saying, “Why are you bothering me?”.",
        "“If you really want to be carried, I’ll do it instead. So don’t ask Aoyagi-kun to carry you anymore.”",
        "“No…!”",
        "This time, when Charlotte-san tried to hold Emma-chan, she ran away from Charlotte-san’s hands.",
        "And then she walked past Charlotte-san and attached herself to my leg.",
        "“Mou~…! If you behave like that, I’ll never give you a cuddle again!”",
        "It must have been a shock to be avoided, indeed.",
        "Charlotte-san was pouting and got angry again.",
        "“Onii-chan… Lottie is being mean to me…”",
        "I’m not sure if it’s because Charlotte-san is angry, Emma-chan appealed to me with her woozy eyes.",
        "When a teary-eyed little girl stares upwards at you, it looks somewhat like a small animal crying to you.",
        "To be honest, my protective desire was stimulated.",
        "“Umm, Charlotte-san. Since Emma-chan is still very young, let’s forgive her for a little bit of selfishness.”",
        "“Ah, you’re making me look bad too, Aoyagi-kun…!”",
        "When I took Emma-chan in my arms to protect her, Charlotte-san gave me a shocked look.",
        "Her face instantly darkened and tears welled up in her eyes.",
        "“Ah, no, that’s not it! I think what Charlotte-san is saying is right! But we should let young children grow and develop…!”",
        "I hurriedly followed up with Charlotte-san, who was more hurt than I expected.",
        "But Charlotte-san’s expression did not return to normal.",
        "Instead, her cheeks puffed up even more, as if it was about to burst.",
        "“Aoyagi-kun is always like that… You’re always favoring Emma…”",
        "Wow, Charlotte-san, I didn’t know you felt that way…",
        "It’s true that I’ve always given priority to Emma-chan because she’s so young.",
        "She didn’t mind because she herself put Emma-chan first as well, but I guess she thought differently about what she did and what others did to her.",
        "Thinking about it, she did look lonely sometimes.",
        "I regret now that I should have thought more about her and said and done more for her.",
        "“Erm, I’m sorry…”",
        "“―Ah… No, that’s…. I’m sorry too… It’s nothing. Please don’t worry about it.”",
        "I apologized to her, and Charlotte-san gave me a flabbergasted look and apologized back.",
        "Then she smiled as if to mend it.",
        "I rushed to mend my ways, but it was too late.",
        "I couldn’t help but feel that I had let my true feelings slip out.",
        "Just as I had thought, she is usually holding back and making up for it.",
        "In the future, I will pay more attention to Charlotte-san’s subtleties so that I can understand her feelings.",
        "“I’m sorry…”",
        "I don’t know if it was the sad expression on Charlotte-san’s face or the fact that we were apologizing to each other, but Emma-chan, who was in my arms, also apologized to Charlotte-san.",
        "She’s a bit selfish in some ways, but if she can apologize properly, she’s probably fine.",
        "She’s also very smart for such a young girl.",
        "I’m sure she’ll grow up to be a great kid.",
        "I felt a strange warmth in my heart as I realized that the cute and precious being in my arms would grow up to be a great child.",
        "―But I also thought, <<I may not be able to stop spoiling this child…>>",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Comments: It seems that I got exhausted from the 12 chapter release yesterday, no worries I’ll get back on my feet tomorrow. I’d probably caught up with the other TL’s progress by then. Help me reach my $200 laptop Ko-Fi goal if you guys have anything to spare, any amount will do, thanks~"
    ]
}