{
    "id": "chapter-67",
    "title": "The Onee-san of My Dreams",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "“I’m originally an orphan.”",
        "Remembering the past, I slowly told Charlotte-san about my past.",
        "“An orphan, you say…?”",
        "“Yes. When I was still a baby, I was abandoned in front of a facility― I think they call it an orphanage nowadays. I heard that I was abandoned in front of the orphanage. One morning, when the people at the orphanage went outside, they found a cardboard box in front of the orphanage with me inside, wrapped in a blanket.”",
        "“That’s…”",
        "Charlotte-san was already staring at me miserably, even though we had just started talking.",
        "I knew I should stop talking about this…",
        "As I closed my mouth, Charlotte-san suddenly took my hand in hers.",
        "I’m not sure what she was thinking when she grabbed my hand, but she was looking straight into my eyes while looking pained, so I guess she wanted me to tell her the rest.",
        "“I don’t resent my parents for abandoning me. The people at the orphanage were kind to me, and I believe that I am the person I am today because I was orphaned.”",
        "“What do you mean by that…?”",
        "“The orphanage I went to was a small one with less than ten children. So when I started going to elementary school, I was bullied at school because there were no other kids from the same institution.”",
        "“Bullied… Aoyagi-kun was…?”",
        "Charlotte-san looked at me as if she couldn’t believe it.",
        "I guess it’s hard to imagine because things were so different then.",
        "“Just because you don’t have parents, you can become a target of bullying. Children can be cruel because they are so innocent, and they don’t know what’s right from wrong.”",
        "It’s only now that I can talk calmly like this, but I remember how painful it was at the time.",
        "It wasn’t my fault that I was orphaned, so why should I be treated so badly?",
        "I used to cry in the park thinking about that.",
        "―It was around that time that I met that person.",
        "“What happened next, Aoyagi-kun…?”",
        "“Yes… Around that time, I met a person in the park. She approached me when I was crying and was very kind to me.”",
        "I thought back to that time with nostalgia.",
        "She was a foreigner who had just arrived in Japan for work.",
        "And she looked a lot like Charlotte-san.",
        "Her elegantly standing gesture.",
        "She had long, straight, silvery, beautiful hair.",
        "She had a cute smile that showed her friendliness.",
        "Her voice was clear and grating.",
        "When I first met Charlotte-san, I thought she was my ideal girl because she was like that Onee-san who introduced herself to me. [TLN: Onee-san could mean older woman / older sister, but in this case it would be the older woman.]",
        "At the time, I was longing for an Onee-san who would be kind to me.",
        "I think that’s why I fell in love with Charlotte-san at first sight.",
        "But of course, I was also attracted by her own charm.",
        "I feel happy to be with her now because she is such a wonderful person.",
        "It wasn’t just about the Onee-san anymore.",
        "“Was it because you were comforted by her that Aoyagi-kun was able to remain unfazed?”",
        "“Umm, no. The Onee-san told me, ‘If you are going to be bullied, study and exercise hard and become the best. If you do that, no one will be able to bully you. In fact, I’m sure they’ll want to be friends with you.’ After that, she taught me English. I had a hard time learning it at first, but even after I learned how to say hello, my classmates were surprised and some of them tried to make friends with me. Most importantly, as the Onee-san said, I made an effort to be as good as anyone in my studies and sports, and before I knew it, no one was harassing me anymore.”",
        "“…The one who was comforting Aoyagi-kun, that Onee-san…”",
        "For some reason, when Charlotte-san heard my words, she smiled bitterly.",
        "Is that where she’s supposed to react?",
        "I’m sure there are more things to worry about…",
        "“In order to avoid being bullied, you kept working hard, that’s why you’re good at studies and sports, Aoyagi-kun?”",
        "“Hmm, that’s not it either.”",
        "I shook my head as Charlotte-san asked me as if she had regained her composure.",
        "Once a child has established a position, it’s hard to shake it.",
        "So, once I was no longer being bullied, there would have been no need for me to work harder.",
        "But there was a reason why I had to work even harder.",
        "“That Onee-san used to come to the park with me everyday after she finished her work, but one day she had to say goodbye.”",
        "“She said goodbye…?”",
        "“Yes. I think it was about a year after we met. She was a foreigner, and she was only in Japan because of a business trip, which is why she had to go back to her own country.”",
        "“Sure, that happens sometimes…”",
        "“Yes, it does. That’s when I made a promise to that Onee-san that I would be a respectable man by the time we met again.”",
        "It was a childish promise.",
        "I wanted her to look at me properly and not treat me like a child.",
        "It was with this in mind that I made the promise to that Onee-san at the time.",
        "“It’s a wonderful promise.”",
        "Charlotte-san gazed at me with very kind eyes.",
        "She looked up at me with her reddened face, and I felt a little embarrassed.",
        "“Well, I couldn’t keep my promise after all.”",
        "I said I was going to be a great guy, but now I’m the object of contention in our class.",
        "I think that Onee-san would be sad if she knew about this.",
        "―That’s what I thought at least.",
        "“No, Aoyagi-kun, I think you’ve kept your word very well.”",
        "My words were denied by Charlotte, who had a gentle smile on her face.",
        "“Eh?”",
        "“Aoyagi-kun is a very nice person. I think you’re the most wonderful person I’ve ever met, at least.”",
        "That was all Charlotte-san said, and then she huffed and turned over, as if realizing what she had said.",
        "But her body never leaves mine, and her hand is still holding mine, but with a little more force.",
        "I can see a little bit of her profile, which is stained red, but I’m sure it’s the same for me.",
        "“U-umm, Charlotte-san, it’s still a little early, but should we go now?”",
        "I couldn’t stand this atmosphere anymore and decided to proceed with the date.",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Comments: Obviously, that Onee-san would be Charlotte’s Mother."
    ]
}