{
    "id": "chapter-137",
    "title": "Bedtime Fun",
    "content": [
        "Translator: AJ1703",
        "(**Akihito’s POV**)",
        "“Charlotte-san, don’t you want to go to sleep?”",
        "Even though she said she was going to sleep and got into bed, I don’t think she really intended to go to sleep like this.",
        "But I made sure of that.",
        "“It would be a shame to fall asleep…”",
        "Charlotte-san answered with moist eyes, as if she was expecting something.",
        "She moves her hand as if searching for something in the bed, and when she finds my hand, she slowly intertwines her fingers with it.",
        "Then she gave me a tight, nibbling grip.",
        "…Is this rushed?",
        "To be honest, I don’t know to what extent I am in agreement with Charlotte-san in my perception.",
        "Even though I have come to live with Sophia-san and her family, I wonder when the next night will come when Emma-chan is not around.",
        "Not only me, but Charlotte-san doesn’t know that either.",
        "I have not locked the door so as not to arouse suspicion, but if Charlotte-san is willing to do so, I need to go and lock the door just in case.",
        "What exactly is the situation?",
        "I look at Charlotte-san with this thought, but she seems to be enjoying the situation of playing with her hands.",
        "She seems to be very happy or satisfied, so I feel awkward to interrupt her.",
        "Yeah, I don’t think I should interrupt this, I guess…?",
        "With that, I decided to wait until Charlotte-san was satisfied.",
        "“Hands, hands…♪”",
        "She genuinely seems to be having a good time.",
        "Or rather, she is just happy.",
        "I felt like I could just let her do whatever she wanted until she went to bed.",
        "Then, as I was thinking about it―.",
        "“Ah…”",
        "Charlotte-san, who seemed to have come to her senses, looked at me as if she had noticed something.",
        "Apparently, she had been absorbed in it.",
        "“………….”",
        "She was probably embarrassed.",
        "Charlotte-san turned her head down while holding my hand.",
        "Honestly, it’s too cute and it’s bad for my health.",
        "I just wish she’d love me more.",
        "“It’s fine, you can keep going.”",
        "“…You meanie.”",
        "When I urged her to continue, Charlotte-san puffed out her little cheeks and looked at me like she wanted to say something.",
        "I wasn’t trying to be mean though…?",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Afterword:",
        "First of all, happy new year everyone! Here’s to hoping that 2024 would be a better year for us all. I was too tired to TL during new year’s eve so to compensate, I just TL’d every chapter remaining which means that this is the latest chapter.",
        "I’ll try to release a JitsuImo chapter as someone had requested for me to TL it. Nekokuro-sensei had 4 series mentioned but I just felt like not translating their afterword since it’s mostly fantasy and absurd ones. They are completed as well, but I only TL’d one of the afterword that mentioned it in the past because I was curious about it. I’ll probably do the other ones as well if I get more time.",
        "If anyone’s curious to the convention I went to during December 30, here’s a pic of me with a Ryuuge Kisaki cosplayer from the gacha game Blue Archive. It felt like I won on this picture lmao.",
        "Anyway, like I have already said before, I hate to ask of this but I hope there’s a kind person out there that could help me for buying my medications and vitamins so that I could recover fully. Any amount would do, or if you really can’t, I just suggest to read our novels without adblock. I promise that it’s not annoying unlike some other websites that redirect you and stuff. Most of the ads from my personal experience well are just embedded on the website itself. Thank you all as well for reading my translations. Join our discord server by clicking here and feel free to talk to me~ (I am mostly fine with anything)."
    ]
}