{
    "id": "chapter-94",
    "title": "I'm Not That Bad Either",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Charlotte’s POV**)",
        "“I’m sorry, but I still can’t go back.”",
        "I knew Akito-kun would refuse the invitation.",
        "He’s surprisingly stubborn when it comes to himself.",
        "When I told him about tending to be the villains for the sake of everyone, he just smiled at me as if he was troubled, but I couldn’t get him to change his mind.",
        "He is such a determined person.",
        "Probably, to change his mind, he would have to be convinced in a way that would hurt him.",
        "If it were someone else like us, they would easily change their mind and move on, but this person is really troublesome.",
        "However― It seems that this time, his reasons were different from what I had expected.",
        "“How long do you have to be tied to the past―!?”",
        "“Sorry, Riku… But it’s different this time.”",
        "“Eh…?”",
        "When he heard Akito-kun’s answer, Riku-san started to get angry again― and Akito-kun only gave him a troubled smile.",
        "Instead of the powerless smile of earlier, he scratched his cheeks with his fingers with a hint of regret.",
        "For some reason, I could sense a strong will in his eyes.",
        "I could see that it had a completely different meaning from the smile I had seen before.",
        "“You’re right, the situation right now that I’ve stopped playing soccer may not be making up for anything.”",
        "“If you know that, why do you still want to keep doing the same thing…?”",
        "“Because there are things that I have to prioritize above everything else right now.”",
        "When he said that, Akito’s face was different from before, and he had a really gentle smile.",
        "It looks like he’s completely blown away.",
        "“What is that…?”",
        "“It’s about her. She’s the most important thing to me right now.”",
        "“”―!””",
        "The moment I heard those words, Riku-san and I both gasped.",
        "And I listened to Akito-kun’s words with more foreboding than before.",
        "“If I play soccer, I won’t be able to devote as much time to her as I do now. On the contrary, if I’m not good at it, I won’t even be able to see her. Isn’t that what Riku is trying to suggest?”",
        "Akito-kun asked Riku-san with a gentle smile on his face.",
        "Riku-san looked away from the question as if he was embarrassed.",
        "“Ah… well, you might be right. The team I can introduce you to is the youth team in Hiroshima. Because I know the coaches myself and the coach of my current team thinks highly of you. As long as you regain your senses and produce results, you should be able to play on the same team as me right away.”",
        "I guess being on the same team as Riku-san means that he can become a professional.",
        "It would not normally be that easy, but I wonder if it has to do with Akito-kun’s past achievements and the fact that the manager of the current professional team thinks highly of him.",
        "If Akito-kun comes to Hiroshima… I would like to support him, even if we have to be separated, since that’s what he wants.",
        "It’s not a serious problem, since I can see him every day if I take the bullet train.",
        "It’s just that… it will be impossible for us to be together from morning till night.",
        "…Akito-kun, could you please wait until I graduate…?",
        "That way, I could follow along with you.",
        "―I was relieved that Akito-kun did not seem to be planning to choose a professional career, although I was thinking about such a bad thing.",
        "I’m so glad that you said that I’m the most important person in your life.",
        "“To be honest, in the situation I’m in now, I’m very grateful for having this offer that will lead me to a great future.”",
        "Akito-kun said with a troubled smile on his face.",
        "After all, he seems to be in some kind of trouble right now.",
        "I wondered what was troubling him, and my curiosity increased.",
        "“But you know, if I have to leave her now, I can’t choose that path.”",
        "“What’s really wrong with you? You’re completely preoccupied with her.”",
        "“Is that so strange?”",
        "“No, I don’t know… I’ve never had a girlfriend… It’s just that I don’t think most people would turn down the possibility of going pro just because they want to be with their girlfriend…”",
        "Riku-san tilted his head with a very confused expression at Akito-kun, who chose me over the path to becoming a professional.",
        "Akito-kun’s answer seems to have been very unexpected for him.",
        "“…Well, that’s how much I like her.”",
        "Then Akito-kun put his right hand around his neck, as if a little embarrassed, and said so while looking away.",
        "As I looked at him, I tried my best to hold back my writhing from the cuteness of Akito-kun and the happiness of what he said.",
        "If I had been the only one in this area, I really would have been writhing in agony.",
        "Akito-kun, as usual, surprises are unfair…",
        "“But if you do that, are you saying you’re giving up redemption?”",
        "“No, I will make amends in a different way. But I can’t choose to leave her. No matter how many people accuse me of doing so, she is my first priority right now.”",
        "“What the hell happened in the last two years? You’ve never been one to say or think like that, have you?”",
        "“If anything has changed, it’s not so much the last two years as the last few days. I can’t go into details.”",
        "“…………”",
        "Is it… because you’ve been going out with me for the past few days?",
        "I don’t think there’s anything I could have done for him…",
        "“You can call me an asshole if you want.”",
        "“………….”",
        "Riku-san just stared at Akito-kun in silence and did not say anything.",
        "Therefore, Akito-kun also kept silent and decided to wait for his words.",
        "And then―",
        "“―Pfft…”",
        "“Riku…?”",
        "“Fuhaha! Hahahaha!",
        "“O-oi, what’s going on? Are you out of your mind?”",
        "Riku-san suddenly started laughing for some reason, and Akito-kun saw it and called out to him with concern.",
        "Akito-kun, I think your words are too harsh to worry about your friend.",
        "I was tempted to tell him so, but I was only puzzled when he suddenly started laughing.",
        "“No, you see… I didn’t think that Akito would become such a romantic fool, so I couldn’t help but laugh.”",
        "“…I really hate you.”",
        "The laughing seemed to bother Akito-kun, and he frowned as he said he hated him.",
        "I’ve been thinking about it for a while, but it seems that Akito-kun and Riku-san are incompatible.",
        "…It’s a shame. [TLN: Oh come on Charlotte, you’re also part of that community?]",
        "“No, no, wait. I’m serious about asking you to join the team, but you have to put yourself in the shoes of someone who refuses because he wants to be with his girlfriend.”",
        "“Don’t laugh because of that…”",
        "“I’m sorry, I’m sorry.”",
        "Riku-san apologized to Akito-kun, who was angry in a dumbfounded way, with a smile that seemed to have been blown off his face.",
        "It seems to me that he doesn’t feel bad at all.",
        "However, it must have been a good thing that he was able to get over it.",
        "Riku-san looked at Akito-kun’s face with a radiant smile.",
        "“No, yeah. I can’t help it, then.”",
        "“Are you sure…?”",
        "“Why are you giving me such a suspicious look? I know there’s nothing I can say to you now that you’ve made up your mind, so I’m not going to say anything else. Besides, it seems that you’ve already moved on. So there’s nothing more for me to say.”",
        "In other words, it seems that his real purpose was not to complain to Akito-kun or to recruit him.",
        "I’m sure he’s as kind as he looks.",
        "“Maybe it’s because I’m dragging up the past that you’re forcing me to go and…?”",
        "“That’s right, the guy I admired seemed to be perpetually dithering, so I decided to do something about it. Apparently, it was none of my business.”",
        "“…For that, you seemed to be feeling quite serious about it though…?",
        "Yes, I agree with Akito-kun.",
        "I think it was too much of an act to get Akito-kun back on his feet.",
        "Perhaps that wasn’t acting at all.",
        "“Of course, I meant everything I said. But I wanted to do something about you, that’s the root of it all.”",
        "“So I take it you’re convinced…?”",
        "“Yeah, I’m convinced. Well, I’m a bit disappointed that I couldn’t get you back on the team, and it’s true that I needed your help, but I’m not that bad of a person to interfere with someone else’s love life.”",
        "Riku-san’s face looked sad as he said this.",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Comments: A bro moment right here. Same level with Akira’s attempt."
    ]
}