{
    "id": "chapter-136",
    "title": "A Night Alone Together",
    "content": [
        "Translator: AJ1703",
        "(**Akihito’s POV**)",
        "“……♪”",
        "Emma-chan was sleeping soundly, and Charlotte-san, who was sitting on my lap, was rubbing her cheek against me.",
        "She is in full pampered mode.",
        "I kissed her many times until she was satisfied, which may have put her in a good mood.",
        "“Isn’t it about time we go to where Kanon-san and the others are?”",
        "I asked her, since it had been quite some time since then.",
        "However―.",
        "“………….”",
        "She was silent and gave me a very sad look.",
        "For some reason, she had an expression like a puppy being thrown away.",
        "“Do you want to stay like this for a little while longer?”",
        "“Yes…”",
        "Charlotte-san nodded her head.",
        "It seems that Charlotte-san doesn’t want to leave yet.",
        "……Yeah, she’s too cute, isn’t she……?",
        "She was too cute and sweet, so I just kept on pampering her.",
        "◆",
        "“Emma-chan, you’re going to sleep with Sophia-san today, okay?”",
        "After eating dinner and taking a bath, Emma-chan went to Sophia-san’s room.",
        "She had hardly been able to sleep with her, and she wanted to be pampered by her mother.",
        "So tonight I am alone with Charlotte-san.",
        "“It can’t be helped, she’s a kid after all.”",
        "Charlotte-san is fidgeting while wearing her nightgown.",
        "Her face is slightly red and she is looking at me expectantly.",
        "Perhaps she is feeling excited.",
        "I don’t think she considers Emma-chan an inconvenience, but it’s hard to be affectionate when there’s a young child around.",
        "It would be a big problem if she wakes up when I’m flirting with her.",
        "“I’m tired from moving today, do you want to go to bed early instead of studying?”",
        "“Yeah…”",
        "After confirming Charlotte-san’s nod, we both get into the fluffy bed.",
        "The bed was arranged beautifully by Kanon-san, and it was a very nice bed.",
        "I turned on the dim light and pulled Charlotte-san into my arms.",
        "I think it will be safe if Kanon-san and the others come in if it’s this dark.",
        "I would have felt safer if I had locked the door, but I didn’t want Kanon-san and Sophia-san to suspect me, so I didn’t bother.",
        "I would feel sorry as well if Emma-chan came to our room but could not enter because the door was locked.",
        "“My heart is throbbing…”",
        "It was our first night alone together.",
        "I was as nervous as Charlotte-san.",
        "Or rather, my heart was pounding as well."
    ]
}