{
    "id": "chapter-130",
    "title": "Preparing to Move and Being Special",
    "content": [
        "Translator: AJ1703",
        "Volume 3: “A New Life”",
        "Chapter 130: “Preparing to Move and Being Special”",
        "(**Akihito’s POV**)",
        "“―Onii-chan, you’re moving with us!?”",
        "The next day off, as we were preparing to move, Emma-chan was very happy when she found out what was happening.",
        "The place we are living in right now is too small, so we are going to move to a house nearby.",
        "Of course, Kanon-san had prepared this place for us beforehand.",
        "Well, as expected, she didn’t build it from scratch, but bought it.",
        "“Yeah, from now on we are going to live together, so please take good care of me.”",
        "“Nn!”",
        "Thus, we proceeded with the preparations for our move.",
        "We are told that we will be moving to a place with full security as soon as possible, as the word has spread quite a bit on the Internet.",
        "Emma-chan seems to be happy too, helping me out.",
        "Incidentally, Charlotte-san is in the next room with her mother and Arisa-san, preparing for the move.",
        "And over here―.",
        "“Akihito, surprisingly, you didn’t leave anything that would be troublesome to be found?”",
        "Kanon-san was helping me out.",
        "I don’t know if it’s right to let a young lady do this, but she willingly volunteered to help.",
        "By the way, please don’t look for things in someone’s room that an adolescent boy would hide.",
        "“…………”",
        "Emma-chan is not familiar with Kanon-san, and she hides behind me.",
        "But she looked up at Kanon-san with a glimpse of her face.",
        "“Emma-chan, are you tired? Do you want some juice?”",
        "“Nn…!”",
        "However, she was lured out with juice.",
        "She’s pretty simple as I thought.",
        "I think to myself as I watch Emma-chan receive a small cup from Kanon-san.",
        "Emma-chan takes the cup and walks up to me.",
        "Then she sits on my lap as if it were a matter of course.",
        "I guess she feels at ease here.",
        "“I’ve always heard about you, but you’re really very attached to him.”",
        "“Nn…!”",
        "Emma-chan raised her right hand in a cheerful gesture, as Kanon-san was probably referring to me.",
        "It’s like Emma-chan is showing me how fond she is of me.",
        "It’s really cute.",
        "“Fufu, she’s so cute.”",
        "Kanon-san must have felt the same way.",
        "She smiled and put her hand on Emma-chan’s head.",
        "Emma-chan hates to be touched by anyone other than family members.",
        "I was the only one she seemed to think was special, but if Kanon-san reached out to touch her, she would probably swat her hand away.",
        "I thought so, but Emma-chan was being patted meekly.",
        "Huh…?",
        "“She thinks I’m Akihito’s big sister, so she doesn’t mind.”",
        "Kanon-san seemed to have noticed my thoughts and smiled at me.",
        "I see, it seems that she had already made her feel comfortable.",
        "I wondered if the reason she was looking at Kanon-san’s face while hiding was because she thought Kanon-san had a connection with me.",
        "Emma-chan seems to think her family is special, and I guess that means my family as well, so Kanon-san, is special too."
    ]
}