{
    "id": "chapter-89",
    "title": "The Two People Who Can't See What's Going on Around Them",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "“Well then, what should I do…?”",
        "I had passed my destination by a long way, and with Charlotte-san’s face buried in my arm, I was in trouble.",
        "I’d like to take the opportunity to show her around Hiroshima, but I don’t know any tourist spots since I’ve only been to school events or soccer games as a second year middle school student.",
        "We’ll have to go back to Okayama…",
        "“Is this Hiroshima Prefecture…?”",
        "As I was thinking about what to do with my hand on my chin, Charlotte-san looked up and asked me.",
        "She looked up at me with an embarrassed look on her face, as if she was affected by what I had just said.",
        "“Yes, that’s right I guess?”",
        "“Then… I’d like to go to a place called Miyajima…”",
        "“Miyajima? Ah, the Miyajima of Aki.”",
        "It is one of the three most beautiful places in Japan, also known as Itsukushima.",
        "There’s a lot to see and do in the area, and you’ll be able to find a lot of great places to visit, from the large shrine that Taira no Kiyomori built over the sea called the Itsukushima Shrine to the Momijiya Park where you can see many beautiful autumn leaves.",
        "However, even though it’s already autumn, it’s still a little far from the time when the leaves usually bloom beautifully, and Miyajima is a long way from Fukuyama, even though it is also in Hiroshima.",
        "So, if possible, I would like to go there next time―",
        "“Umm, I’m sorry… but even in Hiroshima Prefecture, it takes more than two hours from here, maybe even three.”",
        "“I see… Then let’s not do that.”",
        "When she realized that it would take a lot of time to travel, Charlotte-san gave up because she was a good listener.",
        "But she still looked somewhat disappointed, so I would like to take her to the next time when I have more time.",
        "“I’m sorry, we’ll come back next time. Maybe next time, when we have the day off or something.”",
        "“―! T-that’s right, then maybe we can stay overnight and relax…!”",
        "When Charlotte-san heard my words, her face lit up with happiness and she nodded several times.",
        "But I couldn’t help but nod my head at her words.",
        "“Eh?”",
        "“Eh?”",
        "After I tilted my head, she also tilted her head with a puzzled expression.",
        "As we stared at each other, Charlotte-san’s face turned bright red as she noticed something.",
        "“~~~~~!”",
        "Then she pressed her face against my arm again and started to writhe.",
        "“No, yeah, I’m so sorry…”",
        "I felt too bad for her and I apologized to Charlotte-san.",
        "I meant that it was okay to be tired as long as you had the next day off, but Charlotte-san seemed to have taken it in a different way.",
        "And she was alone, writhing in embarrassment over her misunderstanding.",
        "It was my fault for saying something weird that made her misunderstand something, and I couldn’t follow up immediately, so I really felt sorry for her.",
        "However, Charlotte-san’s writhing in embarrassment was still very cute.",
        "I’m sure I’ll be called a teaser again if I say that, but I think it can’t be helped since she looks so cute.",
        "Anyway, I gently stroked her head to comfort her.",
        "Then, Charlotte pressed her head against my hand without looking up.",
        "Apparently, she liked it.",
        "“―Hey, look at those kids.”",
        "“Wow, they’re so in love…”",
        "“Isn’t that silver-haired girl really cute?”",
        "“I like the boyish part too! When a neat girl like that does it, the gap makes her look even more attractive!”",
        "―I was so caught up in Charlotte-san that I didn’t even realize we were attracting attention…",
        "I guess it’s because she’s got the looks to stand out.",
        "I guess I’ll just have to get used to it…",
        "“Charlotte-san, I’d like to move to another place, is that okay…?”",
        "“Y-Yeah…”",
        "When I called out to her, Charlotte-san nodded with her face buried in my arm, and we decided to move to a different location.",
        "I found out that there’s a leisure land about 30 minutes away from here, so I decided to go there.",
        "This is why I took Charlotte, who still wouldn’t look up, with me as we moved.",
        "“―――That’s, is he… Akito… or…?”",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Comments: Oh boy, who saw them now?"
    ]
}