{
    "id": "chapter-116",
    "title": "You've Lost",
    "content": [
        "Translator: AJ1703",
        "(**Akihito’s POV**)",
        "She looked a little older compared to what I remember.But even so, she still looked young.However, Charlotte-san’s next words shocked me.",
        "“Mom…? Why are you here…?”“―!?”",
        "Mom?Does that mean that this Onee-san is Charlotte-san’s mother…?",
        "With those words, all the mysterious bits of me that I had been wondering about began to connect.",
        "Why did I think that Charlotte-san was the spitting image of the young woman that I admired so much?Why does Charlotte-san live in the same apartment as me, even though she is rich?Why did a young lady like Kanon-san approach me at such an early age?It seems we were dancing in the palms of Kanon-san and Onee-san’s hands.",
        "“You’ve grown up, Akihito-kun.”",
        "Onee-san― or rather, Charlotte-san’s mother― smiled at me.I was puzzled and embarrassed, and involuntarily looked away.On the contrary, Charlotte-san started looking at me and her mother’s face alternately, as if surprised.",
        "“Yeah, it’s been a while…”“Yes, well, I have a lot of stories that piled up and will explain them but first… I’ll tell you one thing.”",
        "Charlotte-san’s mother comes in front of me as she says this.Then she put her hand softly on my cheek.",
        "“I’m here to keep my promise. It took me almost ten years to do it.”“I thought you’d forgotten about it by now…”“How could I forget? I made a promise to you, a very important one at that.”",
        "I started to feel the heat in my chest and eyes, but I managed to hold it in. [TLN: He’s probably about to cry.]We still can’t relax just yet.",
        "“Mom… what’s this all about…?”“I’ll explain it to you later. Right now, there’s something that must be settled.”",
        "Charlotte-san’s mother smiled again and turned her back to us, facing President Himeragi.President Himeragi’s expression showed an evident agitation.It was probably because of “the Mom’s” appearance.She had a frightening expression.",
        "“As was just done before President Himeragi’s eyes, Akihito-kun chose Charlotte, not money or position. As promised, Akihito-kun and Kanon-chan will be free from now on.”",
        "Apparently, a bet had been made without our knowledge.The bet was, as the saying goes, whether I would choose Charlotte-san, money, or position.At this stage, President Himeragi holds the future of Kanon-san and me in his hands.So, it seems that they were trying to destroy that relationship.",
        "Could it be that Arisa-san appeared in front of me in an attempt to strengthen our bond by hurting me and getting Charlotte-san involved back then…?If so, that would definitely make me choose Charlotte-san more…",
        "“W-Wait a minute! I can still persuade hi―!”“No, Akihito-kun’s answer won’t change. He is a boy who chooses people over money and status, and you lost because you didn’t understand the true nature of Akihito-kun.”",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxTranslator’s Afterword: I still have no editor bc im too lazy to send it to him and I just want to get these out now as much as possible and I think they’re readable? I want to believe that at least lol.",
        "Anyway, more important stuff, I have failed my integral calculus class and is subjected to take summer classes for it. In other words, I have no summer break, I’ll try to pitch some chapters from time-to-time during most of everyone’s summer break as much as I can but don’t get your hopes up. You can ask more about it or get more updates through our discord server by clicking here."
    ]
}