{
    "id": "chapter-53",
    "title": "The Two Loners",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "[TLN: IF YOU CAME FROM CHAPTER 52 OF ROMCOM TRANSLATIONS, YOU DON’T START WITH THIS CHAPTER, IT’S ACTUALLY CHAPTER 50. IF YOU START HERE, YOU’LL MISS OUT ON SOME PARTS OF THE STORY. SO I SUGGEST READING AGAIN FROM MY CHAPTER 32. IF YOU DON’T WANT TO RE-READ A LOT OF CHAPTERS, THEN START AT CHAPTER 50.]",
        "(**Aoyagi’s POV**)",
        "―How did this happen…?",
        "I was at a stylish coffee shop, and I was looking up at the sky with my hand on my forehead at the unexpected situation.",
        "That’s because― to the right of the seat, the person currently sitting next to me is Charlotte-san.",
        "To the left is a girl with long bangs that hide her eyes.",
        "…There is a certain part of her that is very feminine and assertive, but let’s leave that aside for now.",
        "And it’s also girls that are sitting in front of me.",
        "What now?",
        "Was I trying to build a harem without even knowing it?",
        "With five girls and one boy at one table, I felt like I wanted to leave right now.",
        "More than anything, the fact that Charlotte-san and I were sitting next to each other was not good.",
        "There was no way I could sit next to her and not talk to her, and even if I tried to talk to her in moderation, I was sure that after a while, we would both start talking as if we were having a conversation at home.",
        "I knew that my classmates would have a hard time deciding who would sit at the same table as Charlotte-san, so the seating itself was decided by a complete lottery… No matter how much I want to, this is just too much…",
        "It may seem like great luck to other people, but for me, it’s just bad luck.",
        "To be honest, it’s too uncomfortable to be the only boy in a group of girls.",
        "Also, the way the boys look at me is really hard.",
        "They’re jealous, and they’re staring at me as hard as they can.",
        "The girls at the other tables were also looking at me with bitter smiles on their faces.",
        "I really don’t know what I’m going to do about this situation…",
        "The only saving grace was that Charlotte-san, who was sitting next to me, seemed very happy to see me.",
        "Maybe she hasn’t completely gotten to know the girls yet.",
        "She stares at me with a smile on her face, probably because I’m her friend at home who she talks to a lot.",
        "But the distance between us seems a little too close.",
        "“Hey, Aoyagi-kun. Do you want someone else to take your seat? It’s hard to be the only boy in a table of girls, right?”",
        "When I was at a loss as to what to do, the girl sitting in front of me extended a helping hand.",
        "It was a suggestion I couldn’t have wished for.",
        "Okay, I’ll go with the flow―.",
        "“W-wait a minute…! I thought it would be better not to do that kind of thing, since we decided by lottery on an equal basis…! If one person does that, everyone will have to exchange seats with each other, which will cause inconvenience to the restaurant…!”",
        "I tried to go along with the girl who made the suggestion, but Charlotte-san brushed it off before I could even open my mouth.",
        "The girls sitting at the table were surprised by her unexpected reaction.",
        "However, perhaps it was because she was now the most popular girl in the class that they all began to nod their heads in agreement.",
        "“Oh yeah, you’re right. Charlotte-san is absolutely right. If we allow the boys to change seats, they will definitely start to make a fuss to get next to Charlotte-san. I’m sorry, Aoyagi-kun. Being the only boy at our table, don’t worry about it and feel free to join the conversation, just bear with us for now okay?”",
        "“No, well… Yes, that’s fine… I understand…”",
        "With my hopes dashed, all I could do was nod.",
        "Indeed, if we exchanged seats, the boys would certainly make a fuss about being next to Charlotte-san.",
        "The girl sitting to my left, aside from the other girls, was a very timid girl.",
        "I’ve never seen her talk to other students properly, and her voice is very low, as if she’s not confident in her ability to speak.",
        "And she is always frightened.",
        "I’m sure that if a boy pressured her, she would give up her seat without a second thought.",
        "I don’t want to ruin Charlotte-san’s welcome party by making a fool of myself.",
        "So, I had to put up with it instead.",
        "“―I’m sorry…”",
        "As I smiled bitterly, Charlotte-san apologized to me in a small voice.",
        "I’m sure she didn’t keep me here to harass me either.",
        "She probably just wanted to nip the risk in the bud so as not to cause a scene.",
        "There was nothing for her to apologize for.",
        "“No, it’s okay. After all, what Charlotte-san said is correct.”",
        "“No, that’s not it… It’s because I was being selfish…”",
        "“Selfish…? What do―”",
        "“―What would you like to order?”",
        "When I tried to ask her what she really meant when she said “selfish,” the waitress came to take our order.",
        "Apparently, one of the students at the other table had called her over to order, and she had come to take our order as well.",
        "We felt bad about making her wait, so we ordered what we wanted from the menu.",
        "One thing I appreciated was that even though this was a coffee shop, they had an all-you-can-drink (no alcohol) policy.",
        "According to what I’ve heard, they started the all-you-can-drink service because they wanted to attract students as customers.",
        "―As I missed the timing, I was unable to ask Charlotte-san about it afterwards.",
        "◆",
        "Charlotte’s welcome party went off without a hitch― or rather, she greeted us only at the beginning, and from then on it was like a test launch except at our table.",
        "As expected, no one had the bad manners to get out of their seats and walk around during the meal.",
        "Everyone has given up on coming to Charlotte-san’s place and is enjoying themselves instead.",
        "If there’s one problem― it’s about me…",
        "I couldn’t join the conversation with the girls, so I was left out in the cold.",
        "No, to be precise, we were both left out in the cold…",
        "I can’t join in with Charlotte-san’s conversation, so I look at the girl to my left, who is fidgeting with her index fingers together.",
        "I’m pretty sure her name is Karin Shinonome.",
        "She was repeatedly opening and closing her mouth, as if she wanted to join the conversation of the girls.",
        "In the meantime, Charlotte-san has been talking to me and this girl as well… and I’ve been trying to cut it short when she talks to me.",
        "If I took a long time to talk to her, I would probably get ripped off.",
        "And Shinonome-san gets frazzled when spoken to, and looking at her from the side, you feel sorry for her.",
        "That’s why Charlotte-san seems to have taken care and switched to not talking too much to her.",
        "As a result, we ended up with a pair of loners.",
        "“…Would you like something to drink?”",
        "I noticed that the cup in front of Shinonome-san was empty, so I quickly offered her the menu so as not to startle her.",
        "“Ah….. Erm, this one…”",
        "Shinonome-san looked up at me as if she was confused because I had spoken to her suddenly, but then she slowly pointed to the drink she wanted to order.",
        "I was a little surprised to hear her voice.",
        "Her voice was unusually high, even for a girl.",
        "I think it’s called an anime voice?",
        "I don’t usually watch anime, but I thought it was a very cute voice.",
        "“What about you guys?”",
        "I nodded to Shinonome-san and then asked the other kids at the same table.",
        "Then we gathered up our orders and gave them to the waitress.",
        "―For some reason, while being stared at by all the girls at the same table…"
    ]
}