{
    "id": "chapter-38",
    "title": "The Little Sister Who's Holding Us Back",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "“I don’t want toooooooooo! Emma’s going too!”",
        "I’m currently in front of Charlotte-san’s room, and Emma-chan is doing her best to hold me back as I try to go to school.",
        "She’s using her small body to her fullest to pull on my arm.",
        "The difference in size between the two of us made it easy for me to move if I put in the effort, but being stopped like this discouraged me from doing so.",
        "I really want to play with Emma-chan, but I can’t take her to school.",
        "There was no way I was going to miss school.",
        "I bent down on my knees to be at Emma-chan’s eye level and gently patted her head.",
        "“I’m sorry, Emma-chan. I’ll be able to play with you again this evening, so will you be patient and wait for me until then?”",
        "I told her, and she looked at me with tears in her eyes.",
        "She seemed to be trying to tell me something, but I couldn’t leave if I knew what it was, so I quickly turned away.",
        "“―Haa!?”",
        "Then I saw Emma-chan gasp.",
        "I guess she didn’t expect me to turn away from her.",
        "The doorway was silent, as if she was no longer being selfish.",
        "I felt sorry for her and relieved that we could now go to school, but Emma-chan was not so naive.",
        "“Onii-chan… Do you… hate Emma…?”",
        "In a small but firm voice that reached my ears, Emma-chan asked me anxiously.",
        "She sounded as if she was about to cry, and if I walked away, I felt as if her voice would remain in my head forever.",
        "“Aoyagi-kun, no. If you turn around, you lose.”",
        "As I was about to turn around to face Emma-chan’s temptation, Charlotte-san, who had been watching the exchange between me and Emma-chan in front of the entrance, stopped me.",
        "Charlotte-san is sly…",
        "You definitely said that in Japanese so that Emma-chan wouldn’t understand, right…?",
        "I managed to hold back from turning around and instead, looked into Charlotte-san’s eyes, but she quickly looked away.",
        "Yes, she definitely said it in Japanese so that Emma-chan would not hate her.",
        "“Aoyagi-kun, if we keep this up, we’ll be late for school…!”",
        "“No, I know that but… you have to do something about this girl…",
        "“I can’t…! She’s determined to play with Aoyagi-kun, so no matter what I say, she won’t listen…! Even my trump card didn’t work just now…!”",
        "Still though, isn’t it a bit early to give up?",
        "But if the sister, Charlotte-san, says so, then it must be true.",
        "Anyway, what does she mean by trump card?",
        "I was curious about what Charlotte’s trump card was and when she used it, so I stared at her, still refusing to make eye contact.",
        "Then, for some reason, her cheeks gradually started to turn red.",
        "Could it be that she has a fever…?",
        "―*Pull pull",
        "“Hmm? What’s wrong? ―Ah.”",
        "As I was in the middle of thinking about Charlotte-san, the sleeve of my clothes was tugged, so I reflexively turned around.",
        "And then my eyes met Emma-chan’s perfectly.",
        "Emma-chan’s eyes met mine, and she looked up at me with moist eyes.",
        "“Onii-chan… Emma wants to be with Onii-chan… Can’t you take Emma with you…?”",
        "Emma-chan said in a sweet voice, and hugged me tightly.",
        "…..I guess it doesn’t matter if I take a day off at least.",
        "I can’t take her to school, so the full attendance award will go away, but Emma-chan should be a higher priority.",
        "“Yeah, okay―”",
        "“―That’s not good, you know?”",
        "When I tried to nod to Emma-chan’s begging, a smiling Charlotte-san immediately pulled her away from me.",
        "She then tried to carry her in her arms to the back of the room.",
        "“Lottie, let go of me! Don’t tease me!”",
        "“Like what I’ve said before, I’m not teasing you! You’ll have to wait until we get back!”",
        "“Uwaaaaaaaaaaaaaaa~! Onii-chaaaaaaaaaaaan~!”",
        "Emma-chan, who was being taken away, was crying and reaching for me, but I held back because I felt like Charlotte-san might get angry if I reached out for her too.",
        "“―Aoyagi-kun always listens to Emma more than what I say…”",
        "When Charlotte-san returned after leaving Emma-chan behind, she puffed up her cheeks and started mumbling, but the way she sulked was childishly cute, so I decided to watch her from the side for a while."
    ]
}