{
    "id": "chapter-43",
    "title": "Another Promise",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Charlotte’s POV**)",
        "“Lottie, are you going shopping?”",
        "Emma walked up to me as I was getting ready for the day.",
        "I couldn’t help but wonder why it was so cute to see a little girl trying so hard to walk.",
        "I bent my knees to bring my eyes to Emma’s level and began to speak with a smile.",
        "“Yes, I do. I’m going to buy some clothes to wear tomorrow. I’m going to buy a new one for Emma too.”",
        "“Wow! New clothes!”",
        "Emma may be young, but she is a strong girl.",
        "She’s always happy when she can buy new clothes.",
        "So, what kind of clothes should I buy her today?",
        "―I basically chose Emma’s personal clothes.",
        "Part of it is that she wants to buy all the clothes I leave to her, but the main reason is that she is so cute no matter what I put on her.",
        "For example, if you put her in a white and pink colored outfit with frills on it, she will look as if an angel has descended on this land.",
        "On the other hand, if you dress her in simple black clothes, she will look as if an angel has landed on top of her with the silver color of her natural hair.",
        "In other words, no matter what you dress her in, she will always look as cute as an angel.",
        "Emma hasn’t been wearing clothes for going out lately, but if she prepares herself for going out, I’m sure Aoyagi-kun will be troubled.",
        "…Wait a minute.",
        "I think that would be a problem for me.",
        "If all the attention is focused on Emma, it’ll make me sad.",
        "I’m sure he’ll be a little more aware of me when we’re together, but according to a certain information network (music teacher), Aoyagi-kun is a lolicon.",
        "If this continues, I may be ignored tomorrow.",
        "I really don’t want that.",
        "“Lottie, Lottie. How about this?”",
        "“Eh? ―Wha!? I-It’s so cute…!”",
        "When I was alone with my thoughts, Emma, who had left my side before I knew it, tugged on the sleeve of my dress.",
        "And there was a very cute angel― no, a cat angel.",
        "―Emma was dressed in a light blue fuzzy dress with a white mini skirt.",
        "Not content with that, she also wore a cat ears headband on her head, although I’m not sure why.",
        "I don’t remember buying a cat-ear headband, but it looked good on her and she was very cute, so it was fine.",
        "But why is she dressing herself to go out?",
        "Normally she would stay in her nightgown until I told her to.",
        "“You look very pretty, Emma. You look so cute, Emma, and it’s nice of you to change into your outdoor clothes.”",
        "“Yes! Because Emma is going to go out with Onii-chan today!”",
        "Emma smiled happily at me, but I realized that she was making a terrible mistake.",
        "Yesterday, Emma told me that she wanted to play with Aoyagi-kun.",
        "However, I told her that he couldn’t because he had plans.",
        "Instead, she’s going to play with Aoyagi-kun tomorrow, but maybe she didn’t hear about it.",
        "How did this girl take it that I was talking about going shopping for clothes earlier…?",
        "She understood that I was going to go shopping, so perhaps she was planning to leave me alone and play with Aoyagi-kun with just the two of them?",
        "And she was going to make me buy her clothes exactly the way she wanted?",
        "…Apparently, Emma has grown up to be a demonic girl without my knowledge.",
        "―――What a joke, but this is troubling…",
        "Now that Emma is ready to go out and play with Aoyagi-kun, I have a feeling that she will start crying a lot when she finds out that she can’t play with Aoyagi-kun.",
        "But there’s a limit to how much I can cover it up…",
        "…I can’t help it.",
        "Although I feel guilty about tricking her, I’d like to take her out and buy her an ice cream or cake in order to deceive her.",
        "Then, when she’s in a better mood, I’ll tell her the truth.",
        "―After this, I managed to trick Emma into going out with me.",
        "◆",
        "(**Aoyagi’s POV**)",
        "After dropping Aki off at home on the way back from the amusement park, I was heading home alone, and the sound of bellbirds echoing in the silence of the night.",
        "I wondered how long it had been since I had this much fun.",
        "It was fun while we were playing, but now it’s hard to even lift my foot.",
        "I felt exhausted as soon as I was left alone.",
        "But I’m not done with what I have to do today.",
        "When I arrived at my apartment, I stopped in front of the room just before my own.",
        "<<Yes, who is it?>>",
        "I rang the intercom, and a little while later I heard a polite girl’s voice.",
        "It’s the voice of Charlotte-san, who lives in the room next to mine.",
        "“Good evening, Charlotte-san. It’s Aoyagi.”",
        "<<―Wha!? A-Aoyagi-kun!? Eh? Why are you here!?>>",
        "When I said my name, for some reason Charlotte-san started to panic.",
        "I started to hear a loud noise inside that I could tell even through the door.",
        "“U-umm, good evening…”",
        "As I was wondering what she was doing, Charlotte-san came out of her room, looking uncomfortable.",
        "She was wearing pajamas that were white in color with pink polka dots on them.",
        "If our classmates knew that I had seen her like this, they would be jealous and give me a hard time.",
        "“I’m sorry, were you about to go to bed?”",
        "The fact that she had already changed into her pajamas meant that she was probably going to sleep.",
        "Apparently, I was the only one who thought that the usual promise was still valid today.",
        "“I’m sorry… I didn’t expect you to come again today…”",
        "“No, it’s okay. Emma-chan’s already asleep, isn’t she?”",
        "“Yes… When I told her that Aoyagi-kun could not come today, she sulked and fell asleep… I’m really sorry about that…”",
        "Charlotte-san apologized again and again, perhaps feeling guilty that she had made the wrong decision.",
        "Although, she shouldn’t have to worry so much about it.",
        "It’s my fault for not making sure that we were on the same page.",
        "Moreover, I felt that Charlotte-san’s decision was rather correct.",
        "If I had been in her position, I might have made the same decision.",
        "No matter how many times I promised to play with her every day, it was hard to believe that the person I was playing with would come to my house.",
        "“Don’t worry about it. I’ll pretend to Emma that I couldn’t come over today, and I’ll give her some sweets tomorrow and apologize.”",
        "“That’s… Aoyagi-kun came properly, but…”",
        "“It’s okay for you to pretend that I didn’t come, because it’s late already. It’s nothing for Charlotte-san to worry about.”",
        "It was my fault that I could only come late at night to begin with.",
        "Emma-chan is very young.",
        "She shouldn’t be allowed to stay up too late.",
        "“Just how kind are you…?”",
        "“Hmm? Did you say something?”",
        "“No, it’s nothing.”",
        "I thought I heard Charlotte-san mumble something, but it seems that I was imagining things.",
        "That’s strange…",
        "I feel like this has been happening a lot lately.",
        "I’m sure I’m still young, but have my ears gone crazy already…?",
        "In the past few days, Charlotte-san’s mumbling and auditory hallucinations have made me feel a little uneasy.",
        "“Well, if Emma’s asleep, I guess I can’t make it today. I’ll go back to my room.”",
        "If there was no one to play with as promised, then of course there was nothing to do.",
        "I was about to go back to my room, but Charlotte-san grabbed the sleeve of my clothes as I turned on my heel.",
        "When I turned around, she was staring up at me for some reason.",
        "“Um, what’s wrong?”",
        "I suppressed my racing heartbeat and tried to look nonchalant as I approached Charlotte-san.",
        "Then Charlotte-san, who had begun to squirm, slowly opened her mouth.",
        "“Erm… Emma is asleep… but there’s another one you promised me, right…?”",
        "“Ah… yes, that’s right…”",
        "“Is tonight… okay with you…?”",
        "“Yes…”",
        "I was invited in a way that someone might misinterpret its meaning as something strange, and my head almost boiled at the cuteness of Charlotte-san’s reddened face and fidgeting, but we went to my room together with her.",
        "And then― the two of us got along well and read a manga about drawing manga.",
        "[TLN: I can only think of two series, “Mangaka-san to Assistant-san” and “Comic Girls”. The first one is focused on the comedy aspect, the latter is a very wholesome slice of life series which I both recommend!] (P.S. They also have an anime which I think was adapted well.)",
        "[EDN: Or, it could be Bakuman which is quite popular but who knows?]",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Comments: Expect more chapters tomorrow! I think I will be able to pump out another 10 chapters from there. If you enjoyed this series, please give Nekokuro-sensei’s other works a read too, Lonely Otaku and Losing Heroine which I’m also translating! To be honest, I was planning to release more chapters than just these first 12 but I felt pity for my Editor for overworking him at this point lul.",
        "Any questions regarding this series or the other series I work on, feel free to comment down below, I’ll answer them as much as possible because I feel like people will be confused with this decision of mine.",
        "Also, if you guys have spare money to give off, please consider donating to me through the Ko-Fi button below and help me reach my goal to buy my own laptop that I will be both using for studies and translating~!",
        "Lastly, our group is in need of more Editors, consider applying by visiting our discord server by clicking here. You may also ask questions for me on the server too, don’t hesitate in doing so, I’m a very friendly person!"
    ]
}