{
    "id": "chapter-81",
    "title": "A Good News",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "“―Here you go…”",
        "“Well, well, thank you for taking the trouble.”",
        "When I took her to my room and served her some tea, Arisa-san thanked me with a smile.",
        "I don’t know what she’s thinking, her smile is like a pasted-on mask which is frightening.",
        "“Please don’t be so cautious. We’ve known each other since childhood, right?”",
        "It seems that she sensed from my demeanor that I was being cautious, and she smiled sadly and said.",
        "…Don’t be absurd.",
        "You’re one of the top three people I need to be wary of…",
        "I’m not going to say it out loud, I’m just going to mutter it in my mind.",
        "Even the expression on her face is fake and she is not 100% sad inside.",
        "She looks beautiful and kind at first glance, but in reality, she is extremely black-hearted.",
        "It would be unreasonable to ask me not to be wary of her.",
        "A few minutes ago, when I tried to prepare a cup of tea, she said she would do it herself, but I refused because you never know what she might put in it if I left it to her.",
        "It’s also possible that, depending on the circumstances, she would have no qualms about giving me a sleeping pill.",
        "…No, I’ve actually been drugged a few times in the past.",
        "“Why are you here? I thought you guys were supposed to stay out of my business for the last three years of high school?”",
        "I didn’t let my guard down, and dared to ignore Arisa-san’s words and asked her what was bothering her.",
        "Then―",
        "“Oh my, are you ignoring my words? You’ve become quite cocky― no, tough, in just two years of not seeing each other. However, I think you need to relearn some discipline― or rather, some education.”",
        "After a giggle, Arisa-san smiled with a smile that looked very nice to people who didn’t know anything about her.",
        "But her open eyes were not smiling.",
        "You can tell just by that that this person is black-hearted.",
        "Above all, the fact that she deliberately misspoke to incite fear in the other party is as disgusting as ever.",
        "“…………”",
        "“Oh my, you’re even glaring at me. It seems that you’re really getting tougher and tougher― Even though I was so glad that I was able to take care of you as if you were my little brother and Ojou-sama that I adored the two of you back then.”",
        "The meaning of the word “adored” is completely different between Ojou-sama and me, but I dare not to tweak it.",
        "She was still smiling at me, but her eyes were not smiling, and if I wasn’t careful, she might just take over the air.",
        "“So, why are you here?”",
        "I don’t deal with Arisa-san’s nonsense and ask her the same question again.",
        "It’s important not to get involved with this person.",
        "I’ve known her for a long time.",
        "“Fufu, let me just say that the circumstances have changed.”",
        "“Circumstances…?”",
        "I don’t know what it is, but I have a very bad feeling about this.",
        "More importantly, the timing of this person’s appearance cannot be ignored.",
        "“But more importantly, she’s quite lovely, isn’t she?”",
        "“…………”",
        "Just as I expected, she knew that Charlotte-san and I had started dating.",
        "It’s quite plausible from the fact that she deliberately timed her appearance right after Charlotte-san had left.",
        "Perhaps she was trying to make me upset.",
        "“Since we’re here already, may I have a word with you?”",
        "“If you touch her, no matter how much you want to, I won’t forgive you, okay?”",
        "I stared at Arisa-san.",
        "I can’t bring Charlotte-san into our mess.",
        "At the very least, if this person tries to get involved with Charlotte-san, I’ll do my best to stop her.",
        "Well, but―",
        "“Fufu, I don’t know what you misunderstand, but I just want to talk to you, okay? Well, but if Akito-sama says so, I’ll stop.”",
        "Arisa-san smiled when she heard my words.",
        "You didn’t plan to talk about her in the first place, but how dare you?",
        "This person is always like this, only deliberately saying things that might upset the other person’s nerves, but not often acting on them.",
        "In fact, you could say that she doesn’t take action unless she has to.",
        "On the contrary, the fact that this person is taking action means that it is necessary and inevitable.",
        "Well, at least I can rest assured that this person is not going to get involved with Charlotte-san for now.",
        "However, I must have offended Arisa-san with my earlier comment.",
        "She slowly stood up and brought her face to my ear.",
        "Then, she softly strokes my right cheek with her left hand.",
        "“It’s just― I don’t recommend that people with no power use strong words. It sounds like a barking dog, doesn’t it?”",
        "It was a very cold voice that didn’t match her face.",
        "She calls me “Akito-sama” and uses polite words when she talks to me, but in reality, she is looking down on me.",
        "“You haven’t forgotten your position, have you? Do you think you’re allowed to have a girlfriend?”",
        "Arisa-san was no longer wearing a mask.",
        "She slides her hand from my cheek to my chin and stares into my eyes at close range with very cold eyes.",
        "“Apart from that, I don’t think there was any restriction that I shouldn’t make one, was there?”",
        "“Yes, that’s right. You can do whatever you want during your three years of high school, that’s what the Master had said.”",
        "“So, why am I being accused now?",
        "“Fufu, you know the truth, don’t you? Do you really think that after making so many people unhappy, you can allow yourself to be happy alone?”",
        "“…………”",
        "I couldn’t help but shut my mouth at Arisa-san’s words.",
        "Then she loosened her cheeks, looking very satisfied.",
        "It’s a real smile, not like the one she just gave me.",
        "“It seems that you are trying to make those around you happy with a spirit of self-sacrifice, but no matter how much you do for those around you in the near future, the mistakes you’ve made in the past will never go away.”",
        "“But that was―”",
        "“Yes, wasn’t your fault. But your existence made everyone around you unhappy. You have made the people around you even more unpleasant because you havechosen the wrong path. And because you chose the wrong person to bear the brunt of it, you have made even the people who were protecting you unhappy. Is there anything wrong with what I’m telling you?”",
        "“…………”",
        "There was nothing wrong with that…",
        "If it weren’t for me, none of that would have happened, and even more irreversible things would have happened because I was afraid to face everyone.",
        "And finally, I hurt the people who were most important to me at the time.",
        "It doesn’t matter how many words I try to use, those are the facts.",
        "“Do you have any words to say back?”",
        "“……….Is that, why you came to me…? Did you come here to tell me to break up with her…?”",
        "I managed to get the words out of my dry throat, feeling the sweat pouring out of my body.",
        "But for some reason, she smiled at me.",
        "“No, I don’t have the time to come all the way out here just for this.”",
        "“Then, why are you here…?”",
        "“Fufu, it seems that your head is not spinning properly anymore. I told you at the beginning, didn’t I? I’ve got some good news for you.”",
        "Arisa-san said and started stroking my cheek again.",
        "Every time she stroked my cheek, I felt a chill run through me, but I held my ground and opened my mouth.",
        "“I knew you had something troubling to tell me when you arrived, but is it too good to be true? No, of course not. You people only see me as a tool to be used.”",
        "“No, no, that’s not the case at all. It’s a piece of very good news. After all― I’ve brought you a marriage proposal.”",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Comments: Welp, what a bombshell to drop after that barrage of sugar."
    ]
}