{
    "id": "chapter-57",
    "title": "Giving Up Is Important",
    "content": [
        "“―So, what do you want to talk about?”",
        "After leaving the others, Akira and I went to the park and straight got right down to business.",
        "I know I’ve been putting this off for a while now, but it’s better to get this sort of thing out of the way as soon as possible.",
        "Akira stared at me for a while and then showed some sign of thinking.",
        "He said he wanted to talk to me, but he seemed to be wondering if it was really okay to ask.",
        "After a while, he seemed to have made up his mind.",
        "Akira looked straight into my eyes with a serious expression.",
        "Then he slowly opened his mouth.",
        "“Hey, Akito. Are you― dating Charlotte-san?”",
        "“Yes, that’s― Eh?”",
        "I was expecting him to ask, “Do you still like Charlotte-san?”, but the unexpected question caused me to let out a dumb voice.",
        "I couldn’t understand Akira’s intentions, so I looked at him quizzically.",
        "“No, after all, Charlotte-san kept staring at Akito many times, and you two were so close that your shoulders were almost touching. Maybe there are other people who have the same question as me?”",
        "…I knew it, Charlotte-san was too close to me.",
        "I thought so too, but to be honest, I was too happy that I was so close to her to say anything.",
        "Also, Charlotte-san seemed to be happy, so it was hard to say.",
        "But if this was going to happen, I should have stayed away.",
        "“The reason we were so close is because the three of us were sitting side by side, right? Wouldn’t that be normal?”",
        "“Then why was Charlotte-san grabbing Akito’s clothes?”",
        "“Eh…?”",
        "“You know I can see things from a bird’s eye view, right? Charlotte-san was grabbing the sleeve of your clothes all along the way, I could see it.”",
        "Akira smiled bitterly, not in anger, but in exasperation.",
        "I could sense that he was somewhat close to giving up.",
        "The term “bird’s eye view” means to look down on things from a high perspective.",
        "You may be surprised to learn that Akira knows such a word, but he knows what it means because his coaches have been telling him about it ever since he was young.",
        "To be able to see things from a bird’s eye view is one of the skills required of a good soccer player.",
        "Or, more accurately, if you have it, you have the makings of an excellent soccer player.",
        "The ability to see things from a bird’s eye view does not mean that you are really looking at things from the sky, but rather that your brain converts the information you receive from your eyes and allows you to grasp the space as if you were looking at it from above.",
        "Akira had possessed this ability ever since he was a child.",
        "I’ve forgotten all about it since we stopped playing soccer together…",
        "“Yeah, that’s right… I’m sorry I had to hide it from you…”",
        "When I realized that it was impossible to deceive him any further, I decided to admit it honestly.",
        "I can’t say that I didn’t feel guilty about it, and I can’t help it if I’m being cursed.",
        "“I understand why Akito wants to hide things from me, and I don’t want to give you a hard time about telling me everything just because we’re best friends. Moreover, I somehow noticed it already.”",
        "Akira made a somewhat troubled expression, then smiled.",
        "I know he’s holding back, but I’m grateful for that feeling right now.",
        "I don’t like to have heavy conversations with people I’m close to, let alone people I’m not close to.",
        "“What else did you notice?”",
        "“I know that Charlotte-san likes you. She doesn’t seem to talk much at school, but she’s been staring at you a lot lately and I noticed that since I was also staring at her… What kind of a trick did you use to get her to be your girlfriend less than a week after you met her?”",
        "He poked me with his elbow as if to tease me, but I noticed that there was some kind of miscommunication between us.",
        "If you think about it, I didn’t say enough.",
        "“Erm, I think you’re misunderstanding something, but Charlotte-san and I are not dating. We’re just good friends, that’s all.”",
        "“What? Is that true?”",
        "When I nodded my head, Akira let out a big sigh.",
        "I’ve done something wrong.",
        "“Akito, please pretend you didn’t hear what I just said.”",
        "“O-ohh.”",
        "There’s no way I can pretend I didn’t hear that, but when someone grabs you by the shoulders and says it from close range with a serious expression, you can’t help but nod.",
        "This is the reason why Akira is so popular.",
        "“Well, it’s a little late for that now, isn’t it…? To be honest, I’m already thinking that Akito is fine…”",
        "Akira, who had distanced himself from me, started mumbling to himself.",
        "I’m not sure why so many people around me mutter to themselves like this.",
        "Could it be that I’m the cause?",
        "“Haa~… I wish there was another cute girl like Charlotte-san…”",
        "“Akira, when did you hit your head somewhere?”",
        "“No, I know you’re going to think that when I suddenly say something like this, but you don’t have to look at me like I’m trash, okay!?”",
        "I didn’t look at him like he was looking at garbage.",
        "I just thought it was a disgusting statement, my friend.",
        "“Well, there are some, but…”",
        "“I’ll tell you what, I’m not talking about other schools with students like Aki-chan, okay? I’m talking about inside our school.”",
        "I understood what he meant when he went to the trouble of mentioning Aki by name, but I decided to ignore it because Akira seemed to be saying it unconsciously.",
        "I would like to say that a girl is not all about her face― but when I’m also in love with Charlotte-san, I can’t say the same about others.",
        "The main reason why I began to be interested in her was because she seemed elegant and kind, but I was also attracted to her because of her cute face…",
        "Well, the main reason is that she’s my ideal girl… but that’s not important right now.",
        "In addition to Charlotte-san, there are other girls in our school that are at the level that Akira is looking for.",
        "I’ve just found out about it myself.",
        "” Well, there’s one person in our class…”",
        "“No, no, we’re talking about high school students here, okay? Of course, Charlotte-san is on another level… Could it be that you’re thinking of Miyu-sensei? It’s true that she’s Aki-chan’s older sister. It’s natural that she’s also beautiful, but no matter how you think about it, she’s still our teacher, isn’t that bad?”",
        "Akira, who was probably thinking of all the people in the class, seemed to have finally come up with Miyu-sensei.",
        "What Akira said was correct.",
        "Even if it’s from a student, to the people around them, it’s considered taboo as a teacher dating with a student.",
        "It’s a socially reprehensible act.",
        "Even though she herself is a bit of an idiot sometimes, she would never lay her hands on a student.",
        "In case you’re wondering, it’s because she’s a person with common sense.",
        "“Haha, that’s right.”",
        "I didn’t dare to deny that I was not talking about Miyu-sensei, but I went along with Akira’s words.",
        "I’m not going to say anything about it, but in Akira’s mind, he’ll think I was talking about Miyu-sensei.",
        "I’m not lying, and it’s for the sake of the girl that I should cover it up.",
        "“But what’s going on all of a sudden? Akira was in love with Charlotte-san, weren’t you?”",
        "I questioned Akira, who was acting as if he was looking for another girl.",
        "Then Akira opened his mouth, scratching his cheek as if he was troubled.",
        "“Well, there’s a lot going on. I may not be able to study, but I’m not stupid.”",
        "Akira faked it, but I somehow knew what he was thinking.",
        "In short, he must have given up on Charlotte-san.",
        "Based on the conversation we had just had, it might be safe to assume that he had given up on her.",
        "…I feel like I could be misunderstood for having this conversation, but it’s Charlotte-san who chooses her partner.",
        "I think this kind of conversation is irrelevant when it’s not necessarily one or the other, either me or Akira.",
        "Well, it’s not something I can say as I was struggling with whether or not to give it up to Akira.",
        "I also found out why Akira is not popular, but I don’t want to talk about it here.",
        "Anyways― from the perspective of those around me, Charlotte-san seems to have a thing for me.",
        "I hope this is not a misunderstanding…",
        "―I’m not going to touch the subject of Charlotte-san anymore, and as I wander around at random, I’m remembering Akira’s words.",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Comments: Thank god he finally didn’t deny that Charlotte-san “may” have feelings for him. I think we’re getting closer dudes, probably about 10 chapters. It’s about time I guess?"
    ]
}