{
    "id": "chapter-46",
    "title": "How to Handle a Young Girl",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "“Let’s go, then.”",
        "After hugging Emma-chan’s back so as not to drop her, I called out to Charlotte-san who was standing next to me.",
        "For some reason, Charlotte-san nodded her head in a fidgety manner.",
        "I was a little bit concerned about her condition, but she didn’t seem to have a fever or look sick, so I guess she was fine.",
        "Besides, if I told her that we were going to stop playing now, Emma-chan, who was so happy to be in my arms, would probably burst into tears.",
        "From there, the three of us went to the zoo at Emma-chan’s request.",
        "The place we were going to was far away, but not too far to walk if we took the train, which was a bit unusual for Okayama Prefecture.",
        "There’s also one of the largest zoos in the prefecture we live in, which despite being a zoo, has penguins and many other popular animals, so it might be better to go there.",
        "I’m sure Emma-chan would be very happy if we took her there.",
        "However, if we go to that place, there’s a big chance that we might run into someone we know.",
        "Well, that could be said for the zoo we were going into, but the odds were better that we would run into someone at the largest zoo in the prefecture, which was closer to us.",
        "On the other hand, almost no one would go out of their way to go past the zoo.",
        "Most of them go to a high school in the center of the city, while the school we go to is on the outskirts of the city.",
        "Even the cost of traveling to the city is a little expensive, but for us high school students who travel far from the city, the cost for commuting would be ridiculous.",
        "That’s why I didn’t think we would run into any other students from our school.",
        "When I think about it, I’m amazed that Charlotte-san even allowed us to travel far away.",
        "Emma-chan is too young to pay for the train, but Charlotte-san’s train fare will be quite expensive.",
        "I wonder if she gets a lot of pocket money since she doesn’t seem to be working part-time?",
        "…Oh, that reminds me, I still haven’t met Charlotte-san’s parents.",
        "I’ve never heard of them because there was never a good time to bring it up, but I’ve always felt a little uncomfortable about it.",
        "Usually, Charlotte-san and Emma-chan would stay in my room until late at night.",
        "Even in the mornings, since yesterday, they come to my room to cook breakfast for me, and have dinner with me instead of going home.",
        "If her parents were home, she would have eaten at their home, and they wouldn’t have allowed her to stay in a man’s room so late every night.",
        "Could it be that Charlotte-san and Emma-chan live alone?",
        "…Somehow, I don’t think that’s right either.",
        "If she’s like me, then naturally, she also originally lives in Japan, but she’s from England.",
        "It was impossible for her parents to send money to her, and they would never let her live alone with a child as young as Emma-chan.",
        "There might be some reason for this.",
        "There’s a lot I don’t know about these girls, even though we’ve been together a lot ever since we met…",
        "“Onii-chan, can we hurry up?”",
        "As I was thinking about it, Emma-chan, who was in my arms, tugged at my clothes to hurry me along.",
        "It looks like she can’t wait any longer.",
        "“Sorry, let’s go now.”",
        "“Yes! ―Neko-chan♪! Neko-chan♪!”",
        "As we started walking towards the zoo, Emma started swaying her body and making cat calls.",
        "It seems that Emma-chan wants to see cute cats.",
        "But you know, Emma-chan― cats are not at the zoo…",
        "Realizing that a cruel future awaited Emma-chan, I apologized to her only in my heart.",
        "Needless to say, I don’t have the guts to tell this to her right now.",
        "I wonder if we should change our visit to the pet store now…?",
        "Or, if only I could find an Iriomote wildcat to stay. [TLN: Click for more information about these cats!]",
        "They’re an endangered species so there’s no way they’d be there…",
        "When I saw Emma-chan looking forward to cats so much, I wished that there were at least some small feline animals.",
        "◆",
        "“Onii-chan, Onii-chan! It’s a tram! And it’s so fast!”",
        "When we got on the train to go to the zoo, Emma-chan started to get excited.",
        "I’m sure she’s ridden the train before when she came to our town, but I guess this kind of ride is unusual for her.",
        "Fortunately, it was a Sunday morning.",
        "The three of us were the only ones in the car, and there was not a single other person on board.",
        "So no matter how much noise Emma-chan made, she wouldn’t be a nuisance to the other passengers.",
        "“Mou~, Emma! I beg you, just sit quietly!”",
        "―but as a relative, I guess she can’t overlook it.",
        "Luckily, there were no passengers at the moment, but there were usually other passengers on the train.",
        "She doesn’t want people to make a fuss about it, so Charlotte-san is making sure it’s prevented before it happens.",
        "“Mou~…”",
        "Emma-chan, who was naturally warned, puffed up her cheeks and stared at Charlotte-san with dissatisfaction.",
        "It’s hard to ask a young girl to pay attention to her surroundings.",
        "However, it is important to teach her that what is wrong is wrong.",
        "It will be good for Emma-chan in the future.",
        "In fact, I wish I could see Emma-chan having fun more often―.",
        "“Emma-chan, do you want some of this?",
        "I took out the chocolate that I had prepared for Emma-chan from my shoulder bag and showed it to her.",
        "“Wow! Yes, Emma will have some!”",
        "Emma-chan’s earlier grumpiness disappeared and she took a bite of the chocolate as she had intended.",
        "It’s a cunning move, but if you want to achieve the goal of keeping her quiet, it’s quicker to distract her than to warn her.",
        "But I wasn’t going to give it freely here.",
        "“Hey, Emma-chan. If you want chocolate, why don’t you make a promise to Onii-chan?”",
        "“Promise?”",
        "Emma-chan tilted her head adorably in response to my words.",
        "Just the look on her face is enough to make me want to give her some chocolate.",
        "“Yes, but promise me. I’ll give you the chocolates, but please don’t make any noise on the train or in crowded places like this.”",
        "This was the real purpose for which I had taken out the chocolate.",
        "I don’t know if Emma-chan will be able to keep her promise here.",
        "But it should have some effect.",
        "“Yes! Emma’s going to be quiet! So, give me some of that!”",
        "Well, of course, Emma-chan promised with a big smile on her face.",
        "Now I can only hope that she will pay attention to her promise.",
        "I don’t know how a four-year-old can have a conversation like this.",
        "“Thank you. Well then, here’s your chocolate.”",
        "“Nom…!”",
        "As soon as I handed her the chocolate, she opened the package and started eating it.",
        "It was cute how she puffed up her cheeks like a squirrel and gobbled it up, but I think she ate too much at once.",
        "I hope she doesn’t choke on it..",
        "“Aoyagi-kun is getting better and better at handling Emma… Just as I expected…”",
        "Hmm?",
        "Charlotte-san, is there something wrong?",
        "I felt a passionate gaze on me, and when I looked next to me, Charlotte-san was staring upwards at my face.",
        "But as soon as our eyes met, she turned her face away, so I couldn’t tell what it was.",
        "Was there something she wanted to say…?",
        "―While the train was arriving at the next station, I couldn’t help but notice Charlotte-san glancing at me as she sat with Emma-chan on her lap."
    ]
}