{
    "id": "chapter-138",
    "title": "Flirting on the Bed",
    "content": [
        "Translator: AJ1703",
        "Chapter 138: “Flirting on the Bed” [TLN: the title is actually Bedtime Flirting but they just woke up so…]",
        "“―Zzzz… Zzzz…”",
        "When I woke up in the morning, I found my cute girlfriend’s sleeping face in front of me.",
        "It seems that by waking up before the alarm, I was able to see her sleeping face.",
        "She is currently using my arm as a pillow.",
        "I wanted to hug her so much because I love her so much.",
        "―But of course, I didn’t want to wake her up, so I didn’t do that.",
        "“Charlotte-san was so cute yesterday…”",
        "Staring at her cute sleeping face, I recall how distraught she was yesterday, with her face turning red.",
        "I knew she had sensitive ears, but judging from yesterday’s reaction, it seems to be quite a weakpoint.",
        "Charlotte-san showed an attitude that seemed reluctant, but judging from her subsequent behaviur, she probably wasn’t really against it.",
        "In fact, she’s probably more M than she seems.",
        "Despite looking reluctant, she actually looked like she was expecting it…",
        "I don’t have much knowledge in that area, but I’ll still do my best… [TLN: I thought MC reads a lot of novels/manga?]",
        "“Mm…”",
        "As I was thinking about this, Charlotte-san’s eyes faintly opened.",
        "It seems she also woke up before the alarm.",
        "“Good morning.”",
        "“Ah… good morning… to you…”",
        "When I called out to her, she greeted me back with sleepy eyes.",
        "She looks cute when half-asleep.",
        "And suddenly, she snuggled up to me.",
        "She then rubbed her cheek against my chest.",
        "“Ehehe~…”",
        "Charlotte-san, who’s acting spoiled, lets out a very happy laugh.",
        "Maybe because she’s still half-asleep, she seems even more clingy than usual.",
        "However― of course, I’m happy to have her act spoiled towards me, so there’s nothing wrong with that.",
        "“There, there…”",
        "I gently stroke the back of Charlotte-san’s head.",
        "Being able to receive this kind of morning was a great blessing.",
        "―Charlotte-san, who became fully conscious, seemed very embarrassed, but I think it’s too late for that now."
    ]
}