{
    "id": "chapter-48",
    "title": "Agonizing Death",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "“Yesterday, and even today huh, Aoyagi. I’m glad you seem to be relaxed even though you have a test tomorrow.”",
        "“As expected of the person who took the national mock exam in the single digits.”",
        "Miyu-sensei and the others teased me while looking at me and Charlotte-san’s faces in turn.",
        "I’m sure the lolicon teacher, or perhaps Sasagawa-sensei, doesn’t understand what Miyu-sensei meant by “Yesterday, and even today”, but I think she was referring to the fact that she played with Aki yesterday.",
        "“―A single-digit ranking in the national mock examinations… that’s just how geniuses are normally huh…”",
        "Before I could open my mouth, Charlotte-san, who is still hugging me, muttered in surprise.",
        "Or rather, why isn’t she letting go of my hand in this situation…?",
        "“It’s thanks to all the studying I’ve been doing in my spare time. And it just so happens that I’m in single digits.”",
        "This is not being modest, it’s just sheer luck.",
        "If I was really good, it would be better if I could get into the double digits.",
        "It was uncomfortable for me to be praised for an accidental result.",
        "“Humble, genius.”",
        "“Humble, genius-kun.”",
        "“…Would you two mind shutting up your mouths for a minute?”",
        "I was disgusted with the teachers who were always making fun of my words.",
        "Especially Miyu-sensei, you know very well that I am not a genius.",
        "“Hey, hey, more importantly, Aoyagi-kun, let me hold that child.”",
        "Sasagawa-sensei, who seemed to be going at her own pace, brushed off my words and held out her arms to me.",
        "She seemed to be eager to hold Emma-chan in my arms.",
        "I can understand that from Emma-chan’s cuteness, but I don’t want to give it to this person…",
        "Sasagawa-sensei is famous for being a lolicon teacher in our school.",
        "There was a reason why she was given such a nickname, even though she was a woman.",
        "At first glance, the combination of Sasagawa-sensei and a loli might seem like a motherly woman and her child.",
        "Especially since Sasagawa-sensei looks like a gentle, mature woman and has a large part of her that is feminine, though I won’t say where.",
        "However― this person’s eyes change when she talks about lolis in particular.",
        "The way she looks at Emma-chan, even now, is kind of weird.",
        "“Hey, it’s okay, right?”",
        "Perhaps because I didn’t give Emma-chan to her, Sasagawa-sensei closed the distance and looked up at me.",
        "In the meantime, I felt as if Charlotte-san, who was hugging me, was squeezing my arm.",
        "But before I could even react to that, Emma-chan in my arms suddenly flailed and let out, so I had no time for that.",
        "“Mou~…! Mou~…!”",
        "“Ouch! It hurts, that hurts!”",
        "Emma-chan slaps Sasagawa-sensei’s hand with a crisp.",
        "Sasagawa-sensei, who was hit on the hand, hurriedly withdrew her hand and became teary-eyed.",
        "What in the world just happened…?",
        "What made Emma-chan angry all of a sudden?",
        "“I-I’m very sorry for that, sensei! Actually, Emma doesn’t like to be touched by people outside of her family…!”",
        "Charlotte-san’s face turned pale at her little sister’s rudeness and she apologized, but I noticed that there was already a contradiction in her explanation.",
        "And it seems that I am not the only one who noticed the contradiction.",
        "“But I don’t think Aoyagi-kun is family either…”",
        "Sasagawa-sensei, who noticed the same contradiction as I did, said so and gave Charlotte a poke.",
        "The fact that I’m not a family member of hers currently, and I’m carrying her in my arms, contradicts the term “outside the family”.",
        "“It seems that Aoyagi-kun is special to Emma.”",
        "“I see…”",
        "After Charlotte-san’s explanation, Sasagawa-sensei’s shoulders slumped in disappointment.",
        "I felt kind of sorry for her.",
        "“Don’t feel sorry for her. She’ll be fine after a few minutes.”",
        "As I was feeling sorry for Sasagawa-sensei, Miyu-sensei, who had been silently listening to the conversation, joined the conversation.",
        "I hadn’t noticed at school that these two were so close to each other that they would come to a place like this alone.",
        "They seem to be complete opposites in personality.",
        "“Miyu-sensei, why were you two here at the zoo?”",
        "“Hmm? Ah… it’s because that teary-eyed, depressed lolicon over there kept nagging me about going to see the animals. I really don’t know what I’m doing on my day off…”",
        "“You’re still going out with her even though you’re complaining. It is very unusual for Miyu-sensei to go to the zoo.",
        "“I’m going to let you off the hook for now for saying something that sounds out of place. She and I have known each other since childhood, and I know how annoying it can be later if we don’t go out together, so that’s why I’m here.”",
        "Miyu-sensei told me while looking at Sasagawa-sensei in a hassle-free way.",
        "I’ve never even heard of these two being childhood friends.",
        "Well, I don’t really care about the relationship between the teachers, but who would’ve known?",
        "“You know, Miyu-chan is a tsundere in spite of the fact that she looks like this. Even though she complains a lot, in the end, she will definitely go out with you and be kind.”",
        "―Just like what Miyu-sensei said earlier, in a matter of minutes, Sasagawa-sensei had joined the conversation with a nonchalant expression.",
        "“I’ve always told you to call me Hanazawa-sensei in front of the students. Also, who are you calling a tsundere?”",
        "“Miyu-chan.”",
        "“…………”",
        "Sasagawa-sensei’s immediate answer caused blood vessels to appear on Hanazawa-sensei’s forehead.",
        "I took Charlotte-san and Emma-chan and quietly moved back to a position where we wouldn’t get collateral damage.",
        "“Oh, that’s right. Aoyagi-kun, do you know why Bennett-san is in Miyu-chan’s class?”",
        "“Eh, no…”",
        "Sasagawa-sensei didn’t seem to notice Miyu’s condition, and continued to talk to me as if nothing had happened.",
        "I wish she’d stop talking to me right now…",
        "“It’s because you’re here you know? Bennett-san would feel more comfortable if she had a classmate who was also fluent in English. Otherwise, there’s no way Miyu-chan would put her in a class where no one understands English.”",
        "Sasagawa-sensei said so while laughing, as if she was telling a funny story.",
        "I wonder if this person is really a childhood friend of Miyu-sensei.",
        "She had been relentlessly stepping on landmines since earlier…",
        "Well, I guess that lack of reserve shows the depth of their relationship.",
        "Now then―",
        "“Eh? Aoyagi-kun? Hey, where are you going?”",
        "As I turned on my heel, Sasagawa-sensei made a strange noise.",
        "Charlotte-san followed me with a worried look on her face.",
        "She must be aware of the tragedy that will follow.",
        "Emma-chan is still puffing out her cheeks in frustration and pressing her face against my chest, as if she’s still angry.",
        "“Oi! If you ignore me, you’ll make me cry― Eh? Miyu? Why are you reaching over here― ahhhhhh!”",
        "As soon as we turned our backs, we heard Sasagawa-sensei’s screaming voice.",
        "Why didn’t that person foresee this situation?",
        "A childhood friend would have known…",
        "―We listened to Sasagawa-sensei’s screams and left the place as if nothing had happened."
    ]
}