{
    "id": "chapter-75",
    "title": "Relationships That Ended and Began",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "―Finally, this happy time is coming to an end.",
        "The sky was completely dark, and I was now on the train heading home.",
        "Charlotte-san is hugging her stuffed cat and burying her mouth in it, as if she’s satisfied.",
        "Nevertheless, she’s hugging my arm as well and seems to be back to her pampering mode as she puts her own head on the arm of my shoulder.",
        "We haven’t talked since we got on the train, but even though we haven’t talked about anything, I feel extremely happy.",
        "<<I’m happy just being with the person I love.>>",
        "I sometimes hear people say that, but it’s true that if I’m with someone I love, I’m happy just being with them.",
        "I want this kind of time to continue forever.",
        "But we can’t stay like this forever.",
        "It’s natural that it will end when we go home, but I also want to end this relationship itself.",
        "And I want to make a new relationship.",
        "It may seem strange to move on to a new relationship after meeting less than two weeks ago, but I guess it can’t be helped since the day was so dense.",
        "…To be honest, there’s a part of me that would be fine with the way things are.",
        "She has already started to show a very cute side to me, and it is clear that if I were to confess my feelings to her and it turned out that I was wrong, the relationship would be worse than it is now.",
        "However, there’s a point to confessing even if I have to take that risk.",
        "I don’t want this kinf of a relationship to go on like this, and I want to make it clear here.",
        "I’ve already decided where I’m going to confess.",
        "There’s a place in our town that has a beautiful night view.",
        "We’ll need a vehicle to get there, so we’ll take a cab.",
        "It’s going to be a painful expense, but I want to make it a wonderful memory for her.",
        "That’s why I was planning to confess my love to her at a place with a beautiful night view.",
        "The only problem… is that she’s wearing light clothing.",
        "If we moved to a place where we could see the night view, I would have to drag her out into the cold.",
        "I want to make the best of the situation, but I don’t want to burden her.",
        "I could lend her my jacket, but she might not like the idea of being lent a jacket when we’re not even dating.",
        "If that’s the case, the best thing to do would be to have Charlotte-san put on the clothes she just bought.",
        "With the answer to the cold weather question out of the way, I decided to close my eyes and make up my mind.",
        "“―You’ve arrived at…”",
        "When the train arrived at the station― Charlotte-san looked up at me with a disappointed and lonely look on her face.",
        "I felt like my arms were being squeezed tightly in her embrace.",
        "“Well, uhh. Can I have… a little more of your time?”",
        "I managed to squeeze my voice out of my dry throat, feeling my nerves rising at this point.",
        "Then Charlotte-san nodded her head, her eyes shining with happiness.",
        "“Y-yeah…!”",
        "I wondered if she knew what I was trying to do, but unusually her voice turned over.",
        "I’m not sure if she was embarrassed that her voice was turned inside out, but her face, which was originally red, turned even redder and Charlotte-san attached her face to my arm.",
        "Apparently, she’s embarrassed and wants to hide.",
        "…What’s up with this cute little creature, like really?",
        "Just looking at her is enough to make my face loosen up.",
        "It’s hard to hold back when your reasoning is about to be blown away.",
        "“Well, I’m going to call for a cab now, but it’s going to be cold, so can I ask you to wear the clothes we bought today?”",
        "I had to ask her to put on the clothes we had bought earlier with the price tag still attached.",
        "I suggested with that in mind, but Charlotte-san shook her head.",
        "Her face is embedded in my arm, so it’s a little painful as it goes grizzly.",
        "“I don’t want to…”",
        "“But it’s cold, you know?”",
        "“I’m sorry, Aoyagi-kun. I’m glad you’re worried about me… but there are some things a girl has to prioritize more than the cold.”",
        "Is it her pride as a woman?",
        "Well, even a man can understand that feeling.",
        "It’s because they don’t want to be seen as unattractive in front of the opposite sex, so they prioritize dressing up.",
        "“Besides, my body is warm right now, so I don’t feel the cold.”",
        "Charlotte-san hugged my arms tightly and insisted that she was not cold.",
        "Indeed, she was right, I don’t feel cold right now.",
        "In fact, my body is so warm that I feel hot.",
        "…Is that it?",
        "Maybe this is the only night where the heat is still there.",
        "―As I caught a cab and moved on, I couldn’t help but think of such a silly thing.",
        "◆",
        "“Wow… It’s beautiful…”",
        "When we arrived at our destination, Charlotte-san let out a squeal of admiration when she saw the night view.",
        "She looked at the night view with a woozy expression.",
        "Once I got out of the cab, I asked the cab driver to wait for us for a while.",
        "He seemed to be a kind driver and agreed to wait.",
        "On the contrary―",
        "He even cheered me on in a small voice, saying, “Good luck.”",
        "He seemed to understand that we were not in a relationship and what we were here for just from our interaction during the car ride.",
        "I thanked the driver and walked next to Charlotte-san, who was admiring the night view.",
        "“Do you like it?”",
        "“Yes… It’s such a beautiful place…”",
        "This is a hole in the ground on top of a small mountain where the night view is very beautiful.",
        "It’s natural that she, who has just come to study abroad, doesn’t know about it, and even most of the people who live in this town probably don’t know about it.",
        "I didn’t even know about it until Akira brought me here a long time ago.",
        "I’m glad she likes this place.",
        "I’ll be sure to thank Akira for everything else he’s done for me.",
        "But― that’s only after I’m done with what I have to do.",
        "“Charlotte-san, may I have a word?”",
        "I asked, and Charlotte-san nodded her head and looked up at me.",
        "She was probably waiting for me to say something else.",
        "I took a deep breath and looked her firmly in the eyes.",
        "“Today was so much fun. I don’t think it’s an exaggeration to say that it was the happiest day I’ve ever had.”",
        "“Yes… it was, for me too…”",
        "When Charlotte-san heard my words, she smiled kindly and agreed with me.",
        "Then she gazed at my face with enraptured eyes.",
        "“I’m glad to hear that… Honestly, when we first met, I didn’t think me and Charlotte-san would ever get involved.",
        "“…………”",
        "I was expecting her to say something, but she seemed to be listening to me without saying a word.",
        "So I decided to keep talking.",
        "“It was obvious that you were going to be the most popular girl in the class, so I didn’t think that you would have anything to do with me being the most hated guy in the class. However, thanks to Emma-chan, I was able to talk to Charlotte-san. I didn’t expect her to come to my house and visit me, but I think I got to know you better in a short period of time because of the time we spent together.”",
        "If it weren’t for Emma-chan, I’m sure I wouldn’t have talked to Charlotte-san at all.",
        "It’s impossible to talk to a girl who’s so popular that she’s surrounded by people, it’s impossible to talk to her without taking action.",
        "And that idea of taking action never occurred to me.",
        "I would never have been able to get Charlotte-san to visit my house without Emma-chan.",
        "The reason Charlotte-san started coming over was so that she could use me to help her adjust to Japan.",
        "So, thanks to Emma-chan, Charlotte-san was able to come to my house and stay with me for a long time, and that’s how we became closer.",
        "Otherwise, it would have been impossible for us to become so close after less than two weeks of meeting.",
        "And at the root of all of this is Emma-chan.",
        "I don’t like to put it this way, but I can say that Emma-chan, who is as cute as an angel, has really played the role of an angel.",
        "She was the one who connected me with Charlotte-san, that’s for sure.",
        "“To be honest, I thought that Charlotte-san was a mature and elegant girl. But now I know that she’s not.”",
        "“…………”",
        "Perhaps because she was denied the idea of being a mature and elegant girl, Charlotte-san puffed out her cheeks and showed signs of sulking.",
        "If it had been a normal girl, she would have shown a mended smile, so now it was proof that she was showing me her true colors.",
        "“I’m glad to see the real you, Charlotte-san. I think you’re more attractive that way.”",
        "These were words that attacked the very edge of confession.",
        "It may not be the right thing to say right now.",
        "But I decided that it was necessary in order for Charlotte to be able to indulge herself in front of me in the future.",
        "It would be too embarrassing to say it again after missing out on this.",
        "“I thought about it again when I hung out with you today and saw how much fun you were having and how sweet you were being. I―”",
        "When I was about to say the next words, I was at a loss for words.",
        "<<I love you.>>",
        "I couldn’t come up with the words.",
        "I’ve come this far, and I was able to say what I was about to say, but I couldn’t get the important words out.",
        "I was stuck for words, and Charlotte-san was looking at me anxiously.",
        "She fidgeted with her hands and began to look at my face.",
        "You’ve got to be kidding me…!",
        "Don’t freak out at a place like this…!",
        "I realized that I had made her feel uneasy and managed to pull myself together.",
        "If I fail here, I’ll never be able to forget it and will regret it for the rest of my life.",
        "I must tell her here and now.",
        "“I―I’m in love with you, Charlotte-san. If you’d like, please go out with me.”",
        "Putting all my feelings into it, I confessed as best I could.",
        "Once I got stuck, I changed my words, but I managed to convey my feelings.",
        "All I had to do was wait for her reply.",
        "“…………I’m so happy. I’m really happy. I’m so happy that I can’t even put into words how happy I am…!”",
        "After a few moments of silence, Charlotte-san put her hand over her mouth and started to cry, but then she smiled happily at me.",
        "I guess she was so moved that she cried.",
        "I was relieved to hear Charlotte-san’s words and patted my chest.",
        "Of course I was happy, but I was more relieved that she had accepted me.",
        "“Does that mean it’s okay?”",
        "“Yes, of course…! I look forward to working with you from now on, Ao― no, Akito-kun…!”",
        "When I checked to make sure, Charlotte-san happily called my first name.",
        "I guess she took it a step further by going out with me.",
        "It might be hard for me to go out with a popular girl in the future.",
        "But if she smiles at me like this, I feel like I can do anything.",
        "As I stared at her beautiful smile, these words came to my mind.",
        "―Thanks to the thoughtfulness of the cab driver, Charlotte-san and I were able to enjoy some time alone together while looking at the night scenery.",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Comments: Volume 1 of Syosetu version ends here! So from c76 onwards until another certain chapter, obviously it’s the 2nd Volume."
    ]
}