{
    "id": "chapter-134",
    "title": "Flirting is Short-Lived",
    "content": [
        "Translator: AJ1703",
        "(**Akihito’s POV**)",
        "“”…………””",
        "Charlotte-san and I were left in our own room because they were going around to the other rooms.",
        "Or rather, we were told to stay here.",
        "It seems that their intention was not to disturb us from going around the house, but rather for us to stay here and flirt with each other.",
        "Charlotte-san is not as disturbed as she was in the previous room.",
        "“Ermm… it’s nice to have a big room, isn’t it?”",
        "I look at Charlotte-san’s face as she sits next to me, conscious of the space we have alone.",
        "We were sitting on the bed, by the way.",
        "There was a chair, but Charlotte-san was glancing at the bed, so we sat there.",
        "“You’re right…”",
        "Charlotte-san blushed and turned her head down, her index finger wriggling.",
        "She was cute when she came on to me like in the previous room, but she was also cute when she was so gentle and teasing like this.",
        "However, I could not hold a conversation with her for a while.",
        "“Oh, by the way, the butler said that the packages for the move will be brought to us, but when will they be delivered?”",
        "“I don’t know… Mom and the others seem to think it won’t arrive quite yet…”",
        "They are not too far from where I used to live.",
        "So it should be soon enough if they could bring it.",
        "But Sophia-san and Kanon-san were smiling when they left us in this room.",
        "That was the kind of smile that are telling me they wanted us to keep flirting with each other.",
        "If so, I think they had intentionally delayed the butlers because they would get in the way when they brought our luggage.",
        "“…………”",
        "As I was thinking about what to do, Charlotte-san started glancing at me in a pampering manner.",
        "If I let her be patient, she will probably start squirming on her own when she can’t take it anymore, but of course, I’d feel sorry for her.",
        "“Come here.”",
        "I put my hands around Charlotte-san’s waist.",
        "Then, Charlotte-san sits on my lap with a shy smile on her face.",
        "Since we were sitting facing each other, our eyes met at close range.",
        "I patted her head gently, and Charlotte-san closed her eyes.",
        "―I’m not so insensitive that I don’t know what she wants from me in this situation.",
        "So, I put my mouth close to Charlotte-san’s―.",
        "“Onii-chan, where are youuuu!?”",
        "The door opened with a loud bang.",
        "And then, bursting into the room was a teary-eyed Emma-chan.",
        "…I see, so this is how it’s gonna go huh."
    ]
}