{
    "id": "chapter-129",
    "title": "Flirting and Gratitude",
    "content": [
        "Translator: AJ1703",
        "(**Akihito’s POV**)",
        "“―We’re alone now, aren’t we…?”",
        "After we finished talking, Sophia-san and Kanon-san left the room to run some errands, and Charlotte-san looked up at me expectantly.",
        "She snuggled up to me and looked spoiled.",
        "“Alright, alright.”",
        "At first, I give her the head pat she likes.",
        "I pat her gently, and she rubs her cheek against my chest like Emma-chan.",
        "Because they are sisters, their behavior patterns are very similar.",
        "But now that we’ve gone through a lot of hardships, I feel like this is not enough.",
        "I wanted to spoil her more.",
        "“Do you want to sit on my lap?”",
        "“―!? M-May I…?”",
        "She looks up at me to confirm it, while looking like she wants to sit down on my lap.",
        "I could see the anticipation in her eyes, and I couldn’t help but adore her even more.",
        "“Come here.”",
        "And when I opened my arms, Charlotte-san sat down happily.",
        "Unlike Emma-chan, who just leans her back against me, Charlotte-san sits on her side.",
        "It was like she was a princess in my arms.",
        "“I can see your face better this way…”",
        "She looks shy, but stares at my face with eager eyes.",
        "Perhaps, she wants to kiss me?",
        "“………….”",
        "I could try kissing her right away, but I decided to tease her a bit.",
        "I gently stroke her cheek.",
        "“Nnn…”",
        "Charlotte-san wriggled ticklishly, but soon put her own hand over mine and pressed her cheek against it.",
        "She’s so cute.",
        "She’s totally indulgent.",
        "“Are you feeling ticklish?”",
        "“It tickles, but… what’s more important is that it makes me happy.”",
        "She’ll probably be happy no matter what I do to her.",
        "I put my forehead against Charlotte-san’s forehead.",
        "“A-Akihito-kun……?”",
        "“Thank you, Charlotte-san.”",
        "“Eh…?”",
        "I thanked her so suddenly that Charlotte-san seemed puzzled.",
        "But I really wanted to thank her from the bottom of my heart.",
        "“Because of you, I was able to face my past. Because of you, I feel very happy now. Because of you― I will be happy from now on. Thank you so much.”",
        "These words may sound a little bit cringy, but it’s just the two of us now.",
        "I hope she’ll forgive me this much.",
        "“That’s supposed to be my line, you know? I am very happy that I have met you, Akihito-kun. So, thank you very much. And― let’s both be happy together from now on.”",
        "I will never meet a more beautiful woman than Charlotte-san in the future.",
        "She is the world’s most wonderful woman.",
        "―After this, we enjoyed kissing in a space where no one could disturb us.",
        "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~",
        "Author’s Afterword:",
        "Thank you very much for reading(≧◇≦).",
        "It may seem like the last chapter of this story,",
        "But of course, this story is not over yet♪",
        "We will be entering the third volume in the next chapter,",
        "By all means, I would appreciate it very much… ♪",
        "If you found it interesting,",
        "I would be very happy if you could rate it (#^^#)",
        "Also, the book version is completely different,",
        "it’s also full of original content,",
        "I hope you will pick up a copy of the book as well.",
        "We will continue to do our best to make it into an anime!!",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Afterword: With this, the second volume is finally over. Hopefully it goes into a more wholesome volume but considering Nekokuro-sensei, the shenanigans ain’t gonna stop just here lmao. I haven’t read the light novel version much apart from what I’ve translated as I’ve still got no time, but someone asked me for a JitsuImo chapter so I might do that first. With that, I’ll try as much as I can to get to latest chapter for the web novel of this series. So I hope you guys stick around! If you want to support the light novel, you can buy them by clicking here. I also hope Nekokuro-sensei gets their dreams to come true (im referring to anime).",
        "And man, when will I get my own Charlotte-san? Despairge"
    ]
}