{
    "id": "chapter-111",
    "title": "Pick-Up Service",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Akito’s POV**)",
        "We boarded the bullet train and spent several hours reaching our destination.",
        "It was already getting dark.",
        "Can we even get a proper ride home?",
        "I don’t know of any other way to get home…",
        "“Do you want to stay at a hotel…?”",
        "“―!?”",
        "I’m not sure if it’s because of my thoughts that were showing on my face, but I received an unexpected suggestion from Charlotte-san, who had her arms crossed.",
        "When I looked at her, her cheeks were slightly red, and she was looking up at me as if she was expecting something with her feverish eyes.",
        "I’ve noticed that she’s surprisingly getting aggressive.",
        "“I-If we’re not able to make it home, we can do that.”",
        "I said with a smile, slightly nervous.",
        "I think it would be more profitable for me if we didn’t go home, but I don’t think it’s a good idea to be so blunt.",
        "Besides, I’ve come here to talk about something important.",
        "“Excuse me, my name is Akito Aoyagi.”",
        "I called out to the guard at the gate of the mansion.",
        "The guard, an Ojii-san [Edit: old person/ translated as uncle from time-to-time], was someone I knew and had talked to a few times when I came to the mansion.",
        "“Ojou-sama’s favorite soccer player from back then is now a man of the hour. You’ve grown up so much.”",
        "“Well, a lot has happened, so I was wondering if you would let us in…?”",
        "“Yeah, I heard about you. She’s all right too.”",
        "“Thank you very much.”",
        "When the guard looked at Charlotte-san, she bowed very politely.",
        "The guard opened the large gate to the house in a good mood.",
        "“Whoa, there’s your ride. Kid, get in that car and go.”",
        "The guard looked at the limousine that appeared as if he had anticipated the timing of the gate opening and urged us to go ahead.",
        "“We’re already on the premises, but you still have to drive.”",
        "“The yard is huge. Besides, if we walked around, the guard dogs might attack us.”",
        "“It’s like in a manga…”",
        "“It’s in really bad taste.”",
        "When I said this without denying it, Charlotte-san smiled as if she was troubled.",
        "There are no intruders now because of the security system, but I heard that there was a man who broke into the premises a long time ago.",
        "I heard from Kanon-san that the man was attacked by a group of guard dogs and was sent to the hospital.",
        "Just because it’s reality, that doesn’t mean that things like those absurd scenes in a manga don’t happen.",
        "As we were chatting, a maid with a familiar face came down from the driver’s seat.",
        "Even though it was on the premises, this house was really strange to let a high school student drive a limousine.",
        "“―How dare you show your face here, the very man who caused so much damage to Ojou-sama’s heart?”",
        "“Arisa-san…”",
        "The maid who got out of the car, Arisa-san, gave me a very cold look.",
        "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~",
        "Author’s Afterword:",
        "The cover illustration for “Otonari Asobi” is now available in the activity report!",
        "The design is very nice and matches the picture on the cover.",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Afterword:",
        "Hello everyone who reads this, I hope you guys could check out the anime PV for “Mamahaha no Tsurego ga Motokano Datta / My Stepsister is My Ex-Girlfriend” that our group worked on! You can watch it by clicking here. Leave comments, likes, or any feedback on things that we should improve on to make our future videos better!",
        "Also, the illustration the author was referring to, was in the last chapter. I put it there already, so if you guys need to see it again, just click the previous arrow link chapter down below this."
    ]
}