{
    "id": "chapter-39",
    "title": "Aggressive Beautiful Transfer Student",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "“―Eh? You want to go to school with me?”",
        "Just as we were about to go to school separately, Charlotte-san stopped me to ask for a favor.",
        "This is just me, confirming so.",
        "“Yes…Is it, a no…?”",
        "Charlotte-san stares at me with reddish cheeks and an upward glance.",
        "But apparently she is conscious of avoiding eye contact with me, and her gaze is directed at my neck.",
        "Erm, what’s with this situation?",
        "Why is Charlotte-san’s cheeks turning red?",
        "Moreover, why is she looking so bashful?",
        "I was puzzled by the sudden development as I observed Charlotte-san’s condition.",
        "She’s even cuter than usual right now, and I feel like I’m going to feel weird staring at her.",
        "More than anything, my heart was beating fast at her unexpected invitation.",
        "To be honest, I wanted to just accept her offer, but there was a reason why I couldn’t do that.",
        "“I’m sorry, but if anyone sees me, it’ll be a big hassle…”",
        "Charlotte-san’s dainty appearance makes her very eye-catching to everyone around her.",
        "Getting to school with her is like showing off our relationship to the people around us.",
        "At the very least, there would be a lot of rumors flying around that had no basis in fact.",
        "In the end, it would be a problem for Charlotte-san.",
        "So I refused.",
        "“We can go as far as where there are few other students going to school… Is that still not good enough for you…?”",
        "“But…”",
        "In your case, if there’s even one person, it’s out…",
        "I was about to say those words, but I noticed Charlotte-san’s shrug as I entered from the negative, and I swallowed my words.",
        "I still don’t know why she’s asking me out.",
        "But I could tell from her disappointment that she really wanted to go to school with me.",
        "The reason why I refused to go to school with her is because I don’t want Charlotte-san to get in trouble.",
        "But is that something that I should be protecting, even if I neglect her feelings?",
        "Instead of explaining it to her properly, I’ve been giving her other reasons to cover it up.",
        "I don’t want to make her feel uncomfortable, but because of that, I haven’t been able to ask her what she really thinks.",
        "One thing I do know is that Charlotte-san wants to go to school with me, even if she has to be seen walking with me.",
        "It’s hard to believe that she doesn’t understand what people might think of a man and woman walking together― after all, she’s an intelligent person.",
        "…..Yes, I want to go to school with Charlotte-san so much that I can think of many excuses right now…",
        "I get very nervous when I’m with her.",
        "But more than that, there is a sense of happiness that is hard to put into words.",
        "In short, I am happy just to be with her.",
        "As Charlotte-san said, it might be okay to go with her to places where other students rarely pass by.",
        "If something happened, we could make up some excuse like we just happened to run into each other.",
        "I’m sure Charlotte-san will be able to respond flexibly if that happens.",
        "Besides, this might be a chance to clear up the misconception that I’m scary.",
        "You don’t want to miss a chance, right?",
        "“I’m sorry, but I think I’ll go with you until we get to the part where there’s more people.”",
        "After much deliberation, I decided to take Charlotte-san up on her offer and answered with a smile.",
        "Then Charlotte-san looked at me with a puzzled expression, but after a moment, her expression changed to one of shock and she hurriedly shook her face from side to side.",
        "As I stared at her, wondering what was wrong, Charlotte-san ran her right hand through her hair, playing with it, and slowly opened her mouth.",
        "“T-thank you very much…”",
        "As she thanked me, Charlotte-san’s expression looked like a shy smile, and I turned my head away.",
        "Charlotte-san’s cheeks flushed red as she smiled happily, she was so attractive that staring at her almost made my face turn red.",
        "“W-well then, let’s go now…”",
        "I squeezed my voice out of my dying throat, because stopping like this would only make the time pass unnecessarily.",
        "Please overlook the fact that I was feeling a little smug.",
        "“Yes…!”",
        "Charlotte-san happily agreed, and I started to walk towards the school, but an unexpected event stopped me in my tracks.",
        "I don’t know why, but as soon as I started walking, Charlotte-san grabbed me by the sleeve of my clothes.",
        "“Cha-cha-cha-charlotte-san…!?”",
        "“Ah… Umm, is it… no good…?”",
        "When I called out to her, she looked up at me with a worried expression on her face.",
        "“No, it’s fine…”",
        "There was no way I could say no with that kind of expression on my face.",
        "I nodded my head immediately.",
        "“Ah― thank you very much…!”",
        "When I agreed, Charlotte-san thanked me again with a very happy expression on her face.",
        "And then she let out an “ehehe” laugh like Emma-chan, a kind of happy smile on her face.",
        "I looked at her and thought with a confused mind,",
        "<Foreigners, their sense of distance from their friends is too much…>"
    ]
}