{
    "id": "chapter-80",
    "title": "The Greatest Happiness and a Creeping Shadow",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "“―Neko-chan!♪ Neko-chan!♪”",
        "Emma-chan, who was crying out in her sleep, is now in a great good mood in my arms.",
        "The reason for this is because I gave her a stuffed cat that I got from the UFO catcher.",
        "Just as Charlotte-san had hoped, Emma-chan loved it so much that she kept playing with it while resting her back against me.",
        "Emma-chan’s good mood was so cute that my cheeks almost relaxed just looking at her.",
        "―If it weren’t for her right in front of me, I would have…",
        "I glanced up at her.",
        "Then there was Charlotte-san, staring at my face in a lonely way.",
        "Normally, she would be looking at Emma-chan with a warm smile on her face, but since we just started dating, she probably wants me to spoil her.",
        "I wanted to flirt with Charlotte-san if I could, but as expected, she treated the young Emma-chan as an obstacle.",
        "But that didn’t mean that I could leave Charlotte-san out of it, so I felt really guilty.",
        "Emma-chan seems to be holding on to what happened yesterday and gets angry when Charlotte-san comes near her, while Charlotte-san seems to be too worried about what happened yesterday to say anything strongly to Emma-chan.",
        "If I don’t take care of her, Charlotte-san might suffer from a puncture.",
        "I think it’s better to take action sooner rather than later.",
        "“Emma-chan, shall we go to the park to play?”",
        "I decided to take the two of them to the park to keep Emma-chan occupied and also to keep Charlotte-san entertained.",
        "I was worried about what people would think, but it wouldn’t be a problem since I could tell them that we were already dating.",
        "“Park…! Let’s go…!”",
        "Emma-chan nodded her head happily, as if she wanted to play outside.",
        "The rest is up to Charlotte-san―",
        "“I-I’ll just be staying at home…”",
        "Charlotte-san averted her gaze from us with a sad expression and chose to remain alone.",
        "Ah, so that’s how it goes.",
        "It’s true that it might be hard to ask Emma-chan to come along with us if she looks like this.",
        "I don’t have a choice… That would be a bit aggressive, but I’ll take care of the problem here.",
        "“Emma-chan, Charlotte-san can come with us, right?”",
        "I gently pat her head and ask her to agree in as gentle a voice as possible.",
        "If she says yes, Charlotte-san won’t have to worry about it anymore.",
        "However―",
        "“No…!”",
        "Emma-chan refused.",
        "She was in a good mood with her stuffed cat, so I was expecting a little more, but it seems that this is not the same thing.",
        "“Ugh…”",
        "Charlotte-san’s tears welled up slightly when she saw this.",
        "I pampered her a lot yesterday, but that did not heal her wounds.",
        "This situation seems to be quite painful for her, as she is disliked by Emma-chan.",
        "“Hey, Emma. It’s not good to be left out like that, you know?”",
        "“Lottie did it…!”",
        "When Emma-chan heard my words, she puffed up her cheeks and pointed at Charlotte-san.",
        "Apparently, it seemed to be that Charlotte-san had ostracized her and she was trying to get back at her.",
        "I don’t personally dislike the spirit of “if you get hit, hit back”, but I don’t think it’s the right thing to do right now.",
        "Because doing so will only deepen the rift and will not solve anything.",
        "“I’m sorry I couldn’t take you out to play yesterday. But I didn’t do it because I wanted to be mean to you, Emma-chan.”",
        "“Mou~…!”",
        "Apparently she didn’t like what I said, because she puffed up her cheeks and slapped my hand.",
        "I didn’t really hit her, but she seemed to think it was a protest.",
        "I smiled back as I gently patted the cute little girl on the head.",
        "“Charlotte-san can’t always be with Emma-chan, you know. Don’t you understand that?”",
        "I’m sure that a normal young child would not understand what I’m saying.",
        "But Emma-chan is a smart kid, even though she looks like this.",
        "And she’s really a good and kind girl.",
        "So I dared to say it this way.",
        "“…………”",
        "When Emma-chan heard my words, she fell silent and stared at my face.",
        "I could tell from her gaze that she was observing me.",
        "“And this cat was chosen by Charlotte-san, you know?”",
        "“Lottie chose it…?”",
        "“Yes, she thought Emma-chan would like this one.”",
        "“…………”",
        "Emma-chan’s gaze turns to the stuffed cat.",
        "Then, after staring at the stuffed animal for a little while, she began to stare at Charlotte-san’s face.",
        "Eventually, she got off my lap and walked towards Charlotte-san.",
        "“Emma…?”",
        "“Mhm.”",
        "Emma-chan went up to the front of Charlotte-chan and offered her head.",
        "Maybe this is―",
        "“Can I stroke it?”",
        "“Mhm.”",
        "“Thank you…”",
        "With Emma-chan’s permission, Charlotte-san began to stroke her head gently and carefully, as if she were handling something precious.",
        "Then, Emma-chan turned her body around and sat down on Charlotte-san’s thighs.",
        "She then directly put her weight on Charlotte-san.",
        "“Emma…”",
        "Charlotte-san shed a few tears as she looked at Emma-chan.",
        "I don’t know if they were tears of relief or tears of emotion over Emma-chan’s actions.",
        "One thing I do know is that they have a different meaning than the tears she had been crying just now.",
        "When Emma-chan offered her head to Charlotte-san, she meant that if she patted her head, she would let yesterday’s incident go by the wayside.",
        "Emma-chan is a clever girl who knows how to make up for her mistakes.",
        "I felt a strange warmth in my chest as I watched Charlotte-san holding Emma-chan in her arms, looking so happy in front of me.",
        "◆",
        "“―Then, please call me when you are ready.”",
        "Charlotte-san, who was holding Emma-chan in her arms, was about to leave my room because I was going to take a quick shower.",
        "Looking at her radiant smile, it seemed that there was nothing more to worry about.",
        "“Yes, I’ll be in touch soon.”",
        "“Yes, please do. I’m sure she’s eager to play with Aoyagi-kun as soon as possible.”",
        "Charlotte-san then looked down at Emma-chan, who was sleeping in her arms.",
        "After that, Emma-chan started to be pampered by Charlotte-san, but perhaps she didn’t get enough sleep, because after a while, she started to fall asleep.",
        "Charlotte-san and I watched her in silence, and she fell asleep.",
        "So I decided to take a quick shower while I could.",
        "“I’ll see you later.”",
        "“…………”",
        "“Charlotte-san?”",
        "I thought she was going to go back to her room, but for some reason Charlotte-san didn’t want to move.",
        "In fact, she began to stare at my face with reddened and moist eyes.",
        "No way, could this be―!",
        "“Umm, I’d like to talk to you later about our future together… I-It’s an embarrassing story, so I’d like to talk to you about it when we’re alone, if possible…”",
        "……Yes, that’s right.",
        "What were you even expecting, idiot self…",
        "“A-Aoyagi-kun…?”",
        "“Oh, ah, sorry. Yes, you’re right. Let’s talk again later, just the two of us.”",
        "Charlotte-san became confused as I despised myself for having stupid expectations, so I hurriedly made a smile and mended it.",
        "“Thank you very much…! W-well then, I’ll be back.”",
        "“Yeah, see you later.”",
        "This time, she would leave.",
        "I was thinking that, but for some reason she stopped.",
        "And then―",
        "“Um, I love you, Akito-kun…!”",
        "I thought she looked back at me, but then she said that with a sly smile on her face that turned bright red.",
        "“―!?”",
        "“W-well then, I’ll see you later…!”",
        "Charlotte-san left the room, looking embarrassed.",
        "I stood there dumbfounded from the shock of hearing my first name called and the words said to me.",
        "When I finally came back to myself, I slumped to the floor.",
        "“Th-that’s a foul play, Charlotte-san…”",
        "It was Charlotte-san’s face and words that came to mind.",
        "If I’m not careful, it’ll be stuck in my head for a few days.",
        "“This is definitely the happiest time of my life…”",
        "She’s so cute.",
        "I’m so happy with her.",
        "She’s the one I want to be with for the rest of my life.",
        "I was just grateful to have met such a girl.",
        "To be honest, even if I had to make up for all the misfortunes I’ve had in my life, I’d still be able to afford the change.",
        "―――――However, it was only for a short time that I was able to feel such happiness.",
        "It all started with the sudden ringing of the intercom.",
        "―*Ding-dong!",
        "“Hmm? Charlotte-san, did you forget something?”",
        "A few minutes after Charlotte-san left, the intercom rang, so I opened the door, thinking that she had returned.",
        "But what stood in front of the door was not Charlotte-san, but someone I hadn’t expected.",
        "“W-why, are, you, here…?”",
        "I couldn’t help but ask.",
        "I wanted to believe it was a lie.",
        "After all, the fact that this person had come to me―",
        "“It’s been a while, Akito-sama. Don’t worry, I’ve brought you a good story.”",
        "The one who smiled at me was Arisa Kusanagi― an older woman two years older than me, dressed in clothes that would not look out of place in a normal family.",
        "She’s a maid in the Himeragi family who has custody of me.",
        "To be honest, her smile looked like the smile of the devil to me at that time.",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Comments: Fck, it looks like the parents of the MC are behind this. We’re about to dig over the MC’s background in the upcoming chapters guys.",
        "Also, thank you for Fire-san who donated $50 to finish off my Ko-Fi goal for the laptop! My mother insisted that I change the goal into $250 or something but I wanted to let Matsu have the donos for a bit since he’s done so much for me and also for you guys since he edits the chapters at my pace. Other editors in our group are scared of me overworking them like I’m doing right now to Matsu so yeah xD.",
        "Matsu needs funds in order to buy a new phone. The current one he’s using to edit the chapters is a bit trippy according to him which needs a replacement soon before it’s gone and resorting to borrowing from his family which would be a bad thing since he won’t be able to have much time in order to keep up with me.",
        "Anyways, not all may have read my TLN at c75, Volume 1 of the story ended there and Volume 2 started at c76 obviously. Volume 2 is entitled “Two People Supporting Each Other”. From what I can make out on the title and this very chapter, it seems that the hardships about MC’s characters are about to come out now and he may lose his cause somewhere along the way so I could probably see Charlotte helping Akito on his problems. They’re in a relationship so it’s a give and take from one another. I haven’t read up with the raws so please, don’t even dare to try and spoil in the comments as I may issue an IP ban so that not only you can’t read this series, but also the other ones in our website."
    ]
}