{
    "id": "chapter-102",
    "title": "It's Your Fault",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Akito’s POV**)",
        "“Why did you blame Kano― that Onee-san for that, Akito-kun…?”",
        "When Charlotte-san heard my words, she did not blame me, but asked me in a gentle voice.",
        "I wonder why she rephrased it, but I think her gentle voice was her way of telling me that she wasn’t going to blame me.",
        "She was as kind as ever.",
        "“I used to live in an orphanage until just before summer vacation.”",
        "“Eh…? But you’ve been with that Onee-san since you were young…”",
        "“She suddenly appeared in front of me when I was very young and she said she was going to be my sister. She was a very sweet person, but if you didn’t treat her like an older sister, she would sulk.”",
        "“She’s a cute person…”",
        "When I told her what kind of person Kanon-san was, Charlotte-san became a little depressed, despite her words.",
        "Then she attached her body to mine again and slid her face into my neck.",
        "What is it… jealousy, I wonder…?",
        "“Erm, Charlotte-san is cuter though…”",
        "“―!?”",
        "I thought she might have been jealous, so I held back my embarrassment and lifted her up.",
        "Then, in a moment, her face turned bright red and she pressed her face to my chest in embarrassment.",
        "Yes, I think she is the cutest girl in the world.",
        "“―And what were we talking about again…?”",
        "I’ve completely strayed from what we were talking about, and I’ve momentarily forgotten what we were talking about.",
        "“The reason why you blamed her, Akito-kun?”",
        "“Oh, that’s right. Actually, the orphanage I was living in was going to be torn down around the beginning of summer vacation.”",
        "“Eh…?”",
        "“I heard that they were having financial difficulties. So they decided to find a place to take in the children from the orphanage, and Kanon-san was the one who took me in.”",
        "To be precise, Kanon-san asked her father to take me in, and he did a lot of work to get me taken in.",
        "I heard that foster parents can’t really choose their children, but I guess that’s the power of a wealthy man.",
        "To be honest, I didn’t know much about Kanon-san’s father at that time.",
        "We hadn’t really talked about anything in-depth.",
        "However, I had assumed that he was a good man because he had been spending a lot of money on me since I was young, but he hadn’t paid attention to me.",
        "It never occurred to me that when the idea of taking me in came up, all he was thinking about was using me as bait.",
        "“Onee-san was very fond of Akito-kun…”",
        "“Well, I’m sure she loved me.”",
        "Otherwise, she would not have done so many things for me like that.",
        "But―",
        "“I’ve hurt someone like that, haven’t I…?”",
        "Why did I say such a horrible thing to someone who had done so much for me for almost ten years?",
        "I’ve done something stupid that I can’t even begin to regret.",
        "“How did you end up blaming her…?”",
        "“I said that it was all Kanon’s fault that I ended up like this. I told her that it was all her fault that things turned out the way they did because she put her hands around me to take me in.”",
        "When-san Charlotte heard my words, she opened her eyes as if she was very surprised."
    ]
}