{
    "id": "chapter-82",
    "title": "The Way It was Made",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "“A marriage proposal…?”",
        "The words I heard were so unexpected that I couldn’t help but repeat them.",
        "“Yes, the other party is from a business partner of the Himeragi Conglomerate, a young lady of the same age as Akito-sama.”",
        "“Are you insane? I have a girlfriend and you think I’m going to allow you to talk like that?”",
        "“Fufu, do you really think you have a choice? This is the Master’s order, you know?”",
        "As she said that, Arisa-san slid her hand from my cheek and placed it on my neck this time.",
        "She wasn’t choking me, but rather positioned her hand as if she was checking my pulse.",
        "“It’s true that if you’re a member of the Himeragi family, the Master’s will is absolute. But I’m not a full member of the Himeragi family yet, am I?”",
        "Even though the Himeragi family has custody of me, I’m not recognized as a member of the Himeragi family.",
        "That’s why Arisa-san can do such disgusting things to me, even though she is supposed to be a member of the family that I serve.",
        "“Are you sure you want to turn this down?”",
        "“Yes, I can’t deal with this nonsense anymore. I have no problem not being a part of the Himeragi family anymore as long as I don’t lose her.”",
        "“You’re telling me that you’re throwing away a wealthy and prosperous future because of your foolish… temporary feelings?”",
        "“My feelings for her are not temporary. No matter how well off I may be in the future, if I lose her, I will definitely regret it.”",
        "“…I see, you seem to have a firm will. Good grief, you’re an irredeemable person, aren’t you?”",
        "As if in disgust, Arisa-san exhaled a sigh.",
        "My guess is that she’s really dumbfounded.",
        "“You can call me whatever you want. But I’m definitely not going to accept that marriage proposal. Please tell that to President Himeragi as well.”",
        "“I understand.”",
        "With Arisa-san’s words, her hand was removed from my neck.",
        "However―",
        "“That means, you’re going to hurt Ojou-sama again, aren’t you?”",
        "“―!”",
        "The moment I thought she had given up, a very cold voice pierced my chest.",
        "Arisa-san glared at me with a negative aura that could be called a killer radiating from her entire body.",
        "From how she looks, she could have killed a person or two.",
        "“You’re going to hurt Ojou-sama once again, who has been devoted to you since she was a child, and who still cares about you even after being hurt by you? What’s more, this time around, it’s in a form of betrayal!?”",
        "“That’s…”",
        "I couldn’t find the right words to express my pain.",
        "If I say betrayal, it would be betrayal.",
        "The one who arranged for me to join the Himeragi family was the Ojou-sama that Arisa-san had mentioned.",
        "She appeared in front of me as if she was replacing the Onee-san that I had admired.",
        "And when I thought she suddenly said something I didn’t understand about making me her little brother, she really took care of me like a little brother.",
        "I’ve hurt such a person badly in the past.",
        "I told her that it was all her fault and that I was only taking it out on her.",
        "And yet, she only apologized to me and never complained about me at all.",
        "She’s a really kind and nice person, probably as good as Charlotte-san.",
        "I’ve hurt such a person, and even now I’m not able to make amends for that.",
        "There’s no way Arisa-san could have allowed me to hurt her again.",
        "“…Also, this marriage proposal was made by the other side.”",
        "After staring at my face for a bit, Arisa-san’s expression somehow returned to a smile and she said something unexpected in a gentle voice.",
        "I reacted to Arisa-san’s words while her face flickered in my mind from the conversation we had just had.",
        "“Eh…? But that’s…”",
        "“Yes, the question arises as to why the other party knew of your existence, which we have not made public. But to tell you the truth, the other party is of a higher rank than the Himeragi Conglomerate, so it might not have been difficult for them to obtain some information about us.”",
        "They were able to find out something about me that the Himeragi Conglomerate was hiding?",
        "I don’t think that’s possible…",
        "No, to begin with―",
        "“Only a handful of people in Japan… are more prestigious than the Himeragi Conglomerate, right? Why would a marriage proposal come from such a place…?”",
        "“The aim may be absorption. That’s why we’ve been talking about it for quite some time, but they’ve been very cautious and we haven’t been able to shake their heads. However, we’ll probably be able to reach an agreement today.”",
        "The fact that she said it outright meant that it would probably be finalized.",
        "She’s a person with a very difficult personality, but she’s also a very talented person.",
        "I’ve heard that she has a better sense of smell in this area than most good managers.",
        "And perhaps she knows something that will lead to that confirmation.",
        "“Have you corroborated that this is a political marriage for mutual benefit rather than absorption?”",
        "“Well, sort of.”",
        "“But why should I be… not blood related to, and would normally be avoided by others…?”",
        "If you are not a blood relative, you can be discarded without mercy, and for lack of a better term, you are not a hostage.",
        "Why did they go to the trouble of picking me when they could have easily betrayed me?",
        "“It’s because the other party’s children are both female.”",
        "I see, that certainly explains why they chose me instead of that woman.",
        "But do you really want to go so far as to have a political marriage with the Himeragi family?",
        "I don’t know anything about the world of rich people, so I’m not very familiar with the situation.",
        "However, I do know one thing.",
        "“In other words, I’m the only one who can take it, and if I turn it down, I’ll be on the radar of both families…”",
        "“As expected, even you can understand this. So yes, if you want to break this story, he will try to destroy your future. At the very least, the Master will.”",
        "“…That man might do it.”",
        "The current head of the Himeragi family, President Himeragi, is a very sinister man.",
        "He laughs off the word “justice” and is not afraid to do anything that goes against the law as long as it benefits him.",
        "My life was ruined by this man when I was in middle school.",
        "So, if he’s that big this time, he’s going to hold on to the fact that I broke up with him and try to make me feel hopeless.",
        "“That’s what I’m talking about. And actually, I have another piece of information.”",
        "“…I don’t want to hear it, but I will.”",
        "“Yes, I think you should hear it. Akito-sama’s girlfriend, Charlotte Bennett, her mother has been dispatched from an overseas company to a branch office in Japan, where she’s in the position of chief executive officer. The company’s client for the project is one of the companies run by the Himeragi Conglomerate. If this project were to go under due to the scale of the project, it would probably cause a lot of damage and you would have to take responsibility for it.”",
        "“…Just how dirty can you people be…?”",
        "I couldn’t help but swear.",
        "In other words, if I kicked this deal, it would not only affect me, but Charlotte-san’s family as well.",
        "I don’t think they would normally do it if it would cause a lot of damage, but that guy would make it so that it wouldn’t be a loss for them alone, and then simply flip it around.",
        "He knows what will work best for me, and he’s playing his hand.",
        "I really don’t know how much more of this stuff they can take from me.",
        "“There’s still time for you to think about which way you wish to go. That’s what I came to tell you today.”",
        "Arisa-san seemed to have really come for that purpose and then quickly left the room.",
        "After confirming that she had left the room, I slumped against the wall.",
        "“Why is this happening to me…?”",
        "I was talking to myself, not talking to anyone.",
        "I want to complain out loud that I just got engaged to Charlotte-san and this is not the way it should be.",
        "It’s not like I can’t decide which way I want to go.",
        "I can’t let her be unhappy because of me.",
        "That’s the only thing I have to avoid at all costs.",
        "One thing that was fortunate for me was that I hadn’t told everyone about my relationship with Charlotte-san yet.",
        "We were the only ones who knew that Charlotte-san and I had started dating.",
        "This would allow us to start over with little impact on her friendships.",
        "“―I’m sorry, I can’t play with you today. I’m really sorry.”",
        "That was all I said to Charlotte-san, and I felt my whole body relax and I couldn’t stand up.",
        "I don’t know if it was the fact that I had been up all night, or if it was just the fact that I was so uptight― but I started to feel sleepy.",
        "I didn’t want to move anymore, so I fell asleep in front of the door.",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Comments: Welp, that turned dark all of a sudden."
    ]
}