{
    "id": "chapter-115",
    "title": "Nostalgic Face",
    "content": [
        "Translator: AJ1703",
        "(**Akihito’s POV**)",
        "I, who was caught off-guard, narrowly avoided the teacup.",
        "I never thought it would be thrown at me all of a sudden.",
        "It seems that he’s really angry towards me.",
        "“What are you doing!?”",
        "Charlotte-san was the first to raise her voice while I was stunned.",
        "She stood up, unusually angry.",
        "And then, Kanon-san also spoke up.",
        "“You really are a small-minded person. You have finally shown your true colors through violence with your anger.”",
        "Although her voice was calm, you could somehow tell from her words that she was angry.",
        "Similar to Charlotte-san, Kanon-san also got angry which is very rare.",
        "I felt bad for the situation, but I was still happy that they were angry for my sake.",
        "“Shut up! Do you understand, Akito Aoyagi!? Who do you think is paying for your living and education!? You betrayed me!”",
        "“It was Father who betrayed him first. And he promised you that he would pay you back for the living expenses, didn’t he? Why are you being presumptuous?”",
        "“I told you to shut up! Listen, Akihito Aoyagi! If you accept the proposal, you will get a large amount of assets and the company! And now that Kanon has betrayed me, if you take my side, you will be the heir to the Himehiragi Conglomerate! There are plenty of women like her out there! Think carefully about which side you’re going to be on!”",
        "He must have been going insane.",
        "President Himehiragi is so eager to persuade me, but he doesn’t seem to realize that he’s picking a fight with me.",
        "If he can’t get me on his side now, it will be the end for him.",
        "“Akihito-kun…”",
        "“It’s all right.”",
        "Charlotte-san looks up at me anxiously, and I gently pat her head to reassure her.",
        "I’m not so foolish as to make a mistake in judgment here.",
        "“I’m sorry, President Himehiragi, but my answer will not change.”",
        "“Why!? You’re simply just so excited about your new girlfriend! Think about it more carefully! The money that ordinary people will never get is yours!”",
        "“There are some things that money can’t buy― as what others have said. For me, Charlotte-san is more important than money or my life. And I will not forgive you for saying those insulting words about her.”",
        "Maybe President Himehiragi, who has lived on a lot of money, and I, who have experienced a life of hardship, have different ways of thinking.",
        "To be honest, I feel sorry for President Himehiragi.",
        "He has lived more than twice as long as I have, and yet he doesn’t know the most important things.",
        "“I think we’re done here, right?”",
        "She must have been convinced that I would not change my answer.",
        "Kanon-san gets up and walks toward the door.",
        "“W-Wait a minute! It’s too early to give up!”",
        "“No, it’s over. You missed your last chance. What you did was not to persuade Akihito, but to push him in an unseemly way and make him angry. Such a person, the head of the Himehiragi Conglomerate, is not worthy.”",
        "Kanon-san turns cold eyes on President Himehiragi.",
        "It is not the kind of look you would give to your parents.",
        "It seems that she’s cutting her ties with President Himehiragi as she said that.",
        "Then she slowly reaches for the door.",
        "“―We’ve come to a conclusion. Please come in, Ojii-sama, Onee-sama.”",
        "With these words, Kanon-san opened the door, and on the other side of the door stood a white-haired old man with a long beard and a woman who looked just like Charlotte-san.",
        "I had never seen the old man before, but the woman―",
        "“Onee-san…?”",
        "―I was sure that she was the person who had taken care of me when I was young."
    ]
}