{
    "id": "chapter-139",
    "title": "Promise",
    "content": [
        "Translator: AJ1703",
        "Chapter 139: “Promise”",
        "“Shouldn’t we get up soon?”",
        "Still lying on the bed together, I call out the fully conscious Charlotte-san.",
        "Although it feels like quite some time has passed since we both woke up, I had no idea how much time exactly.",
        "“I think it’s still okay…”",
        "Even now, she’s snuggled up to me, her face pressed against my chest.",
        "Despite being fully conscious and embarrassed earlier, she hasn’t changed her clingy behavior.",
        "That aspect of her was so cute that it couldn’t be helped.",
        "By the way, we’ve had this exchange several times since she woke up.",
        "Each time, her reply was “not yet”, so it seems that she’s still not satisfied yet.",
        "“Well, since we’re here, let’s take our time.”",
        "I smile as I gently stroke Charlotte-san’s head.",
        "Until now, Emma-chan has often been around, so there hasn’t been much time for cuddling like this when waking up.",
        "That was only when Sophia-san was looking after Emma-chan.",
        "Even though we’ve started living with Sophia-san and the others, Emma-chan will probably have many opportunities to sleep with us, so I want to cherish this time alone together.",
        "“I want to stay like this forever…”",
        "“Ahaha, me too.”",
        "If I could always be lovey-dovey with Charlotte-san like this, how happy would I be?",
        "Reality will never allow it, but I know exactly how Charlotte-san feels.",
        "“I don’t want to be separated…”",
        "Surely her spoiled switch has been turned on.",
        "Charlotte-san, who had been snuggling up to me, hugged my body tightly.",
        "However, when I tried to hug her back―",
        "『You left Emma again…!』",
        "―The door opened with a bang, and the high-pitched voice of a young child echoed through the room.",
        "Needless to say, it was Emma-chan who came in.",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Afterword:",
        "It seems that sensei is stalling for so long. We had this same chapter ages ago T_T",
        "Also for some reason, this chapter was entitled Promise, but I don’t see making any promise here or the sort so that confused me but well I left it as is.",
        "Oh and btw, sensei has a new series to be released on April 25th, I’m not sure if I should TL it as well so if anyone’s still reading this, let me know in the comments. More info about it can be read here. Moreover, I have made a Facebook group for Light/Web novels, please join us here!",
        "Lastly, I’m turning 21 this year so I’m planning to have either a celebration, or go to a convention, or maybe even both depending on your support through my Ko-Fi button below. I greatly appreciate those who will help me! If you can’t donate, it’s fine if you just read it in our website without adblocks. Thank you very much for the support!"
    ]
}