{
    "id": "chapter-113",
    "title": "The Answers You Give From Now On Will Lead Directly To Your Future",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "Author’s Foreword:",
        "New Reality Romance:",
        "When I muttered, “I don’t have any childhood friends,” my female friend who I often hang out with started acting strange.",
        "Chapter 1: “I don’t have a childhood friend― No, that girl from my past, if only I didn’t transfer to a new school…”",
        "has been released!",
        "This time, it’s another Adolescence story(*´▽｀*)",
        "And it’s sweet and lovey-dovey.ヾ(≧▽≦)ノ",
        "I hope you will all read it!",
        "==============================CHAPTER STARTS HERE==============================",
        "“―We’ve arrived.”",
        "The door of the limousine opened by itself as we reached the front of the mansion, which was several dozen times the size of an average home.",
        "As we got out of the car, Arisa-san walked in front of us to lead us.",
        "When we opened the door of the large mansion, dozens of maids and butlers were lined up inside waiting for us.",
        "“Wow, it’s just like in anime…”",
        "Charlotte-san, who was standing next to me, got a glint in her eye when she saw the scene inside.",
        "She seemed to be talking to herself, so it was probably best not to mention it here.",
        "We walked in, and everyone bowed their heads.",
        "Even though we weren’t the owners of the house, we were greeted generously.",
        "“Arisa-san, please tell everyone to raise their heads.”",
        "“Why?”",
        "“Because it’s uncomfortable.”",
        "“Please be proud of yourself. You’re still a part of the Himeragi family, after all.”",
        "“I don’t have the same last name though.”",
        "“Who said anything about quibbling?”",
        "When I returned with a wry smile, Arisa-san moved her face closer to mine.",
        "Of course, the expression on her face was so cold that it seemed cold-hearted.",
        "I’m not a big fan of Arisa-san’s face, as if beautiful women are scary when they’re angry.",
        "“I’m sorry, it’s just that I find this kind of thing ostentatious…”",
        "“What are you talking about now…?”",
        "In response to my words, Arisa-san gave me a dumbfounded look.",
        "It’s true that this was always the scene when I visited this house, but that didn’t mean I could get used to it, since I only came here once in a while after all.",
        "Charlotte-san also seems to be a wealthy woman, but she’s getting nervous as if she’s never seen this scene before.",
        "Well, in her case, she seems to be very happy.",
        "“Where is Kanon-san now?”",
        "“In the Master’s room.”",
        "“Eh… Are you saying that we’re not only talking to Kanon-san, but also President Himeragi…?”",
        "“Precisely.”",
        "“…………”",
        "Wait, I haven’t heard of this arrangement before though…?",
        "It’s true that what is happening right now is mainly a problem between me and President Himeragi… but I didn’t think it would suddenly turn into a meeting.",
        "This might’ve been better if I hadn’t brought Charlotte-san along.",
        "“You’re the one who intervened between the Master and Ojou-sama in the first place, aren’t you?”",
        "“I see… Apparently, I made the wrong call at the wrong time…”",
        "“It would’ve been better than putting it off at a later time.”",
        "“…………”",
        "If it was just Kanon-san, there would have been no problem because we had made amends over the phone, but if President Himeragi was there, it would be an entirely different story.",
        "I wondered what he would say to me…",
        "Maybe I’ll be forced to deal with a lot of trouble.",
        "“You’ve come to settle your past, right? If so, then be prepared. The answers you give from now on will lead directly to your future.”",
        "Arisa-san stopped and turned around to look at me.",
        "Then, with a dignified expression, she looked me in the eyes with powerful eyes.",
        "“Go on, Ojou-sama and the others are waiting for you inside.”",
        "Arisa-san said, pointing her left hand towards the door right next to her.",
        "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~",
        "Author’s Afterword:",
        "Today, “Otonari Asobi” was released (*´▽｀*). [TLN: February 25th]",
        "I’m so happy to have already received so many wonderful feedback and purchase reports.ヾ(≧▽≦)ノ",
        "I look forward to your continued support on “Otonari Asobi”!",
        "There was a big revision and a lot of new material.",
        "If you haven’t bought it yet, I hope you’ll buy it and read it♪",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Afterword: I’ll leave it up to you guys if you want me to TL the series that sensei mentioned in his foreword.",
        "I’m already translating Otonari Asobi if you guys didn’t know, and it’s the Light Novel version of this series. He’s stating facts when he said that there have been revisions and new materials. From what I’ve seen in the illustrations, it further supports that claim."
    ]
}