{
    "id": "chapter-98",
    "title": "The Girlfriend Claiming What's Hers",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Akito’s POV**)",
        "“Yes, then Akito-kun and Kanojo-san, please stand in the middle!”",
        "When we got off at the next station, the representative girl instructed us where we should stand, holding up her smartphone.",
        "Apparently, she would take the first shot, and then take turns of being the photographer.",
        "And because we were trying to take pictures here, the people around us were interested and now paying attention to us.",
        "Some of them seemed to have noticed us, and then suddenly took out their phones in a panic.",
        "―No, yeah.",
        "Seriously, come on, Riku…!",
        "I complained in my mind to Riku, who was the reason why I was getting so much attention.",
        "Even though Riku helped me avoid the worst of it, I feel like I’m paying too much for it.",
        "The girls who were cheering me on were fine, but the guys who were jealous because of me are not fine.",
        "If I’m not too careful, I’m afraid I’ll be erased by them.",
        "Probably they don’t like the fact that I’m attached to a beautiful girl like Charlotte-san and that I’m surrounded by other girls.",
        "…Yeah, I’ll be extra careful on the streets at night starting today.",
        "“Akito-kun, please look at me!”",
        "When I was distracted by the eyes of the men around me, I was called by a girl holding a smartphone.",
        "It was amazing that she was able to keep a calm expression on her face in this surrounded situation.",
        "She must have a personality that isn’t afraid of anything.",
        "For now, I envied her nerve.",
        "I couldn’t help but chuckle at the sight of such an unconcerned girl in front of so many people.",
        "“Look, look, you’re smiling too much~! You’re next to your cute girlfriend! Please show me your happy smile!”",
        "“Please don’t do that!”",
        "I could feel the heat around me rise about five degrees due to the cameraman’s agitation, and I hurriedly tried to stop her.",
        "I seriously don’t want to attract any more attention down there.",
        "Charlotte-san’s face is already bright red as she clings to me.",
        "“Don’t be embarrassed now! I’ll take the picture then~!”",
        "The girl lightly shrugs off my words and cheerfully raises her right hand.",
        "She looks like she’s the same age as me, or maybe a little older, but she looks like a child.",
        "“What’s one plus one~?”",
        "And then she gives me the usual shout.",
        "I wish I didn’t have to answer this question in front of so many people.",
        "But if I don’t answer, I’ll become a person who can’t read the atmosphere.",
        "So I had no choice but to try to answer―",
        "“―I’m sorry, Akito-kun.”",
        "I heard Charlotte-san’s small voice apologizing for something.",
        "And then―",
        "“―*Chuu.”",
        "As soon as I heard the shutter sound, Charlotte-san’s lips touched my cheek.",
        "On that moment―",
        "“””””Kyaaaaa~!”””””",
        "The station was filled with yellow cheers― or rather, loud cheers  from all directions. [TLN: Yellow cheers is the term for enthusiastic female fans who utter at the sight of a famous actor or the performance of their favourite band.]",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Editor’s Comment: dnsjabdubtjeieggswidjdnskajsbjcsjbtjdjajawj HAHAHAHAHA man."
    ]
}