{
    "id": "chapter-132",
    "title": "Happiness and Misery are Balanced",
    "content": [
        "Translator: AJ1703",
        "(**Akihito’s POV**)",
        "“Tsuri, tsuri~…” (TLN: Rubbing literally.)",
        "When we were alone in the bedroom, Charlotte-san rubbed her cheek against my chest like a cat.",
        "I know she is happy to be alone with me, but she has lost all reserve.",
        "I don’t mind, though, because she’s cute.",
        "“Charlotte-san, you’re tickling me.”",
        "“Because I missed you while we were apart…”",
        "She says this sulkily, but I’ve only been away for half a day.",
        "I’d rather know what she was doing in the next room while I was gone.",
        "I wonder if Sophia-san will tell me if I ask her later.",
        "“From now on, we will have a lot more time together.”",
        "“We’ll be in the same room, right?”",
        "Thanks to Kanon-san’s arrangement, Charlotte-san and I had a larger room to ourselves.",
        "The bed was a king-size, which is not something I am familiar with, and there was plenty of room for Emma-chan to sleep in the room with us as well.",
        "It was really a perfect place for us.",
        "As for Emma-chan, she will be sharing a room with Sophia-san, but I’m sure she will come to our room to play with us.",
        "“I can’t wait to move in.”",
        "“We’re getting close.”",
        "I mean, if I can get my stuff ready for the move, all I have to do is to take it with me.",
        "Charlotte-san should know that, but what she is saying and what she is doing are opposite.",
        "If she’d just let me go, I’m sure the packing would be done in no time…",
        "“I’ve been scared lately.”",
        "“Eh, about what?”",
        "“I’m too happy and… a lot of great things are happening to me, so I’m afraid the repercussions will come one day…”",
        "It is said that happiness and misery are balanced.",
        "So I guess she’s afraid of the repercussions of being too happy now.",
        "But then you can reverse your thinking.",
        "“Don’t worry, I’ve already paid for my misfortune long ago, and happiness is just around the corner. At least I had a hard time until I met Charlotte-san, and I think I was rewarded by meeting you.”",
        "I believe that all the misfortunes I have had were for the sake of meeting Charlotte-san.",
        "It seems that even Charlotte-san has had a hard time, and I think it’s good to know that she will find happiness in the future.",
        "“I think so… and I don’t need anything else as long as Akihito-kun is by my side.”",
        "“It’s the same for me, as long as Charlotte-san is by my side, that’s all I need.”",
        "No matter what misfortunes or hardships I may face, as long as I have Charlotte-san by my side, I will get over it.",
        "At least, there is nothing to be afraid of.",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Author’s Afterword:",
        "Thank you for reading ♪",
        "Please be sure to check out my new romantic comedy",
        "“The Case of the Innocent School Idol Who Is My Cousin That Lives With Me”",
        "I’m looking forward to your support (#^^#)",
        "========================================================================",
        "Translator’s Afterword: So I did 2 chapters today because I’m going to Cosmatsuri Day 3. If you want to meet me there, ping me in our discord server. It goes without saying, since I did two today, it’s most likely I wouldn’t be able to release one tomorrow, but who knows I might actually be able to go home early and squeeze in one more?",
        "Anyway, on the author’s afterword, apparently it’s already a finished series with 29 chapters only. Let me know if you guys want me to TL it in the comments or in the server as well.",
        "Also, I need some money for my medication and supplements, if anyone could help me out a bit, it’d be much appreciated!"
    ]
}