{
    "id": "chapter-108",
    "title": "Nostalgic Voice",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Akito’s POV**)",
        "“You see… I exchanged contact information with her.”",
        "“I see.”",
        "I understood why Charlotte-san had been so reluctant to tell me.",
        "I was wondering if I could get in touch with her somehow, and she didn’t want to tell me that she just found out that there was a way to do so.",
        "But this situation was just something I had also overlooked.",
        "I should’ve assumed that Kanon-san and the others would have exchanged contact information with Charlotte-san when they contacted her.",
        "“Um, I’m sorry… for forgetting to tell you such an important thing.”",
        "“It’s okay, don’t worry about it. More importantly, thank you for telling me, I’ll try contacting her now.”",
        "As expected, when Charlotte-san contacted her, she wouldn’t ignore it.",
        "She’s a person who is strict with herself and kind to others.",
        "She values courtesy above all else, so unless she’s in a situation where she can’t keep her hands to herself, she’ll pick up the phone.",
        "“Charlotte-san, I’m sorry to bother you, but could you please call her instead? I’m afraid there’s a problem while contacting her on my phone.”",
        "“Okay. One moment, please.”",
        "That’s all Charlotte-san said and began to navigate her phone.",
        "She nodded easily, but I could tell from her expression that she was nervous.",
        "It was understandable.",
        "She had just met her today, and I was entrusting her with the opening for an important conversation.",
        "Not long after that, Charlotte-san’s phone connected to the other end.",
        "“―Here, I’ll let you take over it now.”",
        "Charlotte-san nervously handed me her phone.",
        "“Hello?”",
        "《Yes, hello.》",
        "What I heard over the phone was a beautiful, mature voice that hadn’t changed much then.",
        "I felt nostalgic, but at the same time, I felt my chest tighten.",
        "“It’s been a while, Kanon-san.”",
        "《You’re still acting like a stranger. You can call me Onee-chan, you know?》",
        "Are you kidding me…?",
        "You know what I’m calling you for, don’t you?",
        "I had my doubts when I heard her voice over the phone.",
        "However, if I remembered well, she might have been like this ever since.",
        "She was always insisting on calling her “Onee-chan”.",
        "“I’m sorry, I’m afraid I can’t do that.”",
        "《I see… Then why did you call me?》",
        "“Well… before I get to the point, may I have a moment?”",
        "《No problem, I’ve already saved some time.》",
        "I’m going to take my time― After all, she already figured out that I’m going to call her.",
        "But why did she do it in such a roundabout way…?"
    ]
}