{
    "id": "chapter-37",
    "title": "I Want You to Pay Attention to Me Too",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Charlotte’s POV**)",
        "―Aoyagi-kun’s smile is wonderful…",
        "As I looked at Aoyagi-kun’s face while he was eating the food I had prepared, I was thinking about such things alone.",
        "Aoyagi-kun was feeding Emma, who was now sitting on his lap, while slowly eating himself.",
        "As Emma sipped her food and smiled happily, Aoyagi-kun would look at her with a very gentle smile.",
        "I thought it was very nice to see Aoyagi-kun’s smile.",
        "He is smart, has a gentle personality, and is very dependable in times of trouble.",
        "Isn’t he just like a picture of my ideal man?",
        "I have to thank Kami-sama that I was able to meet such a wonderful man.",
        "―I have been thinking about such things, but there is something that is troubling me a lot right now.",
        "In fact… ever since yesterday, when he protected me from our upperclassmen, I haven’t been able to make eye contact with Aoyagi-kun properly…",
        "When our eyes meet, my heart beats abnormally fast and my whole body becomes hot.",
        "And then I get incredibly embarrassed and find myself turning away from him.",
        "That’s not all.",
        "There are so many more things I want to talk to Aoyagi-kun about, but when I stand in front of him, I get so nervous that I can’t speak.",
        "To tell you the truth, I am so embarrassed to go in front of Aoyagi-kun that I hesitate to do so.",
        "However, even though I should feel that way, I instantly feel lonely when I am away from him.",
        "I can’t wait to see his face― I was so driven by this desire that I barged into his room this morning.",
        "What on earth am I doing with a boy I’ve only known for a few days…?",
        "I’ve never felt this way before, so I’ve been at a loss for words.",
        "I hope Aoyagi-kun doesn’t think I’m weird…",
        "I was curious about what he thought of me, so I glanced at Aoyagi-kun’s face.",
        "But Aoyagi-kun doesn’t seem to care about me. He smiles happily and strokes Emma’s head gently.",
        "…..I wish he’d give me a little more attention.",
        "I couldn’t help but think of those words.",
        "Aoyagi-kun always pampers Emma.",
        "No, it’s true that Emma is cute.",
        "It’s no exaggeration to say that she is the cutest little sister in the world, she is very cute.",
        "That’s why I can understand why Aoyagi-kun loves Emma so much, you know?",
        "Above all, I myself wanted him to be like that towards her…",
        "Emma has never known the warmth of her father.",
        "Because of this, I think that Emma thinks of Aoyagi-kun as a substitute for her father in some ways.",
        "Aoyagi-kun is young, so she calls him “Onii-chan,” but the way Emma is being spoiled by him is like a child being spoiled by her father.",
        "I am very happy that the two of them are getting along so well.",
        "However― Aoyagi-kun.",
        "I want you to pay attention to me too…",
        "I puffed up my cheeks as I looked at the smile on Aoyagi-kun’s face, who only cared about Emma."
    ]
}