{
    "id": "chapter-76",
    "title": "The Angelic Onee-san",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "“You’re such a crybaby, aren’t you?”",
        "When I heard the voice, I looked up and saw a woman with a gentle smile looking down at me in a blank space.",
        "The woman’s silver hair, dainty appearance, and the mysterious atmosphere she wore made me open my mouth.",
        "“Tenshi-san…?” [TLN: Tenshi is Angel btw]",
        "“My, my, you’ve got a way with words for such a young boy, don’t you?”",
        "When she heard my words, she looked surprised for a moment― But then she smiled very gently and in a cute and friendly way.",
        "I thought she was really an angel in my mind at that time.",
        "“What are you, six years old? It’s getting late now and it’s not safe for you to be alone.”",
        "She didn’t ask what happened to me when I was crying.",
        "She sat beside me on the bench with her knees in her arms and gently patted me on the head, warning me for being alone.",
        "“I don’t want to go home…”",
        "“Don’t you like your house?”",
        "“I hate everyone…”",
        "“Why do you say that?”",
        "“…………”",
        "“Well, if you don’t want to say it, don’t say it.”",
        "She didn’t ask me any more questions and continued to pat my head gently until the people from the facility came to pick me up.",
        "I’m sure that the arrival of the orphanage staff made her realize that I was a child of the orphanage.",
        "She has visited me every day since that day.",
        "She didn’t ask me any questions, but kept gently patting my head until I fell asleep.",
        "I later heard from someone at the facility that she had arranged for me to be delivered to the facility so that she could do whatever she wanted with me.",
        "Normally, such a proposal would not have gone through because of safety concerns, but I guess Onee-san was someone the facility trusted.",
        "I didn’t know why she was so willing to do this, but I think it was the first time I felt someone’s warmth.",
        "The people at the facility were kind to me, but I didn’t like the way they looked at me with pity, as if they were looking at something pathetic.",
        "Most importantly, when I beat back the people who had been bullying me and made them cry, they just apologized to the parents who yelled at me and didn’t protect me.",
        "In fact, they didn’t believe me and even took the other side, saying it was my fault.",
        "From then on, I was not allowed to fight back, I was just beaten.",
        "I didn’t have any adults around me that I could trust anymore, and they all seemed like enemies to me.",
        "It was around that time that I met Onee-san.",
        "After a week or so, she had become someone I could trust.",
        "I could feel her warmth as she gently stroked my head without asking me any questions and was always there for me.",
        "I think that’s why I told Onee-san everything about my situation.",
        "She listened to me without saying a word and then showed me the way.",
        "She told me that I had to become a person who could compete with anyone in studies and sports.",
        "I thought she was telling me something absurd, but she didn’t just say it, she accompanied me in my studies and sports.",
        "I think that’s why I was able to do my best.",
        "―But that relationship didn’t last forever.",
        "About a year later, the day came when Onee-san had to leave Japan.",
        "“You’re going away, Onee-chan.”",
        "I don’t know with what expression I said these words.",
        "However, when she heard my words, she had a very painful expression on her face.",
        "When I saw the expression on her face, I understood that what I said was wrong, and although I was a little boy, I hurriedly tried to cover it up.",
        "Then she smiled kindly at me and reached out her hand to my head.",
        "“I’ll come back to Japan again. And when I do, I’ll bring my family with me, so we can live together this time.”",
        "“Really?”",
        "“Yes, so Akito, no matter what someone does to you, don’t lose. Do your best and be a nice boy. Promise?”",
        "Then I cut my fingers with Onee-san and we parted ways.",
        "I didn’t believe in other adults, but I knew that Onee-san would keep her promise.",
        "―Although, I really knew that it was impossible.",
        "In the end, Onee-san never appeared in front of me again.",
        "After all, it was probably just words to comfort a young child.",
        "I don’t really resent Onee-san.",
        "I’m grateful to her for staying by my side all these years, so it’s not right to hold a grudge against her.",
        "So even to this day, she is the woman of my dreams.",
        "……….However―After all, l, from birth to middle school, my life has been a series of betrayals.",
        "◆",
        "“―-kun, Aoyagi-kun, please wake up, Aoyagi-kun.”",
        "Someone gently shook my body, and I slowly woke up.",
        "When I opened my eyes, I couldn’t help but smile at the sight of a familiar face.",
        "I felt relieved.",
        "I knew Onee-san was different from other adults.",
        "“Onee-san, I’ve been waiting for you for a long time…”",
        "“Eh!?”",
        "But when she heard my words, she had a very surprised look on her face.",
        "Then, after looking left and right as if confused, she opened her mouth with a troubled smile.",
        "“Aoyagi-kun, you’re still sleepy… right?”",
        "“Eh…? Ah… Charlotte-san…”",
        "As my consciousness becomes clearer and clearer, I recognize who the woman in front of me is.",
        "It seems that the woman I initially thought was Onee-san was actually Charlotte-san.",
        "“Sorry, I must have fallen asleep some time ago…”",
        "It seems that I fell asleep after Charlotte-san went home to take a shower.",
        "I guess that’s why I was so sleepy.",
        "In front of me, Charlotte-san gave a very gentle smile.",
        "“No, no, it’s okay. I just woke you up because it’s bad for your health if you don’t sleep on the futon.”",
        "“That’s true, thank you…”",
        "I thanked Charlotte-san, still in a slightly foggy state of consciousness.",
        "As expected, I’ve just woken up and it’s going to take me a while to fully wake up.",
        "But no matter how much they resemble each other, it would be rude for either of them to mistake Charlotte-san for Onee-san.",
        "It was the first day of our relationship, and it would be wrong to bring up other women, even though they were quite a few years apart.",
        "Charlotte-san didn’t seem to mind, but if I kept doing this, she might get disillusioned.",
        "“Would you like to sleep in your futon?”",
        "“No, I haven’t showered yet and I’m sure we need to talk, right?”",
        "Before leaving to take a shower, Charlotte-san said that she wanted to talk about the future when she came back.",
        "That’s why I brought up the subject, but for some reason Charlotte-san immediately started to get embarrassed.",
        "“Well, that’s true… but, it doesn’t have to be today, so…”",
        "Charlotte-san fidgeted with her fingertips together.",
        "Her face was flushed red, and just looking at her made me very happy.",
        "“I’ll be fine. Besides, if we put it off until tomorrow, we might not have time to talk alone again.”",
        "I said to Charlotte-san and looked down into my arms.",
        "Then there was Emma-chan, clinging to me as if she were asleep.",
        "She seemed to be tired of crying and didn’t seem to wake up even though we were talking.",
        "She was very violent until she fell asleep, and I guess she won’t wake up again today.",
        "“I’m the worst sister, aren’t I…?”",
        "Seeing Emma-chan’s condition, Charlotte-san’s expression becomes cloudy.",
        "There is a connection between her making this expression and the fact that Emma-chan has cried to the point of exhaustion.",
        "That’s what happened when we got back from our date."
    ]
}