{
    "id": "chapter-133",
    "title": "New House",
    "content": [
        "Translator: AJ1703",
        "(**Akihito’s POV**)",
        "“―Is this our new home…?”",
        "The new house was not far from where we lived before.",
        "Or rather, it’s within walking distance.",
        "The house is much larger than I had expected.",
        "It is a two-story building, but it is 1.5 times wider than I had expected.",
        "“The rooms are huge, too. Let’s go to Akihito and Charlotte-san’s room first.”",
        "Kanon-san guides us with a smile.",
        "Since she and the others have already been here, I guess she will show me and Charlotte-san’s room first.",
        "Once inside, the entrance and hallway were the same size as a normal house.",
        "The rooms seemed to be larger than the rest of the house.",
        "“Wow, it’s so huge…”",
        "The room was more than spacious enough, despite the large bed, which was called a king size.",
        "Even with the chest of drawers, desk, sofa, and other furniture in there, there was still plenty of space.",
        "“You can flirt wherever you want here, you know?”",
        "“I don’t think space has anything to do with it…”",
        "Kanon-san smiles at me and I reply with a troubled laugh.",
        "Charlotte-san, however, saw it differently than I did, her face turning bright red and holding both cheeks in her hands, she began to wriggle in agony.",
        "I wonder what came to her…?",
        "“You’ve been buying a lot of adult doujinshi from specialty retailers, and you have a very fertile imagination…”",
        "“Well, isn’t that good? It’s better if one of them knows something than if neither of them knows about it.”",
        "Sophia-san let out a sigh as she looked at Charlotte-san, but Kanon-san followed her up by laughing happily.",
        "What on earth are they talking about? [TLN: MC is literally Clueless lmao]",
        "“I knew she was originally influenced by Japanese culture and loved manga and anime, but when did she start getting into that kind of stuff?”",
        "“I understand your concern as a parent, but don’t worry. Akihito is the partner anyway.”",
        "Yeah, what on earth are they really talking about?",
        "The actuality that Kanon-san has been giving me a genuine warm look is very worrisome.",
        "“―You do realize what would happen if you make an indecent appearance in front of the young lady, don’t you?”",
        "And then Arisa-san came around behind me and put something cold on my neck.",
        "I don’t think I’ve done anything wrong at all in the meantime though…",
        "New life in a new house from now on.",
        "I’m sure it will be fun, but I’m starting to feel anxious about it as well.",
        "I wonder if I will be able to get along with these people…?"
    ]
}