{
    "id": "chapter-96",
    "title": "Man of the Hour",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Akito’s POV**)",
        "“I thought you were convinced…”",
        "“No, I was convinced, but if we’re going to use Akira, it’s only natural that we’d want you to come back because you can make the most of him…!”",
        "Well, that may be true, but…",
        "We have our own problems to take care of, and I don’t want to be separated from Charlotte-san.",
        "So I just can’t accept Riku’s invitation.",
        "“It’s okay, I told you, your teammates are strong. As long as you have a passer who can match Akira, there’s no problem. Besides, he’s not the same guy he was in middle school. I’m sure he’s already figured out how to live with himself as a representative.”",
        "“.. Yeah, that’s probably true. Yeah, okay, I’ll think twice about what I’m going to do with them again. I want to rely on you, but I can’t seem to get you to shake your head.”",
        "Riku shrugged his shoulders as he said this.",
        "He felt like he had no choice because I wouldn’t change my mind even if he talked more.",
        "“If you’re convinced, that’s fine.”",
        "I know Riku’s point of view well enough, so I wasn’t going to say anything else now that he had retreated.",
        "When the conversation was over, a moment of silence passed between us, and then Riku opened his mouth as if he remembered something.",
        "“Oh, by the way, on a different note, are you getting into trouble again?”",
        "“Eh, why…?”",
        "“You said earlier that with the situation you’re in right now, you were grateful for a future connection. If you say that, it means you have something that threatens your future, right? And isn’t that something that concerns her, given your position?”",
        "“―!”",
        "I was honestly surprised to see…",
        "I’ve always thought he had good instincts, but I didn’t think he’d be able to see through my gaffe to the fact that it even involved Charlotte-san.",
        "“I’m not sure if he’s objecting to me going out with her now, after the way I treated you.",
        "But he couldn’t see that I was in a position where I had to break up with her because of my marriage.",
        "“It’s a little different… But they are similar.”",
        "“I see… So you’re choosing to stay with her now, no matter the difficulties that lie ahead, instead of a brighter future that awaits you in exchange for some time away from her? Do you believe that will open up your future?”",
        "Riku looked at me as if he was testing me.",
        "I probably don’t need to think about which is the wisest choice.",
        "But still, I can’t choose to leave Charlotte-san.",
        "And it’s not that I don’t have any hope for the future.",
        "“I believe in it. At least I’m going to work to keep our future from being sabotaged.”",
        "“I see… Yes, you are that kind of man after all.”",
        "When Riku heard my answer, he gave a gentle smile.",
        "He then patted himself on the chest.",
        "“If that’s the case, you can always count on me. I’ve been invited to a lot of TV shows lately, and I’ve gotten a lot of invitations, so I know a lot of people I can count on.”",
        "It’s true that Riku is now a sought-after celebrity on TV.",
        "I’m sure he gets along well with the celebrities he meets on TV shows.",
        "Riku has a strange attitude towards me, but in fact, his communication skills are quite high.",
        "And because he’s as handsome as an idol, he’s extremely good at winning girls over.",
        "He’s probably getting along with people I’ll never get to know.",
        "However, no matter how much Riku asks, those people will change sides depending on who they are with.",
        "“But if they knew who they’ll be dealing with, they might…”",
        "“No, there are a few people who might still be willing to lend a hand. But it’s not absolute. So I’m going to make one more suggestion.”",
        "Riku seemed to have anticipated my reply and immediately made a different proposal as insurance.",
        "I was more interested in that one and immediately took the bait.",
        "“What’s that?”",
        "“If you want, I can use my connections to get you a job in the soccer field, even if you’re not a professional. You’ve got a good head on your shoulders and I’m sure the other side would appreciate it.”",
        "This is probably not just an introduction.",
        "That would be the end of me if I got interference.",
        "So this is an attempt to introduce me to a place that will give priority to Riku, even if that person who binds me interferes.",
        "“I turned down your offer and you’re going to go that far…?”",
        "“If you’re in trouble, I can’t overlook it. You’re the one who saved my life after all. If it weren’t for you, I wouldn’t be where I am today. Besides, I don’t want someone else to ruin the path I’ve chosen, even though you’ve made me your sleeve. In addition, I don’t want to let the man who drove you out of the soccer world do what he wants.”",
        "Riku smiled fearlessly as he said this.",
        "I’m sure he’s referring to the time when I hit a wall a few times when I was a member of the national team.",
        "I was just giving advice, and it was Riku himself who gave the answer, so you don’t have to worry about it.",
        "He’s still a weirdly serious guy.",
        "And the fact that he’s trying to fight with the head of one of the biggest conglomerates in Japan is amazing.",
        "This kind of determination may be the reason why he was able to make it to the Olympic team at the age of 16.",
        "“You’re a little more belligerent than I thought.”",
        "“Yeah, I guess so. Well, knowing your past, I think you should be happy. You deserve to be happy.”",
        "Perhaps because he knew that I came from an orphanage and the reason why I quit soccer, Riku smiled gently at me.",
        "I think he is honestly a good guy in this way.",
        "And the fact that he reached out to me was something that I really appreciated right now.",
        "“Thank you, Riku.”",
        "I thanked Riku from the bottom of my heart for giving me his hand even though I refused.",
        "I think it was a good thing that I was able to talk to Riku today, even though we had a lot of arguments.",
        "I was able to take another step forward and open a new path.",
        "I can say with certainty that I will never choose to part ways with Charlotte-san again.",
        "“Yeah, well then, I’ll be taking my leave here. I think she’s reaching her limit.”",
        "Riku’s gaze, as he said goodbye, somehow turned in a completely different direction from mine.",
        "As if caught by his eyes, I looked that way and saw a beautiful girl with silver hair standing there, staring at us.",
        "…Eh? Wait a minute.",
        "Until what part did she hear about…?",
        "“Ri-Riku, how long has she been there…?”",
        "“When I grabbed you by the shoulders, she was already hiding and looking at me, I think?”",
        "Riku replied to my question curiously, tilting his head.",
        "I grabbed both of Riku’s shoulders as hard as I could.",
        "“Why didn’t you tell me!?”",
        "“No, I thought you were aware of it too… I was wondering how you could be so complacent in the presence of the actual person, but you didn’t notice that the girl was there?”",
        "“If I had, I wouldn’t have said that, okay!?”",
        "How could I have said something like that when Charlotte was there!?",
        "That would be too embarrassing…!",
        "F-For the time being, I’ll try something…",
        "“Eh, uh, sorry Charlotte-san, I didn’t mean to keep you waiting.”",
        "I took my hand away from Riku and smiled at Charlotte-san.",
        "Then she came up to me with a small run.",
        "As soon as she was right in front of me, she pressed her face against my chest.",
        "“Oh my, how daring.”",
        "That’s what Riku said when he saw Charlotte-san jump into my chest, but I couldn’t care less.",
        "My heart is beating fast and noisily.",
        "“Cha-Charlotte-san…?”",
        "“…………”",
        "When I called out her name, Charlotte-san looked up at me with moist eyes.",
        "From the looks of it, it was clear that she had heard our conversation.",
        "I took a deep breath to calm myself down and opened my mouth, trying to keep my voice as gentle as possible.",
        "“Sorry, I didn’t mean to make you worried. But don’t worry, everything’s fine now.”",
        "As I said this, I gently stroked her head to help calm her down.",
        "It still made me nervous to touch her, but I knew exactly what I had to do.",
        "So I can bear it even if I feel embarrassed.",
        "Besides, I simply love to pet her head.",
        "After all, Charlotte-san looks even more adorable when I stroke her head, and it feels so good to stroke her fluffy hair.",
        "As I continued to gently stroke her head, Charlotte-san’s cheeks relaxed and she rested her face against my chest again, as if this action was good for her.",
        "Just the fact that she showed me such a cute expression and attitude made me feel incredibly happy.",
        "However―",
        "“Kuh-, you’re a brave man, aren’t you? Patting her head in front of all these people.”",
        "“Eh…?”",
        "At Riku’s words, my blood instantly drained from my veins.",
        "I looked away from Charlotte-san and raised my gaze even higher than when I found her.",
        "I was surprised to see a scene that made me break out in a cold sweat.",
        "The reason being―",
        "“This time, the flirting started! Akito-kun loves his girlfriend after all!”",
        "“You can stroke her head without worrying about the people around you, you’re not the kind of guy that Riku-kun would approve of!”",
        "“Wow, look at this! I just posted a video on social media and it’s already been shared by 10,000 people. I’ve never had a video go viral like this before!”",
        "“The one with Riku-kun’s sad expression and the one with Akito-kun’s embarrassment and shyness were both extremely well received.　There are a lot of comments about Akito-kun saying that riajuus should just explode, but people are really taking advantage of it!",
        "―There were so many girls surrounding us.",
        "Many of them were not old enough to be called girls, but that was not the problem.",
        "What mattered was that many of them were still pointing their phones at us.",
        "“Ri-Riku… how long has this been going on…?”",
        "“A little while after I took off my hat, I guess.”",
        "Riku put his index finger to his mouth with no malicious expression, and tilted his head as if in a daze, and replied.",
        "“You’re sure of it!?”",
        "Riku, who obviously knew what he was doing, gave me a nudge.",
        "I thought it was strange that he took off his hat, but I didn’t realize that this was his goal…!",
        "“I’m sorry for that. It was my intention to make a big deal out of this so that you would be noticed when you returned.”",
        "“You’ve been planning my return all along!? Even so, this is just harassment, isn’t it!?”",
        "Because of Riku, I’m now a public figure on social media.",
        "I remembered the conversations I had with Riku, and they were all very embarrassing and made my stomach hurt.",
        "Then, when I fearfully went to look at the social networking site, I found a lot of messages from my classmates on the chat app.",
        "It seems that it was too late in many ways.",
        "First of all, without a doubt, my classmates had already found out about my relationship with Charlotte-san."
    ]
}