{
    "id": "chapter-95",
    "title": "The Two People Who Don't Mesh With One Another",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Akito’s POV**) [TLN: From now on, I’ll use his first name too like Charlotte’s]",
        "“Thank you, Riku….”",
        "I thanked Riku, feeling a little sorry for him for being so understanding, even though I knew he had a lot to say on his mind.",
        "“It’s okay, you’re looking forward to it. It was worth the effort to come along just to see that.",
        "Riku said this with a slightly sad smile and seemed to be convinced.",
        "To such Riku, I said―",
        "“Well, I still won’t forgive you for that.”",
        "I told him what I was thinking honestly.",
        "“What the heck!? That’s the part you’re supposed to let bygones be bygones.”",
        "“No, you’re supposed to put yourself in the shoes of the person who interrupted your date.”",
        "I’m here on a date, and I can’t stand to be interrupted by someone else.",
        "I’m not sure how many minutes I’ve wasted thanks to this.",
        "…That reminds me, Charlotte-san is sure taking quite a while…",
        "Well, I suppose I shouldn’t say anything too outrageous, but I think it’s time for her to come back…",
        "Feeling uncomfortable with the fact that Charlotte-san has not returned for a long time, I tried to check the surroundings.",
        "I’m not sure what to do.",
        "“Ugh… Well, I’m really glad to know that you’re on the right track now… It’s just that I really don’t know what we’re going to do now…”",
        "I couldn’t ignore Riku, who seemed to have been put off by my words, because he suddenly began to speak weakly, as if to change the subject.",
        "Good grief… This guy is really as good as he looks. He is very sensitive despite his achievements and the people around him.",
        "I remember that I used to follow him when he was being negative.",
        "“Don’t worry, Riku. You guys can win without me.”",
        "“Fufu, you’re being very irresponsible…”",
        "It seems that Riku really meant what he said earlier about not being able to win, and from the looks of it, he’s been thinking about it a lot.",
        "So I postured my back fist on Riku’s chest.",
        "“You’ve got too much on your plate.”",
        "“Akito…?”",
        "Riku looked at me curiously.",
        "As expected, he couldn’t understand what I was trying to say.",
        "“I’m sure you’ve been selected for the Olympics, so you’re probably a head or two above the rest of us. But it doesn’t mean you have to do everything by yourself. You need to rely on your teammates more than ever. Those guys who played soccer with you and me are strong enough. That’s how I was able to keep passing the ball to you guys without hesitation. You’ve forgotten the most important thing, to trust and rely on your teammates.”",
        "I’m glad that Riku is trying to convince me, but what he said earlier was disrespectful to the current top players of their team.",
        "The fact that he said that unconsciously indicates that he doesn’t trust the people around him.",
        "He probably thinks he has to do something about it because he’s the only one who jumped out.",
        "Well, I don’t watch all of their games, either.",
        "When I’m on my own, if there’s a soccer game on TV, I immediately change the channel and don’t even try to watch it myself.",
        "However, when Charlotte-san and the others are around, they would question me if I change the channel as soon as soccer is on, and sometimes I can’t change the channel because Emma-chan is happy to watch soccer.",
        "That’s why I knew what they were playing.",
        "When Riku was playing with the Olympics team, he played more alone than when he was playing with the other members of the national team.",
        "And the other guys were eventually gathering the ball to Riku.",
        "I don’t think those guys with their habits would willingly do that, so it was probably the coach’s order.",
        "But it is natural that if the ball is collected by the person who is marked the most, the point will not be scored.",
        "“But if I, the ace striker, don’t get the points…”",
        "“I just said that’s being pessimistic. You can be an ace striker or a once-in-a-decade genius, but you are still a human being. There will definitely be times when you’re underperforming, and the world won’t be so naive as to let you break through when you’re being intensively marked.”",
        "“Then what should I do? You’re not on the national team anymore.”",
        "“Why do you only rely on me? I told you before, you need to rely on the people around you. Especially Akira. Akira is the one you need the most right now, not to mention the Japanese national team.”",
        "“What do you mean…?”",
        "Riku tilted his head in confusion at my words.",
        "You’ve been playing together for a long time now, so why don’t you understand what I’m talking about…?",
        "Well, it may be an overstatement to say that Akira is the most necessary player on the team, but he is definitely an indispensable part of Riku.",
        "“If you get marked, it creates a gap in their defense. Akira will never overlook that gap.”",
        "“So, you want Akira to score points instead of me?”",
        "Riku asked me with some frustration.",
        "Of course, if you are a striker, you want to score yourself.",
        "In fact, a striker who is willing to hand over the scoring to someone else is not suited to be a striker.",
        "Strikers need to be egoists, you know.",
        "In this regard, Riku is probably the most suitable ace striker.",
        "But I dare to give a different answer here.",
        "“That’s right. Then he will become your equal. No, on the contrary, the opponent will be more afraid of Akira, who unexpectedly pops up and creates a decisive chance.”",
        "“You’ve always been like that, haven’t you? You think more highly of Akira than I do.”",
        "When Riku heard my words, he smiled sadly rather than sulk.",
        "Come to think of it, Riku has always had something of a rivalry with Akira.",
        "I didn’t say anything back then because it’s good for strikers to compete with each other, but I’m unwilling to be taken this way now.",
        "“Don’t get me wrong. It’s true that I think Akira is a great guy and an essential part of the team. But it’s the same with you. You have a sense of dribbling and shooting that is on par with the top professionals, and your consistency is very strong. You and Akira are completely different types of players, but I think highly of both of you as well.”",
        "Akira has a broad, bird’s eye view and good instincts to sense decisive opportunities.",
        "In addition, he has the ability to surprise even his own teammates with his unpredictable moves, and his legs are as fast as a short-distance runner.",
        "Riku, on the other hand, has been dribbling and shooting so well since middle school that it’s hard to believe he’s the same age as me, and he has a very strong core despite his average height.",
        "In addition, he has a high level of balance that allows him to kick the ball into the goal frame without any problem even if he is slightly off balance.",
        "As far as I know, there is no one in my generation who can score goals by himself on par with Riku.",
        "To be honest, both of them are top-notch strikers.",
        "The only thing is that Akira was a better match for me in terms of soccer style.",
        "Riku was still holding on to that.",
        "“I-I’m embarrassed to be praised so much by you…”",
        "“Don’t be shy because of that… Isn’t this a serious matter?”",
        "“Sorry…”",
        "I was taken aback by Riku’s fidgeting and chilly movements, even though he was a man.",
        "What pisses me off a little is the fact that when Riku does it, it looks like he’s a girl who’s embarrassed by a compliment, even though he is a man.",
        "This is why beautiful, handsome men are…",
        "“Back to the topic at hand, even if you are a first-class striker, you can’t score against the world by yourself. So, use Akira to be feared by your opponents. He is the best decoy when the opponent recognizes his ability. In other words, the more Akira moves, the easier it is for you to attack. We used to score points with that style of play, didn’t we?”",
        "In the beginning, Riku was alerted, I passed into the hole created by that opportunity, and Akira jumped out to strike a score.",
        "After that, the Defensemen started to pay too much attention to Akira’s movements, and other players scored in the holes created by the distractions.",
        "It was Riku who had scored the most goals in the game.",
        "He’s been doing this for a long time― but perhaps because Akira left once, he couldn’t make it work again when he came back.",
        "“That’s right… But can I ask you something?”",
        "Riku, who seemed to be convinced by my words, smiled a little weakly and said he had one thing to say to me.",
        "“What’s wrong?”",
        "“You make a good point. Sure, we’ve won in the past. It’s just― you should come back to us…!”",
        "As if he couldn’t stand it any longer, Riku held his forehead with his hand and made a distressed sound.",
        "No, yeah.",
        "I already told you that’s not possible.",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Comments: 5 chapters only for today, I kinda slept at 4am and woke up late again kekw. Also chapter 93 was quite long, you know?",
        "Also help Matsu reach his Ko-Fi goal by clicking the button below guys! He’s been a great help to me in making the chapters a bit better I suppose (although I have to admit, we do miss some of them from time to time so I apologize about that)."
    ]
}