{
    "id": "chapter-99",
    "title": "Checkmate",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Akito’s POV**)",
        "“Wha, wha-wha-wha!?”",
        "She kissed me on the cheek, and I looked at Charlotte-san’s face while holding the area she kissed with my hand.",
        "But she wasn’t looking at me anymore.",
        "“You are welcome to spread it around as you wish.”",
        "She smiled as she looked at the girls taking the photo with her and the surrounding audience, encouraging them to spread the photo.",
        "This made the tension around us rise even higher, and most of them were tapping away on their phones.",
        "The tension seemed to be spreading at an incredible rate, as if an idol had given her permission.",
        "No matter how you look at it, this is an act that pours an oil on the fire…!",
        "I didn’t know what she was thinking, much less kissing me in front of all these people.",
        "“Charlotte-san…”",
        "I called Charlotte-san’s name, feeling my heart beating fast and furiously.",
        "Then she slowly looked up at me.",
        "Her face was bright red with shame, and her eyes were unfocused, as if they were spinning in circles.",
        "When I saw this face, I guessed what Charlotte-san was thinking inside.",
        "“That… made me really happy, but you didn’t have to take it that far…”",
        "I tried to keep my voice as gentle as possible to show that I wasn’t angry.",
        "And then, when Charlotte-san’s embarrassment and her need to be pampered increases, she does what she does best― she squeezes my arm and presses her face into it.",
        "I guess she was embarrassed and wanted to hide her face.",
        "But that just adds fuel to the fire, and as a result, the sound of shutters filled the station for a few minutes.",
        "“―I’m sorry…”",
        "I guess she thought she had gone too far.",
        "As soon as we got into the cab, Charlotte-san apologized to me in a faint voice.",
        "After that, many people asked me to take a picture with her, but I politely refused because the emotional damage to Charlotte-san from kissing me in front of everyone was too great.",
        "Incidentally, the reason I’m riding in a cab is to get rid of people who call themselves fans.",
        "Anyway, I guess I’ll have to think about what I’m going to do now when I get home properly…",
        "I gently stroked Charlotte-san’s anxious head as I thought about this.",
        "◆",
        "(**Ojou-sama’s POV**)",
        "“―As expected of Onee-sama’s daughter and Akito… They have done something diagonally above our expectations.”",
        "I told this to the silver-haired woman who was spending time with us in the other room while I was caring for the cute little silver-haired child in my arms like an angel.",
        "I have known her since I was a little girl, and I called her “Onee-sama” at that time, so I still call her that way.",
        "“What do you mean, Kanon-chan?”",
        "“―Please take a look at this.”",
        "Before I could say anything, Arisa, who is a capable maid, showed the phone to Onee-sama.",
        "Then, she raised her voice as if she was very surprised.",
        "“Well…! Lottie is so bold…!”",
        "She looked very happy even as she said this.",
        "I showed her a picture of Akito and Charlotte-san with some other girls.",
        "In the picture, Charlotte-san was kissing Akito on the cheek.",
        "This photo was found by Arisa on the social media site, but now they seem to be the people of the hour.",
        "Onee-sama didn’t seem to mind that her daughter was being exposed on the Internet, but normally this kind of situation wouldn’t happen.",
        "Especially since Akito’s reputation seems to have become so popular that it has overshadowed his old notoriety.",
        "Now, now, you’ve really done it.",
        "It’s always been a bad habit of that kid to add to the trouble as soon as you take your eyes off him.",
        "…Well, however― it is precisely because she was placed in this situation that Charlotte-san took this action.",
        "I’m not sure if I’ve ever seen a girl kissed in front of so many people, but she seems to have a very strong possessive nature.",
        "I wondered if the girl, who was so insensitive when it came to love, realized the meaning of this kiss.",
        "“But how did this happen?”",
        "“It seems that Akito has come into contact with an old acquaintance. From the look on Akito’s face, it seems that he was able to come up with some answers.”",
        "“Does that mean that the acquaintance’s child helped him in some way, not Lottie?”",
        "“Yes, perhaps the acquaintance gave him a way out of the worst case scenario.”",
        "Most of the content of the conversation they were having is all over social media.",
        "So we know what they were talking about, and I’m pretty sure that Akito is no longer standing in the depths of despair.",
        "In addition, the scene was captured on video, so I was able to see the changes in Akito’s expression and easily read his emotions.",
        "“Isn’t that going in a very bad direction? Are you okay with that?”",
        "“I can break his heart again if I have to, what do you think?”",
        "Since the situation was going in a direction far from what I expected, Onee-sama and Arisa asked me for my opinion.",
        "The current situation is undesirable― there is no doubt about that.",
        "However, the result will return to us more than what we were looking for.",
        "“No, that’s enough. Perhaps within a few days, Akito will visit me. Then― finally, checkmate. Isn’t that right, father?”",
        "After answering their questions, I stroked the head of the little child and gave a message to the man who was not here.",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Comments: Welp, this sh*t situation is far worse than what I had expected. I could only give my regards to our main characters!"
    ]
}