{
    "id": "chapter-119",
    "title": "Revealing the Seeds",
    "content": [
        "Translator: AJ1703",
        "(**Akihito’s POV**)",
        "“Could it be that the real reason Mom came to Japan is…”",
        "“Yes, I came to pick up Akihito-kun. Well, it’s true that I work in a department in Okayama.”",
        "I can’t believe Onee-san came all the way to Japan for me…",
        "But then the question arises.",
        "“Why didn’t you meet me as soon as you came to Japan?”",
        "It has been a long time since Charlotte-san came to Japan.",
        "I was curious as to why she had not met me even though she lived in the room next door.",
        "“Hmm~, I’ll derail from the topic so much if I tell you about that…”",
        "Charlotte-san’s mother tilted her head slightly, holding her index finger to her mouth.",
        "I found the pose endearing, but Charlotte-san gave me a disapproving look, so I just smiled and faked it.",
        "“Simply put, it’s to get Lottie and Akihito-kun to get along with each other. I would just get in the way.”",
        "I don’t know if she was unaware of our small exchange or not, but Charlotte-san’s mother held up her index finger and told me that with a smile.",
        "But the question still arises.",
        "“Wouldn’t it be better for us to get along better if Onee-san was the intermediary?”",
        "“I don’t think so. If I did that, I think Lottie would have kept a certain distance from Akihito-kun. She’s afraid of boys, even though she looks like this. She doesn’t show it.”",
        "Her mother’s words made Charlotte-san look away, as if she was offended.",
        "She must have hit the nail on the head.",
        "I see… so you wanted us to get along naturally.",
        "If that’s how it is, then―",
        "“The first day after the summer vacation, Emma-chan got lost, it was not an accident… but something that was planned, wasn’t it?”",
        "“Eh!?”",
        "Charlotte-san looked at me as if she were surprised at my words.",
        "But her mother was not surprised.",
        "Rather, she was smiling as if she had no choice.",
        "“What makes you think that?”",
        "“I knew from watching Charlotte-san at school that she would keep her distance from boys. But it would be the same even if we were neighbors. If left alone, me and Charlotte-san would only exchange greetings. You couldn’t just sit back and watch that happen.”",
        "So she prepared an event that would bring us closer together.",
        "Onee-san might do it, but Kanon-san might not.",
        "That’s what I thought.",
        "Of course, Emma-chan’s safety would have been the first priority, but Charlotte-san and I were not aware of that…",
        "“More importantly, Charlotte-san and I were on the same way on going back home, just at different times. And yet, the fact that Charlotte-san passed by Emma-chan without her knowing while I bumped into Emma-chan was something that bothered me.”",
        "It is conceivable that Emma-chan could have wandered off the path, getting lost, and Charlotte-san could have passed her at that moment.",
        "However, Emma-chan was crying a lot and Charlotte-san has good hearing at a level beyond that of a normal person.",
        "I thought that if they really had passed by each other, there was no way she would not have noticed her.",
        "“…That’s amazing, Akihito-kun is right. We deliberately made Emma go out to look for Lottie. Of course, there were a few of us dressed in unnatural-looking outfits, and we kept Emma surrounded and protected at all times.”",
        "In other words, the people who were around Emma when I found her were waiting for me to show up, not because they didn’t understand English and didn’t want to talk to her.",
        "They even went out of their way to act puzzled just to make it more natural…",
        "And presumably, other collaborators were also at school.",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Afterword: I am yet busy again so I wasn’t able to update last weekends so I apologize about that. I had to change some of the lines and phrases so that it would sound a bit better in English. If something looks off, tell me in the comments section."
    ]
}