{
    "id": "chapter-59",
    "title": "The Beautiful Transfer Student Who Gets Jealous is Too Cute",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "I didn’t have any dinner today because I didn’t have a tutoring job, but for some reason, Charlotte-san found out about it and offered to make me dinner.",
        "I was reluctant to do so since she already makes breakfast for me every day, but she insisted on making it for me.",
        "I refrained once because it would be a burden on Charlotte-san, but in my heart I wanted her to cook for me, so I decided to agree about it later on.",
        "After the three of us finished eating together, Emma-chan fell asleep leaning on my chest as usual.",
        "The only thing left to do was to carry her to my futon and let her sleep― and then Charlotte-san took out a manga with a very happy look on her face.",
        "“―This is the end, isn’t it?”",
        "As I finished reading the last volume of the manga I was reading, I called out to Charlotte-san, who was reading the same book next to me with our shoulders close together.",
        "Then Charlotte-san looked at me with expectant eyes.",
        "“What did you think after reading the last volume?",
        "“…………”",
        "“Wasn’t it interesting…?”",
        "When I became silent, Charlotte-san’s expression became darker and darker.",
        "But it’s not as if she’s given up yet, as she stares at me with moist eyes as if she’s trying to tell me something.",
        "To be honest, it’s not fair.",
        "She’s too cute when she looks at me like this.",
        "“It was interesting. It wasn’t just a matter of ego, it was a manga that made a lot of effort to draw, and the rival characters were getting stronger and stronger as if they were being pulled along by the main character. I quite like that kind of thing, to be honest.”",
        "There are results that emerge after putting proper effort to it.",
        "It’s not that they end up being disposable, but rather, they make the rival characters work hard and then beat them again.",
        "I like that kind of thing very much.",
        "“It’s just as Hanazawa-sensei said…!”",
        "“Eh? Miyu-sensei?”",
        "“Yes. She told me that if I were to recommend a manga to Aoyagi-kun, I should recommend one in which the characters make a strong effort.”",
        "“…I see.”",
        "I wondered why she was asking Miyu-sensei for advice, but to be honest, I couldn’t say anything because she was right on target with my tastes.",
        "Well, the fact that Miyu-sensei understands me so well made me think for a bit.",
        "“Is that why you recommended this manga to me?",
        "When I initially asked her about why she chose to read this manga, she told me to read it first.",
        "So now that I’ve already read it, I thought that I’d ask her now.",
        "“No, that’s not it. Of course that’s one reason, but the real reason is that I wanted Aoyagi-kun to know that this is how a mangaka works hard to draw their manga. To be denied something that was drawn with great effort, without even reading it, just because you don’t like it. Isn’t that a very sad thing?”",
        "[EDN: Mangaka literally translates to Manga Artist.]",
        "Charlotte-san was not angry at all.",
        "In fact, right now she was staring at my face with a very gentle expression with her hands clasped together in front of her chest.",
        "Her expression is so mature that it is hard to believe she is the same age as me.",
        "I felt like I hadn’t seen her side like this for a long time.",
        "I guess it was because I had seen only her childish attitude for the past few days.",
        "She is both mature and childish, two seemingly contradictory things that I think are both her.",
        "If you ask me which one is more attractive, they’re both attractive to me.",
        "Her mature side has a grace that attracts people.",
        "Her childish side has a cuteness that makes you want to protect her.",
        "It was out of place, but I knew once again that I liked her.",
        "“Well, yes. I know what you mean, Charlotte-san.”",
        "I didn’t say the words that came into my head, but smiled as if I were trying to fix them.",
        "Then Charlotte-san’s eyes lit up and she started to rummage through her bag to get something out.",
        "Oh, this is…",
        "When I realized what she was looking for, I smiled bitterly, contrary to what I had said earlier.",
        "As I did so, Charlotte-san took something out of her bag and walked towards me, looking happy.",
        "“Well then, Aoyagi-kun. Let’s read this next one, shall we?”",
        "What Charlotte-san handed me was a picture of the cover of a book with a full page of Loli on it.",
        "“I chose something that Aoyagi-kun might like!”",
        "“I-I see…”",
        "I could only smile bitterly at the smile that had no malicious intent at all.",
        "How am I supposed to react to this?",
        "Thinking about it, it seems to me that I’m being referred to as a lolicon now…?",
        "“Cha-Charlotte-san, is there anything else?”",
        "“Eh…? You don’t like it…? That’s strange…”",
        "When I said no in a roundabout way, Charlotte-san tilted her head curiously and stared at the cover picture.",
        "No, why does it seem strange to her if I didn’t bite on the loli-bait?",
        "“I thought I could definitely go for this one, so I didn’t prepare for anything else…. It can’t be helped, we’ll just have to give up for today―huh?”",
        "I’m not sure why Charlotte-san, who still seems unconvinced, suddenly made a strange voice.",
        "When I looked at her, I saw that her gaze had shifted from the manga to somewhere else.",
        "I followed her gaze and saw that it was my phone.",
        "And the notification light was on.",
        "“Aoyagi-kun, it seems that you have received some messages?”",
        "“That’s right. I think it’s probably either Akira or Aki―Ah.”",
        "“Eh? What’s wrong?”",
        "“No, it’s nothing.”",
        "I remembered something and my voice came out involuntarily, but I quickly covered it up.",
        "What I remembered was that I had not replied yet to Shinonome-san.",
        "From the point of view of the message that was sent to me, it would not be strange if I ended it there, but it would probably be a shock to Shinonome-san who was waiting for my reply.",
        "When I checked, I found that the sender was indeed Shinonome-san.",
        "When I looked at the contents, I found that it was―",
        "“……(´・ω・`)”",
        "―The emoticon message seem to indicate that she was silent and lonely",
        "As soon as I saw the emoticon, for some reason, the face of Shinonome-san with an expression like a puppy abandoned by its owner popped into my head.",
        "It may be too late to reply now, but I’ll do so just in case.",
        "“Sorry, I was a bit busy and couldn’t reply to your message.”",
        "It’s not possible to say that you haven’t seen the message because the “read” message will appear in the chat as soon as you see it.",
        "So I took the approach that I saw the message but couldn’t reply to it.",
        "It’s the kind of thing that girls often use on guys they’re not interested in, but it doesn’t mean that I’m treating Shinonome-san poorly.",
        "It’s just that I thought she would be shocked if I sent her a message saying I had forgotten.",
        "“Ah, I knew it― Mouu~…”",
        "I looked to the side and saw Charlotte-san with her cheeks puffed out looking at my phone.",
        "It’s a very rare thing for her, who is elegant and has common sense, to peek at someone else’s phone.",
        "I also wondered why her cheeks were puffed up.",
        "When I looked at Charlotte-san curiously, she also looked into my eyes.",
        "Then, slowly, Charlotte-san’s cheeks turned red, and for some reason her eyes started to glow.",
        "I gulped down my spit at the sudden increase in her s*x appeal, and while I was wondering what she was thinking, Charlotte-san hugged me tightly in her arms as if she was trying to be sweet.",
        "“Cha-Charlotte-san…!?!? What happened…?”",
        "I was confused by the turn of events, but I tried to talk to Charlotte-san.",
        "The hug is making my heart beat faster, but I feel like my heart rate is going to go too high and I feel I’m going to have a heart attack…!",
        "“I don’t know…”",
        "Charlotte-san made a sulky sound as she called out to me, and then she pressed her face into my arm.",
        "She looked like she was sulking, but her sulking was so cute that it made me feel hot all over.",
        "The development was so convenient for me that I wondered if I was dreaming.",
        "But the warmth of her body and the feeling of her arms hugging me told me that this was real.",
        "―After all, no matter how insensitive a man is, he will realize what she thinks of him.",
        "So, on the day I was going to go out alone with her, I decided to tell her about my feelings.",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Comments: IT’S ABOUT TIME LEZFOKKKKKKKKEN GOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO WE’RE NEARLY THERE BOIZ"
    ]
}