{
    "id": "chapter-131",
    "title": "A Sultry and Pampered Girlfriend",
    "content": [
        "Translator: AJ1703",
        "(**Akihito’s POV**)",
        "“―Muuu…”",
        "“Charlotte-san, why are you puffing your cheeks out…?”",
        "After some preparation for the move, Charlotte-san came to my room and was sulking for some reason.",
        "“Nn…”",
        "She jumped into my chest.",
        "And then she hugged me tightly and pressed her face against my chest.",
        "She has become quite a spoiled girl.",
        "“I guess she didn’t like the fact that I left Akihito-kun alone for so long and let Kanon-chan and Akihito-kun be together, so she sent Emma here to make sure you two weren’t alone.”",
        "Sophia-san, who was standing behind me, gave me a clear explanation of Charlotte-san’s condition.",
        "Come to think of it, we haven’t been this far apart in recent times…",
        "―I’ve only been away for about half a day.",
        "“…………”",
        "“Umm, Arisa-san…? You don’t have to look at me so coldly…”",
        "I understand that you’re appalled, but I don’t want you to give me that glare.",
        "I’m not flirting with her on purpose.",
        "“Charlotte-san, it’s in front of everyone…”",
        "“………….”",
        "“Ugh, you don’t have to look at me like you’re an abandoned puppy…”",
        "When I tried to let go, she looked at me sadly with moist eyes, and I felt guilty.",
        "My heart is not strong enough to let go of her in such a state.",
        "“You let her depend on you too much.”",
        "“Sophia-san, you’re acting like it isn’t your business…”",
        "“Well, it’s between Akihito-kun and Lottie, you know? More importantly, are we almost done here?”",
        "It’s true that it’s a problem between me and Charlotte-san, but I have a feeling that Sophia-san has quite a bit to do with how it turned out…",
        "No, I’m glad that she’s indulged with me.",
        "But of course, it’s still embarrassing in front of other people.",
        "“Yes, Onee-sama, it will be done soon, although Emma-chan is tired and has fallen asleep.”",
        "She was probably tired or bored and then went to bed…",
        "Well, I don’t want Emma-chan to help me, since most of the stuff is mine to begin with.",
        "But still, she was sleeping comfortably with Kanon-san’s lap as a pillow.",
        "“Well then, shall Arisa-chan and I do the rest?”",
        "“Eh, no… I’d feel bad. It’s my stuff anyway.”",
        "“Akihito-kun, do something about that one.”",
        "Sophia-san pointed at Charlotte-san, who was not letting go of my arm.",
        "Charlotte-san was still rubbing her cheek against my arm.",
        "When she was moving, she moved from my chest to my arm― she’s not marking me, is she…?",
        "She was jealous and it seemed kind of possible.",
        "“Please take a break for a bit, Ojou-sama.”",
        "“No, Arisa, I can’t take a break while Onee-sama is busy. Please watch over this girl.”",
        "With us by her side, Kanon-san entrusted Emma-chan to Arisa-san.",
        "However, Arisa-san started scurrying around as if she was in trouble, it seems that she was not good at handling little girls.",
        "She has a weakness in an unexpected way, doesn’t she…?",
        "I thought she was a perfect superhuman.",
        "“Well then, Onee-sama, let’s get it over with.”",
        "“Kanon-san, I’ll…”",
        "“Akihito, take good care of Charlotte-san, will you?”",
        "I was given a smile which made me say nothing, so I silently took Charlotte-san to the other room."
    ]
}