{
    "id": "chapter-71",
    "title": "The Flag That Must Not be Raised",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "―I listened to Charlotte-san’s story in silence.",
        "She had come to Japan due to her mother’s work.",
        "She didn’t know the details, but it seemed that Charlotte-san’s mother had worked for their company that had a department or something in Japan, and Charlotte-san’s mother was chosen to be the leader of the Japanese team.",
        "It seems that Charlotte-san’s mother, who was originally a workaholic, became even more dedicated to her work one day.",
        "Because of this, it seems that she has become such a great executive that she has taken on such a large role.",
        "Moreover, she has been so busy with her work that she hasn’t even been able to go home properly ever since she came to Japan.",
        "This is the reason why Charlotte-san is usually taking care of Emma-chan.",
        "“―which made me very happy because I loved Japan, but it was still very hard to leave my friends in England behind.”",
        "Charlotte-san continued with a nostalgic look on her face.",
        "She was probably thinking back to her friends in England now.",
        "“You were very close to them, weren’t you?”",
        "“‘Yes, we were very close. The girl I was closest to still calls me every day.”",
        "“Oh, I see. The time difference between England and Japan is nine hours, so it’s not easy to keep in touch.”",
        "“Yes, it is hard. Her name is Sophia and she’s very funny and cute―”",
        "“…? What’s up?”",
        "Charlotte-san, who had been happily talking about her friend, suddenly froze for some reason while she was talking.",
        "She slowly closed her mouth and looked away from me as if she was troubled.",
        "“I’ve just raised a very bad flag…”",
        "“Flag?”",
        "What is it?",
        "I don’t think she’s raising any flags, but…",
        "“Yes… She said she’ll be coming to Japan soon to visit me…”",
        "“It’s very nice of her to come all the way from England. Yet you look so anxious, is there something you’re worried about?”",
        "“Yes, I have a tremendous amount to worry about…”",
        "Charlotte-san thought about my question for a while and then answered me with a mysterious expression.",
        "What on earth could she be worried about?",
        "I can’t imagine what she’s worried about at all, but judging from the way she’s acting, it’s probably nothing out of the ordinary.",
        "If there was anything I could do to help, I’d help her…",
        "“If you’re in trouble, please talk to me. If I can help you, I’ll do my best.”",
        "For the time being, I tried to reassure Charlotte-san by smiling and showing an attitude of acceptance.",
        "But Charlotte-san only stared at my face for a moment, and then she immediately gave me a huffy look and shook her head.",
        "Apparently, I can’t be of help to her…",
        "“Ah, umm… it’s not that kind of problem, it’s just a little hard to say…”",
        "I guess it’s the expression on my face, so when I was depressed, Charlotte-san put her index finger together and followed me as if she was in a panic, fidgeting a bit.",
        "What does that mean?",
        "I don’t really understand…",
        "“W-well anyway, let’s continue with the story, shall we? When we came to Japan, we had already decided on a house to live in. It’s natural to say that if you don’t have a house, you’ll be living in a hotel, but for some reason, our mother chose our current apartment, which is far from her office.”",
        "Charlotte-san smiled deceptively, and then started to talk about the past again.",
        "She took the trouble to choose that apartment even though it was far away…?",
        "I could still understand if the company was close, but I don’t see the advantage of choosing that apartment if it’s far away.",
        "The price is cheap and the security is decent, but there are many other similar apartments.",
        "Since we are not in a city like Tokyo, there are probably many apartments available in the city.",
        "Since it was in the city, the price would be a little higher, but listening to her, I got the feeling that Charlotte-san’s family was rich.",
        "So why would she bother looking for a cheap apartment?",
        "If she’s not hurting for money, wouldn’t she choose a place close to her office?",
        "I’m not sure what’s going on here…",
        "Feeling uncomfortable with the conversation, I glanced at Charlotte-san’s face.",
        "However, Charlotte-san was not looking at me, and she was kind of fidgeting.",
        "“But because of that, I’m able to talk to Aoyagi-kun every day, which makes me very happy…”",
        "As usual, I couldn’t hear what she was saying.",
        "Maybe I don’t need to hear what she’s saying because she’s talking to herself, but I’m curious about what she’s saying.",
        "Anyone would be curious if someone they liked was saying something.",
        "“So, Charlotte-san, does your mother commute to work by driving? Or by train?”",
        "Although I had some questions about Charlotte-san’s monologue and why her mother chose that apartment, I decided that I wouldn’t get an answer if I asked her, so I asked her about something else I was curious about.",
        "In Okayama, commuting by car is the norm.",
        "There are only a few places where trains go, and fewer people ride them than in Tokyo, so unless you’re in Kurashiki, there’s only one train every thirty minutes.",
        "In some of the worst areas, there is only one train every hour.",
        "There is a way to commute by bus, but it’s not very convenient.",
        "So, except for those whose companies are located near stations such as Okayama Station, people usually commute by car.",
        "However, Charlotte-san’s mother is a foreigner, so I was curious about her situation.",
        "“She always drives a Mercedes Benz to work… No, she stays at a hotel near her office most of the time, so “always” might be a bit strange…”",
        "Charlotte-san replied with a wry smile, rubbing her cheek with her index finger.",
        "Yes, I’m sorry.",
        "To be honest, I don’t really care about that.",
        "But still…commuting to work in a Mercedes-Benz― I knew Charlotte-san’s family was rich…",
        "I shuddered at the name of the luxury car she had just mentioned.",
        "Mercedes Benz is a famous luxury car that even I am not interested in cars know about.",
        "I thought I would never have a chance to get one in my life, but I didn’t think there was anyone close to me who drove one…",
        "There are some cheap Mercedes-Benzes out there… but the one Charlotte-san’s mother is driving is probably the more expensive one…",
        "What if she has a 10 million dollar Mercedes Benz?",
        "Even if my confession was successful, I don’t think her mother would approve of me, wouldn’t she…?",
        "Or rather, why are they living in that apartment…?",
        "―The more I listened to Charlotte-san, the more I couldn’t understand why they were in the apartment we lived in, and the more I wondered what the reason was.",
        "…Later on, I heard that Charlotte-san was living on the top floor of a high-rise apartment building in England.",
        "Charlotte-san told me, as if laughing, that Emma-chan was very sulky at first because of the change from such a place to the current one, and I couldn’t help but feel like she lived in a different world when I listened to her.",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Comments: I literally shrank when I heard Mercedes Benz…"
    ]
}