{
    "id": "chapter-93",
    "title": "Come Back to Us",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Charlotte’s POV**)",
        "“Akito…?”",
        "“I can clearly see now that I had made the wrong choice. I ran away from my middle school teammates, and I ran away from you guys, and here I am.”",
        "“If so…”",
        "“But you can’t go back in time. You can’t go back in time… In manga, it’s easy to start over, but in real life, it’s impossible. You can’t undo what you’ve already done, and you can’t just pretend it never happened.”",
        "Akito-kun laughed softly and said this without changing his tone.",
        "It is true that going back to the past is impossible in reality.",
        "And I think Akito-kun is not saying that it’s easy to go back to the past in manga, but that it’s easy to atone for past mistakes and start over again in a manga.",
        "He is a very sincere and honest man.",
        "I thought that is why he tends to take his actions too seriously.",
        "He can forgive the mistakes of others, but he cannot forgive his own.",
        "That’s who he is.",
        "“But mistakes can be atoned for, and failures can be undone. That’s what you’ve always told us. Why do you follow up with your teammates but neglect your own? What’s the use of tormenting yourself?”",
        "As I thought, he seemed to have the same impression of Akito-kun as I did.",
        "“The mistake I’ve made was completely different from the mistake I made in the game. How many people do you think have quit soccer because of me? How many talented people’s careers have I ruined? I betrayed my teammates, put them through that embarrassing game, and even injured Akira for six months. I betrayed my teammates and made that game a disgrace.”",
        "Tears began to flow from Akito-kun’s eyes as he said this with a smile.",
        "I’m sure he’s been holding it in his heart for a long time.",
        "I felt as if my heart was going to burst out of my chest when I saw him.",
        "I also felt ashamed of myself.",
        "I had thought that Akito-kun was a wonderful person who could take care of everything around him and could do everything by himself.",
        "He was a kind and wonderful person who put off his own affairs and worked for the people around him.",
        "I only saw the front side of him and didn’t even notice the pain he was going through.",
        "What on earth was I seeing in him?",
        "I really feel ashamed of myself.",
        "“It wasn’t… just Akito’s fault, okay? The team was too dependent on you. That’s why they were so upset when you disappeared. As for Akira, it was because he forced himself to play in a disadvantageous situation, and one of our players who was in the heat of the moment injured himself because of a poorly executed lunge. You can’t blame yourself for something like that…”",
        "When he saw Akito-kun’s tears, he seemed to be able to control his voice even though he was upset.",
        "I could see that he was very concerned about Akito-kun and that he was really a kind person even though he was angry and did rough things.",
        "However, his words and thoughts cannot reach Akito-kun now.",
        "“But it doesn’t change the fact that everyone was upset because I wasn’t there. It’s a natural reaction when the leader leaves the team on the day of the game. And if I had been there, I wouldn’t have made Akira play like that, and I definitely wouldn’t have made him play so recklessly without causing any weird upset in the team. So it’s all my fault.”",
        "Akito-kun didn’t stop smiling as he spoke.",
        "The smile that seemed to be smiling gently now looks like a smile with no more power.",
        "And the tears overflowing from his eyes seemed to be unstoppable.",
        "Or perhaps Akito-kun doesn’t even realize that he is crying.",
        "That’s how apathetic his current smile looks.",
        "As I listened to him and looked at him now, I almost burst into tears myself.",
        "“Is that why you didn’t come back to the team? You were allowed to come back after the tournament, right?”",
        "“I told you before, how can I go back? Everyone resented me back then, right? Besides―”",
        "Akito-kun was about to say something when he closed his mouth as if in a panic.",
        "He might have been about to say something bad.",
        "“Besides, what?”",
        "“No, I’m not talking to you…”",
        "“―! You’re so quick to put up walls around people when it comes to yourself like that! You really look down on those around you, don’t you!? That’s why you reach out to the people around you when they’re in trouble, but when you’re in trouble yourself, you put up a false front so that people around you won’t notice! And you’re doing that because you think it’s useless to ask for help!?”",
        "Once he was calmed down by Akito-kun’s attitude, he started to get angry again when he heard Akito-kun’s words.",
        "There is no way that Akito-kun will look down on other people.",
        "He is just trying to be strong so as not to worry or bother the people around him.",
        "He seems to have been favored by Akito-kun, so he should have known that, but he seems to have lost his cool enough to say something like this.",
        "―Perhaps such an attitude of his had touched Akito-kun.",
        "“At that time, I was already dejected after hurting Kanon-san― you know, the Ojou-sama. I played soccer for a different reason than you guys. Of course, I loved soccer. However, the real reason I was playing soccer was to make her happy.”",
        "Akito-kun pressed his forehead with his right hand and let out a pained sigh.",
        "“So you didn’t see the point in playing soccer anymore?”",
        "“…………”",
        "In response to his question, Akito-kun fell silent and looked away.",
        "He must have got the point.",
        "I don’t know what happened between Akito-kun and Yamato Nadeshiko-san, as I was not around at the time.",
        "But I do know that they were very close.",
        "The fact that he was playing soccer just to please Yamato Nadeshiko-san is proof of that.",
        "No, you can’t…",
        "Even at a time like this, I seem to be getting jealous of Yamato Nadeshiko-san.",
        "“…Akito, I’m not going to say anything about why you were playing soccer. I don’t even feel like I missed out or anything.”",
        "When I became aware of my gloomy feelings, he, who had been angry at me for the opposite, let out a breath and calmed his voice down.",
        "Then, he makes his voice a little gentler.",
        "On the other hand, Akito-kun looked a little surprised.",
        "“I was surprised, I thought you would definitely tell me.",
        "“Because I know how you looked when you were playing. When we were playing soccer together, you certainly enjoyed it. That’s why we followed you. Otherwise, how could such a strong group of teammates be united? Did you know, the coaches had a lot of trouble after you left?”",
        "Then he smiled and cowered as if he was joking.",
        "He’s emotionally unstable, but I think he’s going through a conflict within himself.",
        "His anger towards Akihito-kun, his longing for him, and now talking to him, he has a lot of emotions that he can’t sort out.",
        "That’s probably why his emotions change with each word.",
        "However, I also know that he hasn’t completely changed his mind.",
        "I don’t know how to put it, but it seemed to me that he was trying to suppress his anger.",
        "“I know, because Akira told me. You did a great job organizing the team after I left. Thanks.”",
        "“If you’re going to thank me, you might as well show it.”",
        "“What do you want me to do?”",
        "“I’m not going to argue about the past. Like you said, it was a long time ago, and I know it won’t do any good to dig it up again.”",
        "“I’ve been saying it for a long time, and I don’t think it’s worth it now…”",
        "“But then you’d better start looking forward, too. Your choice not to play soccer is not a punishment, it’s an escape.”",
        "The bitter words that Akito-kun let out with a wry smile were easily passed over.",
        "Instead, he seemed to have made a distant invitation to Akito-kun.",
        "Apparently, he really wants Akito-kun to play soccer.",
        "As far as I can tell, he admires Akito-kun, and maybe that’s just the way it is… I don’t think it’s right to talk to him in such a blaming way.",
        "“Escape, huh… Yes, as I said before, I ran away from you guys.”",
        "“If you know what you’re doing, then you’re doing it real fast. If you really want to make amends, come back to us, Akito-kun. What you did can only be atoned for through soccer.”",
        "“That’s not true. No one will allow me to play soccer.”",
        "“No, at least I think it will make up for it better than you running away now. You once said that if you could bring out Akira’s true potential, you would be able to break down any solid wall.”",
        "I don’t know why he suddenly mentioned Saionji-kun, but Akito-kun is a big fan of Saionji-kun.",
        "Akito-kun is close friends with Saionji-kun, so I can’t say that he doesn’t have any favoritism.",
        "However, he has a great eye for people, so the fact that he has assured me means that he is sure of it.",
        "“You said it. In fact, he has scored a lot of goals against what they call an ironclad defense. At least I think he’s an indispensable member of the Japanese national team.”",
        "After all, Akito-kun spoke highly of Saionji-kun.",
        "As he talked about Saionji-kun, I could see a powerful will in his eyes.",
        "However―",
        "“But as soon as you retired, Akira was removed from the team.”",
        "The moment Akito-kun heard his words, he looked as if he had bitten down on a bitter bug.",
        "Eh…?",
        "I just noticed that Akito-kun had stopped smiling without any power before I knew it.",
        "Did his vitality return while he was talking to him…?",
        "“That’s because he’s been injured for six months…”",
        "“No, that’s not it. You know the truth, don’t you?　When we played together, you were the only person who could match Akira’s moves. When you were gone, Akira couldn’t do it as well as he should have, and the coaches took him off the team because he wasn’t good enough.”",
        "“…………”",
        "“A silent affirmation. In high school, there were passers who could match Akira, and Akira was called up to the national team again, but I honestly don’t think he’s giving it his all right now.”",
        "“So you want me to come back…?”",
        "“Yes, if he needs your help, why not you, who can bring out the best in him, too? In addition, your presence will certainly raise the level of the team several notches. And when that happens, we’ll be ready to compete with the world again.”",
        "It seems that he has really bought into Akito-kun’s abilities.",
        "It was said on TV that he was a genius, one of the best in a decade.",
        "It seemed as if such a person was trying to put his trust in Akito-kun.",
        "There might be a reason for this.",
        "“I see, so that’s the real reason you’ve been following me… It’s true that unlike in the past, you’ve been losing a lot of games to foreigners lately. That’s why you’ve been getting impatient and clinging to the illusions of the past.”",
        "“Just so you know, I’m not going to be provoked.”",
        "He said he was not going to be provoked, but I think he was angry with Akito-kun a lot…",
        "And even now, contrary to your words, your eyes seem to be very angry…?",
        "It seems that Akito-kun deliberately chose the words to make him angry, so it can’t be helped…",
        "However, I could immediately tell that Akito-kun was not really thinking this way.",
        "At any rate, when he said what he just said, Akito-kun’s eyes looked away from him apologetically for a moment.",
        "It was a sign of his kindness that he couldn’t face hurting others.",
        "So, as I had been watching him all day at school, I knew immediately that he was deliberately trying to make himself hated.",
        "“How can an ace striker’s team win if he’s so dependent on others? You need to be more realistic.”",
        "However, it seems that Akito-kun can’t back down either, and he still chooses to use words that will hurt the other person.",
        "I’m sure he doesn’t really want to say it, but why is he doing this to him?",
        "I guess it’s for the sake of the people around him, just like his behavior at school… It’s really hard to watch.",
        "“I don’t care what you say, you are the only person we need to represent us.”",
        "“I’ve been out of the game for two years. Even if I used to have that kind of power you’re talking about, I don’t have that feeling anymore. I don’t know if I can even make it as a representative.”",
        "“You can get that back. A year is enough time for you, don’t you think?”",
        "“That’s easy for you to say… We’re not in a manga, okay? Two years is too big of a gap. You guys are far more capable than you were back then. You know that, right?”",
        "“Do you even know who you’re talking to? What stage do you think I’m playing at now? The Olympic team or the first division of the Japanese League? I’m playing against older players, many years older than me, and I know firsthand that years don’t affect your ability. And you’re using your playing days as an excuse?”",
        "He was right, he was fighting against older people who were sometimes twice his age.",
        "Akito-kun seemed to think that he had misspoken on this matter and frowned.",
        "“It’s true that we’re no longer able to compete with the best in the world, as you say. But what if you came along and led the team to victory? Everyone would be praising you. And your past teammates would be proud to tell everyone about your great contribution to Japanese soccer. People are simple in that way. You may not like being used as an excuse, but you can accept it as your punishment. At least you’ll be doing them a favor instead of sitting here sulking.”",
        "“…………”",
        "After being told that, Akito-kun closed his eyes and began to ponder.",
        "He must be wondering whether this is really true or not.",
        "To be honest, if he had been on that stage to begin with, I think he would have really made it to the national team in about a year.",
        "I think he is the type of person who works very hard, to the point of stoicism, if he has to.",
        "And if that happens, we will have less time to spend together, and I will miss him.",
        "However, if that is what Akito-kun wants, I will do my best to support him.",
        "After all, I want Akito-kun to do what he wants to do.",
        "I wanted to support him.",
        "However, I don’t want him to force himself if he doesn’t want to.",
        "And perhaps he will―",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Comments: This is now the longest chapter so far in terms of jp character length. As of this writing, this is the longest chapter I’ve worked on compared to until chapter 103 (I checked the length until the latest raw release okay?). To be honest, this is just the usual length of Lonely Otaku chapters so it’s not much of a bother I suppose."
    ]
}