{
    "id": "chapter-41",
    "title": "Suspicion",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "“Well, the exams will start next week―”",
        "While Miyu-sensei was talking in homeroom, I was staring at Charlotte-san.",
        "She had a pained expression on her face on the way to school, but now she was sitting in her chair looking very pretty.",
        "As soon as she arrived at school, she quickly fixed her hair with the hand mirror she carried with her.",
        "I taught her how to catch her breath.",
        "I don’t know exactly how she did it, because I went to class first, but she was breathing well when she got there, so I guess she did it right.",
        "I think she’s a really nice girl who listens to people’s advice honestly.",
        "―That cute little girl was hugging my arm just now…",
        "I rubbed my right arm as I remembered what happened on the way to school.",
        "It was impossible, but it still felt like her warmth was there.",
        "“What have you been up to, Akito?”",
        "“―Ah!?”",
        "As I was rubbing my arm, Akira, who was sitting behind me, called out to me.",
        "When I turned around, he was looking at my face curiously.",
        "“Ah, no, it’s nothing…”",
        "“Fuun~? Could it be that you like Charlotte-san?”",
        "“―Wha!?”",
        "The question was suddenly thrown at me.",
        "I didn’t expect Akira to ask me this question.",
        "“…What makes you think that?”",
        "For a moment I was upset, but I immediately pretended to be calm.",
        "If I were to be overtly upset, it would imply affirmation.",
        "I had to change my response depending on Akira’s reaction, so I carefully observed him.",
        "“I was just wondering that since you seem to be paying a lot of attention to Charlotte-san. It’s similar to the way you look when you’re paying attention to Aki-chan, but the fact that you’re paying such attention to Charlotte-san, who you’re not even close to, means that you’re more than a little concerned about her, right?”",
        "It’s not too far from the truth.",
        "It’s true that I do care about Charlotte-san.",
        "The main reason is that she is so popular that she attracts a lot of people and seems to be prone to getting into trouble.",
        "But that’s based on the premise that I’m concerned about her.",
        "The reason why I was so concerned about Aki was because she was close to Charlotte-san.",
        "She herself is the type of person who attracts people to her.",
        "If there is one difference between her and Charlotte, it’s that she’s not very good at handling people.",
        "Aki is always in trouble because she gets shy around unfamiliar people and can’t talk to them properly.",
        "So when I was around her, I was the one who kept Aki away from people.",
        "After we became close in middle school, Aki never left my side, and I’m sure she came to me every recess because it was easier for her to deal with people when she was around me.",
        "That’s why people used to think we were dating.",
        "Well, I guess I don’t care about the past now.",
        "What should I say?",
        "Perhaps it’s because we’ve been together for so short a time, but Akira’s intuition is pretty bad, and when it comes to me, he’s very perceptive.",
        "I think it’s best to assume that a bad lie won’t work.",
        "However, I’m not sure if I can be honest about it.",
        "It’s obvious that Akira is targeting Charlotte-san.",
        "He’s not that low of a person to be harassing me just because I have the same love interest like he does, but I think it’s inevitable that things will get awkward.",
        "To begin with, I’m hiding the fact that I live next door to Charlotte-san and that she comes to my room every day to visit.",
        "It would be no fun for Akira to find out that my friend was hiding something from me, and I might lose his trust.",
        "It would be good if I could deceive him, but if I failed, the situation would be even worse.",
        "Either way, the risk is unavoidable…",
        "If that’s the case, it might be best to hide the fact that I’m living next door to Charlotte and tell him about my feelings for her…",
        "“Actually―”",
        "“Hoo~ you guys really never learn to not talk in my homeroom, do you? This time, Aoyagi is also on the scene, so you can’t get away with it.”",
        "I was about to tell Akira what I thought of Charlotte-san, when I heard Miyu-sensei’s happy voice over my back.",
        "I turned around fearfully to see Miyu-sensei staring at me with a smile on her face.",
        "I’m not sure if the angry blue streak on her forehead is an optical illusion or not.",
        "…That’s probably it, I’ve been up too late and my eyes are tired.",
        "I was too scared to look at Miyu-sensei, who was smiling despite her anger, so I decided to turn my attention away from reality.",
        "“What was it you guys were talking about when you were having so much fun?”",
        "I’m sure she wasn’t talking happily, but Miyu-sensei asked nastily.",
        "“Yes! We were just talking about how beautiful you are, Miyu-sensei!”",
        "Akira cheerfully flattered the angry Miyu-sensei with a smile.",
        "No, it’s not flattery because she actually has a beautiful face.",
        "“Yes, yes, that’s right. So, what were you guys really talking about?”",
        "Perhaps she was used to being told she was beautiful, but surprisingly, Miyu-sensei brushed Akira’s nonsense aside.",
        "I was expecting her to be angry or at least a little happy, but she didn’t go off topic, which is a shame.",
        "Well, what are we going to do now…?",
        "Sensei would be amused if I told her I was talking about Charlotte, and what’s more, there’s no way I could confide in her since she’s in my class.",
        "If that’s the case, I can lead them to a topic that Miyu-sensei doesn’t like.",
        "“Actually, Aki has asked me to go out with her tomorrow, but I was wondering where I should take her, so I was asking Akira for advice. Sensei, do you know of any good places?”",
        "The moment she heard my words, Miyu-sensei’s eyebrows twitched.",
        "Then she became slightly grumpy.",
        "“‘How could I possibly know where young men and women go on dates? If you want to talk about it, do it during recess. And since you have a test next week, I won’t allow you to go out and ruin your grade, okay?”",
        "That’s all Miyu-sensei said, and immediately went back to her desk.",
        "Whenever the topic of boys and girls going out, she would feign a bad mood and run away.",
        "The reason is that she has no experience when it comes to topics like places to hang out, so she can’t keep up with the topic.",
        "And when Aki gets mad at me, I become uncomfortable with Aki-related topics for a while.",
        "That’s why she went back with a light warning.",
        "Besides, it’s not a lie that Aki begged me to go out with her tomorrow.",
        "Well, if I fail a grade for this, I will be seriously pissed off…",
        "I promised myself that I would study hard for the test so that I would not get angry.",
        "―I didn’t even notice the way her eyes were staring at me."
    ]
}