{
    "id": "chapter-54",
    "title": "Excellent Person",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "“Um, is there something wrong?”",
        "I didn’t know why everyone was staring at me all of the sudden, but I asked anyway.",
        "The girls sitting on opposite sides of the table looked at each other, and then the girl sitting in the middle opened her mouth as a representative.",
        "“Aoyagi-kun, you have a very gentle voice.”",
        "“Gentle voice?”",
        "“When you talked to Shinonome-san, your voice was very gentle. Not only that, but also your expression.”",
        "The girl’s words made me think back a little, but I didn’t think I made a particularly gentle voice.",
        "I was just trying to be careful not to frighten her, but did my voice and expression change that much?",
        "“I also thought it was kind of surprising that he was paying so much attention to us.”",
        "As I pondered this, the girl sitting diagonally in front of me opened her mouth as well.",
        "“What’s surprising?”",
        "“Aoyagi-kun is very smart, but I had an image of you as being difficult to get along with. Well, it’s not that you’re a nag, it’s just that you often say things that make you seem like a jerk.”",
        "The girl diagonally in front of me on the right said what she was thinking without mercy.",
        "I wonder if I’m being accused of something?",
        "“But looking at what you just said, I wondered if you were a good person. When I think back for a bit, I feel like what Aoyagi-kun said was for our benefit.”",
        "“Oh, I thought about that too. When he spoke earlier, I thought, ‘What is he doing?’. But when I thought about it calmly later, I started to wonder if what Aoyagi-kun said was right.”",
        "What on earth was going on?",
        "The girls who had hated me until now began to justify my actions as if I had turned their back on them.",
        "It’s hard to believe that this would’ve happened just because of the exchange I just had with Shinonome-san…",
        "―When I was puzzled, I saw the face of a girl looking up at me happily.",
        "The girl’s beautiful silver hair is pulled over her ears with her hands, and she smiles when her eyes meet mine.",
        "The smile seemed to indicate that she was proud of herself.",
        "Apparently, she had been doing something behind my back.",
        "She had once told me that I should make our classmates understand what I was doing, but I had rejected her suggestion.",
        "I rejected the idea, because some things just don’t work without the bad guys.",
        "I’m pretty sure she would have respected my point of view at that time.",
        "However, I don’t know if she had something on her mind in the past few days, or if she just couldn’t overlook the kindness of her heart, but it seems that she was reaching out to our classmates without my knowledge.",
        "I thought it was unnecessary… but I couldn’t complain because she was doing it for my sake.",
        "On the contrary, to be honest, I was very happy.",
        "It wasn’t that I was happy that my classmates understood me.",
        "I was just happy that Charlotte-san was doing something for me.",
        "One thing I wondered was when she had done that…",
        "As far as I know, she never initiated anything like that.",
        "Well, but we keep our activities separate at school, so it’s no wonder I didn’t notice.",
        "“―That reminds me, Aoyagi-kun, you once participated in a national tournament in middle school, right?”",
        "As Charlotte-san and I stared at each other, the girl sitting diagonally in front of me to my left unexpectedly asked me an unexpected question.",
        "“Eh? Really!?",
        "“Seriously!?”",
        "The other girls seemed to be interested as well, and looked at me with a curious look on their faces.",
        "Shinonome-san was no exception to this.",
        "I couldn’t tell what she was thinking because I couldn’t see her eyes, but from the way she turned her head, it was obvious she was looking at me.",
        "“Yeah, one of the girls from the soccer team in the other class told me about it. The hotline between Saionji and Aoyagi was so great that no team in the prefecture could stop them.”",
        "Before I could even open my mouth, the girl sitting diagonally in front of me to my left started to explain.",
        "…It was annoying to be honest.",
        "I’ve never told anyone about this because I didn’t want others to know about it.",
        "Even Akira took my intentions into consideration and kept it a secret from everyone around me, but I never thought it would leak out from someone I didn’t know…",
        "“What’s a hotline?”",
        "“…Huh?”",
        "“You used it without knowing what it meant?”",
        "“Maybe it’s a hotline!”",
        "“No, that’s just what it is! And I don’t know what that means in soccer!”",
        "While I was trying to figure out what to do, the girls were getting excited on their own.",
        "When I turned my gaze to the side, I noticed that Charlotte-san was also staring at my face.",
        "Her gaze seemed to contain the will of “Why didn’t you tell me?”",
        "I quickly turned my gaze away from Charlotte-san.",
        "When I thought about it, I hadn’t told her much about myself, and it made me feel awkward, as if I was hiding something from her.",
        "I might as well explain to her about it tonight.",
        "Well, I doubt that I need to give out that much personal information, but I guess Charlotte-san will do.",
        "Rather, I should deal with the troublesome girls who are getting excited on their own.",
        "“No, I didn’t participate in the national competition.”",
        "After struggling to decide what to do, I told the girls that I didn’t participate in the national tournament.",
        "I’m not lying.",
        "This is an established fact.",
        "“Eh? But… she told me that you made it to nationals when you were a second year―”",
        "“―I’m sorry, can we stop talking about this now?”",
        "I didn’t want to talk about it anymore, so I interrupted her with a smile.",
        "“But…”",
        "“Stop it. Aoyagi-kun doesn’t want to talk about it.”",
        "The girl sitting diagonally in front of me to my left still tried to insist, but the girl sitting in front of me acted as a stopper.",
        "The girl sitting diagonally in front of me to my left fell silent, as if she couldn’t say anything else if her friend stopped her.",
        "I felt like I had done something wrong, but I didn’t want her to know, so please forgive me.",
        "Besides, unlike Akira, I quit soccer in the summer of my eight year.",
        "If I had continued to play soccer, it would have been an achievement, but if I had quit, it would have been a useless past glory.",
        "It was embarrassing to boast about such a thing, as if I was clinging to past glory.",
        "“But it’s true that you played soccer, right?",
        "“Ah… well…”",
        "This time, the girl sitting diagonally in front of me on the right asked me a question, and I nodded my head honestly.",
        "Because if I denied that, I would just be a liar.",
        "“…Being one of the best in the country at studying… and being able to do sports… Moreover, if you look closely at his face, you can see that he looks cool, right? Aoyagi-kun is an excellent person, isn’t he?”",
        "“Right? I thought that too.”",
        "“At the very least, he’s more mature than the other boys.”",
        "After hearing my words, for some reason, the three of them suddenly began to whisper to each other.",
        "Their voices are too low to make out what they are saying, but the fact that they are glancing at my face suggests that they are talking about me, right?",
        "…I’m afraid they’re going to say bad things about me.",
        "“―Why would you do that…? No, I understand how you all feel, but no matter how much you want to, this is…”",
        "As I looked at the three close friends who were talking stiffly, Charlotte-san next to me was astonished for some reason.",
        "And then, she squeezes the sleeve of my clothes under the desk so that they cannot be seen.",
        "“What’s wrong…?”",
        "I talk to Charlotte-san in a quiet voice so that the students around me won’t hear.",
        "Of course, if I turn my face to her, the students at the other tables will think I’m talking to her, so I keep my face to the front and hold a hand towel to my mouth as I speak.",
        "Shinonome-san sitting next to me might hear me, but I’m sure she’ll be fine.",
        "“No, it’s nothing.”",
        "“If that’s the case, I’d appreciate it if you’d let me go… If people find out about this, it’ll be a big problem.”",
        "“……….I’d like to do this for a little while…”",
        "“Ehh…?”",
        "Charlotte-san suddenly grabbed my clothes and wouldn’t let go, so I was afraid that my other classmates would find me."
    ]
}