{
    "id": "chapter-60",
    "title": "Aoyagi-kun's an Idiot...",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Aoyagi’s POV**)",
        "“Akito, let’s grab lunch in the cafeteria.”",
        "The day after I decided to confess my feelings to Charlotte-san, Akira tapped me on the shoulder because it was lunch time and he was hungry.",
        "This is a usual exchange, so I got up from my seat without any particular problem.",
        "…Speaking of which, I didn’t get the chance to talk to Charlotte-san about my past yesterday.",
        "Well, the main reason is that I didn’t want to ruin the good vibe I had with her.",
        "I glanced at Charlotte-san and saw that she was already surrounded by other students.",
        "This was another scene as usual.",
        "Many students want to have lunch with the popular girl, and there are often disputes over who gets to eat with her.",
        "Especially the boys who are fighting over Charlotte-san.",
        "However, in such cases, the girls collude and surround Charlotte-san, giving the boys no chance to take advantage of her.",
        "Charlotte-san herself has no problem with this, because she wants it, but the boys who are being ostracized are not happy about it.",
        "Even Akira was complaining about it just the other day.",
        "“Yeah, let’s go―Hmm?”",
        "I was about to leave the classroom when I noticed a pair of eyes staring at me.",
        "When I looked in the direction of my gaze, I saw a small girl with bangs covering her eyes looking at me.",
        "It’s Shinonome-san, the girl I’ve been talking to since yesterday.",
        "I had the feeling that she was still looking at me as if she wanted to join me.",
        "No, well, I’m not blind, so I just got that feeling.",
        "“…………”",
        "I thought about it for a bit, and then stepped towards Shinonome-san.",
        "“H-Hey.”",
        "Akira made a confused sound from behind me, but I let it pass.",
        "It would be a bit of a hassle if I reacted here.",
        "The reason is that it’s faster to fill in the outer moat.",
        "Of course, I am convinced that this will work in Akira’s favor as well.",
        "“Shinonome-san, would you like to eat with us? I don’t have a bento with me, so you’ll have to come with us to the cafeteria.”",
        "I invited Shinonome-san to join us for lunch in a quiet voice so that no one around us could hear.",
        "If I spoke too loudly, people would react and she would be in trouble.",
        "“Is it okay…?”",
        "“Ah, of course.”",
        "“―! Thanks…!”",
        "After nodding with a smile, Shinonome-san happily took out her lunch box.",
        "I walked back to Akira with Shinonome-san holding the lunch box in her hands.",
        "Then Akira gave me an earful, puzzled.",
        "“Hey, are you sure?”",
        "“What do you mean? No way, you don’t want to get involved with her―”",
        "“No, that’s not what I meant! Don’t look so angry. What I meant was, is it okay, about Charlotte-san…?”",
        "After quickly denying it, Akira turned his gaze to Charlotte-san, and I also looked at her.",
        "But she didn’t seem to be paying attention to me, and was happily chatting with the girls.",
        "Perhaps Akira was trying to say that if Charlotte-san saw me doing this, she would misunderstand.",
        "I don’t think I can fully gauge how close Charlotte-san and I are, but I understand what Akira was trying to say.",
        "It’s true that if someone saw me asking out another girl, it would be misunderstood by others.",
        "And I don’t want to be misunderstood by Charlotte-san either.",
        "But I can’t ignore her if she’s looking at me like she’s lonely.",
        "Besides, I was talking in a low voice, so Charlotte-san probably couldn’t hear me.",
        "“No problem.”",
        "“Are you sure? She was looking at you so hard just now.”",
        "“Eh…?”",
        "I looked at Charlotte-san again.",
        "But there’s no sign that she’s paying attention to me, and she’s happily chatting with other girls.",
        "In fact, it would be more conspicuous to stay here.",
        "“Let’s just go already. Shinonome-san is okay with this, right?",
        "When I asked her, Shinonome-san nodded her head enthusiastically.",
        "Watching her, I felt like I was dealing with a young child.",
        "“Haa~… Well, that’s fine… But, why is Shinonome hiding behind Akito’s back and keeping her distance from me?”",
        "Indeed, Akira is right, Shinonome-san is hiding behind my back for some reason, which causes Akira to ask Shinonome-san with a quizzical look on his face.",
        "Then, for some reason, Shinonome-san, who was at my back, squeezed me and grabbed my clothes.",
        "When I turned around, I saw that Shinonome-san was looking up at Akira’s face, peeking out a little from behind my back.",
        "She’s probably afraid of Akira.",
        "But that’s not good enough.",
        "My goal is to make more friends for Shinonome-san.",
        "But to be honest, I don’t get along well with girls, and I don’t get along that well with boys either.",
        "So the only person I can introduce as a friend is Akira.",
        "What will happen as a result will depend on the two of them.",
        "At least, I can assure you that they are very nice guys.",
        "“She’s probably afraid because of Akira’s tone.”",
        "“No, I’m telling you, Akito’s tone is getting worse every now and then too, you know?",
        "Akira looks at me as if he doesn’t want to be told off by me.",
        "I’m certainly aware of that, but I’m careful to be gentle when I talk to Shinonome-san.",
        "If I don’t, she’ll be frightened like she is now.",
        "“Well, anyway, don’t do anything to frighten her.”",
        "“Are you her guardian…?”",
        "“I’m not trying to be though…”",
        "I smiled bitterly at Akira, who looked at me as if he was dumbfounded.",
        "It’s not that I’m not trying to be her guardian, but it’s true that the reason I’m so concerned about her is because I think of her as a child that I should protect.",
        "“Aoyagi-kun is… kind…”",
        "As Akira and I were talking, Shinonome-san, who was hiding behind my back, complimented me.",
        "“Her voice is so cute…”",
        "Akira, who was probably hearing Shinonome-san’s voice for the first time, had the same impression of her cute anime voice as I did.",
        "After all, it seems her voice is cute no matter who hears it.",
        "However, as expected, I didn’t say anything in front of her.",
        "Thanks to this, Shinonome-san seemed to be embarrassed and pulled my clothes on with a squeak.",
        "Shinonome-san, please stop pulling on my clothes to hide your embarrassment.",
        "After all, it was Akira who made the remark.",
        "“I’m starting to wonder… The world is so unreasonable…”",
        "I’m not sure why Akira suddenly started lamenting while I was looking at Shinonome-san.",
        "“Yes, yes, let’s just move already since lunch break will be over soon.”",
        "“Oh, that’s right.”",
        "I knew that he wasn’t depressed for any major reason, so I pushed Akira’s back as he and Shinonome-san headed for the cafeteria.",
        "“―Mou~…”",
        "“Hey Charlotte-san. Why are you puffing your cheeks up and back again?”",
        "“It’s nothing……… Aoyagi-kun’s an idiot…“",
        "I didn’t know that such an exchange was taking place in the classroom.",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Translator’s Comments: Thank you all for the total of $50 donation for these past two days from various supporters! I’m currently at 75% of the $200 Ko-Fi goal for my laptop which is about $150 so another $50 donation would complete it.",
        "It looks like I need my mother to pay back what she initially used for downpayment in this new house we moved in a week ago. Thank you all for the support! I’ll keep releasing more chapters for you guys~",
        "Also, I plan to try and catch up with the latest raw chapter of this series which is chapter 102 in a week or so.",
        "[On a side note, please read this LN, TL’d by a fellow translator in our group here titled “Taking Care of My Younger Sister’s Too Naive of a Beautiful Yankee High Schooler, Then Falling in Love”. It’s very fluff like this series, I rate it a 5/5 so you guys should read it too! It’s a bit cliche at times but I still believe it was written well.]"
    ]
}