{
    "id": "chapter-92",
    "title": "A Man With Low Self-Esteem and The Evaluation of Those Around Him",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Charlotte’s POV**)",
        "“Didn’t I always tell you not to call me by that alias?”",
        "Akito-kun showed a hint of anger at being called “The Genius Game Maker.”",
        "He might have thought he was being made fun of.",
        "“You’re still strange, you don’t accept the praise you’re getting.”",
        "“What I’m trying to say is that I’m not worthy. I was always helped by Riku, Akira and the rest of my teammates, but I’m not that great.”",
        "“The only flaw I can find in you is your low self-esteem. You really have always been too humble, you know.”",
        "I understand that very well.",
        "Akito-kun is a wonderful person, but somehow his self-esteem is low.",
        "His academic performance is also in the top rank in the national mock examinations, but he always says that his results are just a coincidence.",
        "He is also completely unaware of the fact that various girls have recently taken a liking to him.",
        "In the first place, he doesn’t seem to believe that he is actually being looked at in that way.",
        "This is probably because Akito-kun thinks he’s unattractive to others.",
        "It is not that Akito-kun despises himself, but he’s trying not to be more confident than necessary.",
        "“You know… you’re evaluating me too much.”",
        "“That’s not the case, though? It’s true that you may not have had the best dribbling skills. It’s not that you’re not good at it, but you’re a top player and you’re in the middle of the pack.”",
        "“You’re very clear…”",
        "Akito-kun smiled bitterly at the words.",
        "I also read soccer comics, so even if I don’t play soccer, I know what it is to be under the top.",
        "Simply put, it is a position where you pass to the forwards, who are the ones who are most likely to score goals, to create chances or to score goals yourself.",
        "This position is also called the “control tower” because the player is in charge of steering the attack, thinking about who to use and how to score.",
        "For this reason, the top players are required to have a good grasp of the situation around them and be able to make decisions at a moment’s notice.",
        "“But your passing sense was top-notch. Your ability to pass the ball accurately to the feet of your teammates without missing a beat, and your ability to anticipate the movements of your teammates to create chances. You were able to create chances by just anticipating the movements of your teammates and not just jumping at the chance. As far as I know, you are the only person in Japan who can do that.”",
        "As I recall, the person talking with Akito-kun is a professional player from Hiroshima who was selected for the Olympic team and is often seen on TV these days, isn’t he?",
        "He was 16 years old, the same age as me and Akito-kun, and I remember him well because when he appeared on TV, Akito-kun’s face would change slightly.",
        "Does it mean that Akito-kun was such a great soccer player that he is so highly regarded by such people…?",
        "“I told you not to do that. I can’t do it like a machine.”",
        "“You actually did it, you know. In fact, you did it so well that the coaches admitted that the team would have gone up several levels with your addition to the team. Why can’t you admit that?”",
        "“It’s because you’re just trying to praise me, like now. Delusion does not produce good results.”",
        "“So how do you explain the fact that we beat Brazil and Spain? Aside from the Spain game, we were losing 0-2 against Brazil until you and Akira came on in the second half. Didn’t you guys come in and help us win?”",
        "Brazil and Spain… are countries that have strong soccer teams.",
        "How strong were you, Akito-kun, to have beaten such countries…?",
        "“It’s just that the Brazilian defenders couldn’t handle Akira’s unpredictable moves.”",
        "“You think it was the same against Spain? Didn’t you have a decisive chance in the last five minutes of the second half to score the winning goal because you kept setting the tone early on?”",
        "“It was because of your dribbling skills and determination that we were able to score the winning goal in the last five minutes of the game. If it wasn’t for your dribbling skills and determination, we wouldn’t have scored.”",
        "“Why do you have to be so clueless when it comes to yourself?”",
        "“What are you trying to achieve by raising me up? I don’t know what you’re trying to say by bringing up the past now?”",
        "I don’t know what to do…",
        "Even though I don’t have a complete grasp of the conversation they’re having, I can see the two of them deviating from what they originally wanted to talk about, and the other one is getting more and more heated, probably because of the way they parted in some kind of fate.",
        "Akito-kun is not as kind as he usually is, and he does seem to be treating him a little coldly, if not angrily.",
        "If this continues, they may end up in a terrible fight…?",
        "H-However, if I were to intervene here, the two of you would be incomplete, and you might end up dragging it out later on…",
        "I’m not sure what to do…",
        "―In the end, I decided to keep my mouth shut and watch the two of them interact, as Akito-kun seemed to be trying his best to keep his cool.",
        "“Oh, come on! I feel like we’ve had this exchange before!”",
        "“Thanks to your unwanted comments to the reporter.”",
        "“It’s because they’re only talking about me and Akira, the ones who were scoring points, and not you, the one who created the opportunities!”",
        "“That’s okay, I don’t mind. I didn’t play soccer to show off.”",
        "“Then what was the point of you playing soccer? I can’t believe that I – or anyone else who was in the national team at the time – would simply drop out of the national team and quit playing soccer because of something like that!?”",
        "The other party shouted and grabbed both shoulders of Akito-kun firmly.",
        "He seemed mild-mannered and gentle, but he appears to be a very rough man.",
        "As I expected, Akito-kun’s life was in danger, so I stepped forward, not wanting to stand idly by.",
        "But―",
        "“I feel bad for you guys.”",
        "I stopped again when I heard Akito-kun’s very gentle voice.",
        "He is smiling gently in this situation, somehow.",
        "I wondered how he could have such an attitude in this situation, when earlier he had expressed his disgust.",
        "Even though I have been by his side for a while now, I couldn’t understand what he was thinking right now.",
        "―But I will soon understand.",
        "I soon realized that this smile was not kindness, but resignation.",
        "Yes, the smile that I perceived as kind was really a self-deprecating smile."
    ]
}