{
    "id": "chapter-97",
    "title": "The Fans and The Goddess",
    "content": [
        "Translator: AJ1703",
        "Editor: Matsu",
        "(**Akito’s POV**)",
        "“I’m tired…”",
        "I muttered to myself in the rattling train.",
        "After that, Charlotte-san and I were subjected to a barrage of questions from the girls.",
        "As you can imagine, I couldn’t handle them, so I managed to escape, but thanks to them, my amusement park date with Charlotte-san was ruined.",
        "On the contrary, Charlotte-san was now sulking as she rested her head on my chest and hugged me.",
        "“I’m sorry, Charlotte-san…”",
        "“…………”",
        "I apologized as I gently stroked her head, and she silently pressed her face into my grimace.",
        "Apparently her mood hadn’t improved yet.",
        "The reason she was sulking was not because she couldn’t go on the amusement park date she was looking forward to, but because she didn’t like the fact that I was surrounded by a ton of girls asking me questions.",
        "She had just told me that she was worried about me because I looked like I was being fawned over by other girls.",
        "And there was one more reason.",
        "That was―",
        "“The way they called you Akito-kun, they stole it from me…”",
        "The fact that the girls who were inspired by Riku called me “Akito-kun” shocked Charlotte-san, who wanted to think of it as a privilege reserved for her.",
        "I’m not sure what to say, but she seems to be quite jealous despite her appearance and normal personality.",
        "But when you consider that she is Emma-chan’s older sister and that she is actually a spoiled girl, it naturally makes sense.",
        "Emma-chan is also a bit jealous or possessive, and I think it’s normal for a spoiled child to want to monopolize the person who spoils her.",
        "To be honest, I’m sorry to say that she’s sulking, but Charlotte-san is also being very cute right now.",
        "No, on the contrary, the expression on her face, which is usually invisible, made her look even more attractive.",
        "But now I’m a public figure on social media, and since I’m on a crowded train, I’m attracting a lot of attention.",
        "The girls in particular were looking at us with a twinkle in their eyes, itching to talk to us.",
        "However, the reason they don’t talk to us is probably because of Charlotte-san’s current condition.",
        "The girls staring at us are looking at us like we’re something very precious.",
        "There’s still a lot of talk about us on social media, but I really don’t know what’s going to happen now.",
        "To be honest, my head hurts, but right now, I have to deal with this cute girl.",
        "“Well, I guess it can’t be helped since you’ve been calling me by my first name. Why don’t you try calling me something else?”",
        "“Well, darling―”",
        "“””””―!?”””””",
        "“―It’s impossible, I’m too embarrassed.”",
        "When Charlotte-san and the girls that had been staring at us were surprised by her suggestion to call me something outrageous, she turned red with embarrassment and pushed her face into my chest again to hide it.",
        "Apparently, she was just trying to say it.",
        "The girls got insanely excited when they saw that, but I can’t have them pointing their phones at me.",
        "Unlike Riku, Charlotte-san and I are civilians, so they really shouldn’t be taking pictures of us.",
        "“Excuse me, could you please stop taking pictures?”",
        "At any rate, I try to smile and tell the girls gently so as not to antagonize them.",
        "For some reason, the girls blushed and nodded their heads.",
        "When Charlotte-san saw this, she pressed her face against my chest and showed her dissatisfaction.",
        "It seems that this was a no-no for her.",
        "No, yes, why…",
        "I’m a little uncomfortable with Charlotte-san’s attitude, but I still can’t ignore the voyeurism.",
        "At any rate, I decided to talk to the girls since I had talked to them.",
        "“Erm, what can I do for you?”",
        "I called out to the girls while continuing to gently pat Charlotte-san’s head, which made her even more sulky.",
        "I was aware that I was doing a terrible job, but I couldn’t help but get a sad look on my face when I stopped petting her.",
        "When I called out to them, the girls looked at each other and nodded.",
        "Then one of the girls walked up to me as if she was representing the group, and opened her mouth as if she had made up her mind.",
        "“U-umm, could you take a picture with us…?”",
        "“…Eh?”",
        "I tilted my head for a moment, unable to understand what the girl had said.",
        "Then the girl opened her mouth again.",
        "“You’re Akito-kun, right…? We became your fans because we were moved by your interaction with Riku-kun and the way you value your girlfriend more than anything else…! So we’d like you to take a picture with us…!”",
        "The girl said and held her phone up in front of her chest.",
        "As if in response, the girls nodded their heads in the back.",
        "No, yes.",
        "Wait a minute.",
        "“I’m just a normal person, you know? Isn’t it weird to be a fan or something?”",
        "“But you used to be a member of the Japanese national team! And you’re the one that Riku-kun is relying on so much! That alone makes you not an ordinary person!”",
        "Yeah, what’s with the absurd logic?",
        "I’m not sure how much reverence this Riku guy has for me…",
        "“Erm, I appreciate your evaluation, but I can’t have you being a fan or taking pictures of me. Apparently, they also bought into your attitude of caring for her, but I think your behavior makes her uncomfortable.”",
        "If I took a picture with the girls who claimed to be my fans, it was obvious that Charlotte-san, who was currently sulking immensely, would sulk even more.",
        "So I changed my words a bit, but I said no without hesitation.",
        "However―",
        "“Oh, and of course, please take your girlfriend with you…! She’s a foreigner, isn’t she? She’s very pretty and I envy her…!”",
        "Apparently, the girls have no intention of pulling out.",
        "Or rather, they seem to want to take a picture with Charlotte-san, who is an eye-catcher.",
        "“I’m sorry, that’s not―”",
        "“That’s fine.”",
        "When I tried to refuse, Charlotte-san somehow raised her face from mine and said yes.",
        "This made the girls happy, and it became impossible for me to say no now.",
        "“Charlotte, are you sure you want to…?”",
        "“I don’t want to disrespect the girls’ feelings.”",
        "Charlotte-san then smiled a lovely smile that anyone would love to see.",
        "Yeah, I forgot that this girl is not the kind of girl who can easily refuse the requests of others.",
        "But it’s obvious that she’s overreacting.",
        "But, if I were to force myself to say no, there is a possibility that I would be dissatisfied and people would say things about me that I have not said.",
        "So, once I said yes, I had no choice but to take a picture with the girls.",
        "“―And I have to show them that I’m Akito-kun’s girlfriend…”",
        "“Eh?”",
        "“No, no, it’s nothing.”",
        "I thought I heard a word that bothered me just now. Is it my imagination or something else…?",
        "“It’ll be a nuisance if we’re on the train, so can we get off at the next station?”",
        "When I was puzzled by Charlotte-san’s words, she moved away from me and called out to the girls.",
        "“Y-Yes, of course! You guys are good too, right!?”",
        "When the representative of the group turned around and asked the girls behind her, they were shaking their heads very happily.",
        "They seemed to be shaking their heads in delight, as if they were about to have their picture taken with a celebrity.",
        "My head really hurts right now.",
        "“‘His girlfriend looks like a goddess inside as well as outside,’ there. Okay, send.”",
        "“…Wait a minute. Where did you just send it to?”",
        "The girl who was operating the phone muttered some disturbing words, and I couldn’t help but react.",
        "“Eh? What do you mean, on social media?”",
        "“Yeah, I’d appreciate it if you didn’t post anything like that…”",
        "I did my best to swallow my complaint about why she was tilting her head without offense, and asked her to do so.",
        "But―",
        "“But social media is now full of topics about Akito-kun and the others. One or two things won’t change anything now.”",
        "It seems that they didn’t understand our thoughts.",
        "I’m sure it’s become a norm to mumble about casual things.",
        "I think the girl should know a little more about manners.",
        "“Akito-kun, it’s fine. It’s not like she wrote any bad words.”",
        "As I tried to figure out how to convey my message, Charlotte-san next to me shook her head with a gentle smile.",
        "And with that―",
        "“”””Kanojo-san is so kind~!””””” [TLN: Kanojo means girl, but it could also be a girlfriend. Obviously, the meaning is the latter on this one.]",
        "―The girls become even more excited, but seeing this, I recognize that I am not compatible with these girls.",
        "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "Editor’s Comment: This girl is being aggressive by every chapter."
    ]
}