{
    "id": "chapter-28-when-you-can-almost-see-under-the-skirt-but-cant-2-2",
    "title": "Chapter 28: When you can almost see under the skirt, but can’t (2/2)",
    "content": [
        "“…Hey, Yuu-kun?”",
        "Yuuka briefly muttered those words.",
        "Her voice was trembling, and with a tint of fear and anxiety in her voice, she asked.",
        "“Did you really want to see… Nihara-san’s panties..?”",
        "“Why are you asking that with such a serious expression?!”",
        "I couldn’t help but raise my voice hysterically at Yuuka’s unexpected remark.",
        "But Yuuka kept a very serious expression on her face.",
        "“B-because Yuu-kun! You were definitely looking at Nihara-san’s skirt! The expression on your face was basically screaming, ‘I wonder if I can see inside her skirt?’”",
        "“I’m telling you, I didn’t do anything like-”",
        "No… making any more excuses would just be pointless.",
        "I’ve got no other choice here.",
        "I decided to be honest and tell her everything.",
        "“…It’s true that I got curious because her skirt was really short. That’s why I reflexively turned my gaze to her skirt and her legs. I’ll admit that much.”",
        "“Uwaa… so I was right the whole time!”",
        "“But, it wasn’t because it was Nihara-san or anything like that! It was just something I did reflexively! It’s a physiological phenomenon!”",
        "I want her to understand at least that much.",
        "I wasn’t lusting after Nihara-san.",
        "I was only interested because a girl’s bare legs were peeking out of her miniskirt.",
        "Any other boy would’ve had the exact same reaction. For sure.",
        "“…Is that so?”",
        "Yuuka was covering her eyes with her hands as she glanced over at me.",
        "There weren’t really any traces of her crying.",
        "So she was just pretending to cry, huh… I knew it.",
        "“It’s the truth. It wasn’t because it was Nihara-san or anything like that. It just so happened to be visible, so I unconsciously glanced at it.”",
        "My explanation basically exposed my desire to see some panties… but I had no other choice.",
        "I mean, if you think about it carefully.",
        "Between the concept of “I tried to look at Nihara-san’s panties” and “I tried to look at some panties that just so happened to be visible”",
        "See, they have very different meanings, right?",
        "“So, Yuu-kun. You didn’t want to see Nihara-san’s panties or anything like that, right?”",
        "“Yes. That’s exactly what I’m saying.”",
        "I said those words as manly as possible.",
        "I must’ve looked very gallant and dignified, right?",
        "When Yuuka saw like that, she slowly opened her mouth.",
        "“…So, what if it was mine?”",
        "“Heh?”",
        "Her reply was completely unexpected, so obviously I’d make a strange sound.",
        "Perhaps she was embarrassed by my reaction since her face started turning red.",
        "“W-what if it was mine? F-for example, if I and Nihara-san were to wear the exact same skirt, and if we were sitting in the exact same position… In that situation, Yuu-kun…would you have preferred to see my panties instead?”",
        "As she said this in a nervous and awkward tone, Yuuka quietly put her hands on the hem of her skirt.",
        "Then…",
        "The hem of her skirt was slowly lifted up.",
        "Yuuka’s white, slender, and beautiful legs started peeking out.",
        "I have to stop her.",
        "I know I have to stop her… but the words won’t come out.",
        "Because unlike before… I was too nervous in anticipation.",
        "I started feeling something that wasn’t there when Nihara-san did this…",
        "A strange sensation rose up from deep within my heart, and it froze my thoughts.",
        "“…Uuu…”",
        "Then… just as I was about to see the inside of her skirt…",
        "Yuuka’s hand suddenly stopped.",
        "“…Yuu-kun… you baka… pervert…”",
        "“No, no, no! Aren’t you being unreasonable here?! Isn’t this just a honeytrap?!”",
        "“…Uuu… I’m sorryy…”",
        "I desperately tried to explain myself as Yuuka’s body was trembling.",
        "She looked up at me with upturned eyes and faintly muttered.",
        "“As expected… It’s too embarrassing…”",
        "“Isn’t it obvious?! Just put your skirt back down for now!”",
        "In the end… Yuuka properly fixed her skirt. Then, she leaped onto the sofa and buried her face in the cushion.",
        "Obviously, she went too far, and now she’s feeling embarrassed because of it.",
        "Her face was hidden behind the cushion as she mumbled something.",
        "“Auuu…”",
        "“Geez… This is all because you got obsessed with such a weird… rivalry..?”",
        "As I was about to scold her, I unconsciously stopped talking.",
        "Because…",
        "Yuuka carelessly jumped onto the sofa, and now her skirt was flipped up…",
        "“…Huh? Yuu-kun, what’s wrong…?!”",
        "Then, Yuuka’s scream echoed throughout the house.",
        "She started hitting me over and over relentlessly.",
        "But, all I could think about was their color… White.",
        "For a while, I couldn’t think of anything else.",
        "◆",
        "I was going to work on the weekends, but Valorant distracted me. So now I’m 4 chapters behind schedule, but I should still make it by the end of March. Also, I found out how to get my kofi button here, so that’s nifty.",
        "Ko-fi"
    ]
}