{
    "id": "chapter-39-my-fiance-is-secretly-sweet-with-me-2-3",
    "title": "Chapter 39: My fiance is secretly sweet with me (2/3)",
    "content": [
        "After the boy left, we thanked the teacher and left the school.",
        "“Thank you, Yuuka. Even though you just got back from the event, you came all the way out here.”",
        "“No, I’m the one who should be thanking you, Yuu-kun. Thanks to you taking over for me here, I was able to attend the event.”",
        "It was evening in the city, so Yuuka and I kept a fixed distance from each other.",
        "It was a small gap, just enough so that our hands didn’t touch each other.",
        "We’re acting as if we’re strangers, and it’s kind of funny.",
        "“Speaking of which, seeing you playing around with the child… was so cute~!”",
        "Yuuka stretched her arms wide as if she was stating the obvious.",
        "“Mmm? Me, cute? Don’t you mean the kid?”",
        "“The kid is cute, and Yuu-kun is cute too! That’s a universal truth!”",
        "“I’m a boy in his second year of high school though…”",
        "“You’re cool, and you’re cute! That’s what makes Yuu-kun so attractive!”",
        "I don’t know what’s so cute about such a disgusting and filthy man like me, though.",
        "Yuuka’s tastes are pretty strange, aren’t they?",
        "“Ahh, but you know… Me and Yuu-kun, playing together with a child… right~?”",
        "“What are you implying there..?”",
        "“You don’t get it~? You really don’t get it, huh~”",
        "“Sorry, I don’t get it at all.”",
        "Yuuka was bashfully squirming around, but I couldn’t grasp what she was trying to tell me, so I felt confused.",
        "Perhaps she grew impatient when she saw me at a loss for words, as Yuuka circled around and came in front of me.",
        "Then, she turned her gaze down as she softly muttered.",
        "“Like I said! I want to see our…”",
        "“Eh, what? I couldn’t hear-”",
        "“Mou, baka! I’m saying I want to see our children!”",
        "This time, Yuuka shouted really loudly.",
        "Her shout made a crow fly away from the top of a nearby tree.",
        "A spring breeze blew through the air between the both of us.",
        "“Uuu… Auuuu…”",
        "Yuuka’s cheeks were red, and the sunset was probably… not the only reason why.",
        "“Yuuka.”",
        "“Y-yeshh!”",
        "I only called her name, but Yuuka looked startled as she freaked out.",
        "Yuuka is such an expressive person.",
        "She has so many faces and expressions.",
        "I think I’ll never get tired of seeing all of them.",
        "“How was the event?”",
        "“Eh?”",
        "“All right. Give me a Yuuna-chan style report.”",
        "“Ehh?! That’s such a high hurdle, mou…”",
        "Yuuka had a grimace on her face as she took a deep breath.",
        "Then… she changed into Izumi Yuuna.",
        "“Good evening, this is Yuuna! Today, I got to perform in the Alice Stage event! Mou, I caused lots of problems for the other Alice Idols… I was too nervous!”",
        "She still looked like Watanae Yuuka, but her voice and expression were like Yuuna-chan’s.",
        "The gap was so bizarre, I couldn’t help but laugh out loud.",
        "“I did my best to talk to everyone, you know? But, everyone just treated me like an airhead! Everyone was just like, ‘Eh?’. Mou!! Yuuna is a very mature person, you know? I’m not some sort of silly character!”",
        "“Well, the more airheaded you are, the less likely you are to admit you’re an airhead.”",
        "“What the heck is that? Mou!! So, last but not least! I had a special outfit prepared for me… and I sang! I sang! I was very nervous about singing in such a big venue, but… Ehehe~. It made me feel pretty happy too!”",
        "Remembering Yuuna-chan’s singing voice made me feel calm and peaceful.",
        "I love her usual voice, but I love her singing voice as well.",
        "“…But,『Grim Reaper in Love』-san…”",
        "She suddenly lowered the tone of her voice.",
        "Then she turned her back on me… and she looked up at the sky.",
        "“The fact that you weren’t there… made me feel just a bit lonely. Because, you always help Yuuna to be cheerful and brave. So, I was worried I wouldn’t be able to shine properly.”",
        "“…That’s not true…”",
        "I…『The Grim Reaper in Love』 isn’t that significant of a person.",
        "Yuuna-chan always shines brightly on her own.",
        "I’m the one who gets courage from her radiance…",
        "“…All right! That’s all for the event report!”",
        "Yuuka clapped her hands loudly.",
        "Then, she spun around to face me.",
        "“『Grim Reaper in Love』-san… No, Yuu-kun. How did I do?”",
        "“Hmm? Well, I think I would’ve loved to come to the event.”",
        "Masa had been sending me Line messages for a while, bragging while saying things like, “Yuuna-hime was so cute…” and “She might be my wife…“. Honestly, it was so annoying and it frustrated me to death.",
        "“Yes, it was very unfortunate, right? I also feel that way too! Is it okay to have this many unfortunate things happen to us? No! It’s not okay!”",
        "Yuuka kept talking with incredible force.",
        "Then, her expression suddenly changed.",
        "She smiled like Yuuna-chan… An invincible smile that’d completely overwhelm anyone who saw it.",
        "“So, Yuu-kun. Let’s reverse all the unfortunate things that happened today!”",
        "◆",
        "Ko-fi"
    ]
}