{
    "id": "chapter-18-ive-been-invited-to-go-out-by-the-class-extrovert-but-how-do-i-turn-her-down-2-2",
    "title": "Chapter 18: I’ve been invited to go out by the class extrovert, but how do I turn her down? (2/2)",
    "content": [
        "I reflexively turned as I heard the sound of a cold voice coming from behind me.",
        "There, I saw Yuuka’s eyes beneath her glasses, looking sharp and tense.",
        "Her ponytail was swaying as she stared at me.",
        "“W-Watanae-san?”",
        "“I’m also going.”",
        "Yuuka said forcefully with the kind of intensity that implied she wasn’t going to take a no for an answer.",
        "Normally, I’m pretty sure Yuuka wouldn’t join a group full of extroverts like this one.",
        "I don’t know why, but for some reason, she had a ghastly look on her face as she joined us on the way to karaoke.",
        "Yeah. No matter how I look at this, she’s being extremely suspicious.",
        "“H-hey, hey! Yuuichi, what the hell is going on?!”",
        "Masa shook me by the shoulders.",
        "I broke out in a cold sweat as I desperately tried to think of an excuse.",
        "Meanwhile, Nihara-san stared at Yuuka with a suspicious look on her face.",
        "“Umm… what’s wrong, Watanae-san?”",
        "Oh no, I definitely can’t leave this one to Yuuka.I hurriedly tried to help her out in a panic.",
        "“Um… Ah! Maybe Watanae-san also likes karaoke?”",
        "Okay, Yuuka. Let’s make it look like you really like karaoke.",
        "That way, everyone won’t suspect that you just followed us because I was going.",
        "“No. I don’t really like karaoke that much.”",
        "Great, you missed my point!",
        "“Hm? You don’t like karaoke that much, but you’re coming along anyways?”",
        "“Yes.”",
        "Yuuka had a cold, expressionless tone as she answered Nihara-san’s question.",
        "“Ahhh… I see! Watanae-san also wants to deepen her friendship with everyone, right? I mean, what a coincidence! Masa and I were trying to do the same thing as well!”",
        "I know my acting skills are terrible, as my tone was completely monotonous, but still, I tried my best to send Yuuka a message.",
        "Okay, Yuuka. Let’s make it look like you’re trying to join our group of friends.",
        "That way, no one will suspect that you just followed us because I was going.",
        "“No. I only came along because Sakata-kun was going.”",
        "Great, you just self-destructed!",
        "“Eh? What does that mean?”",
        "“Watanae-san, were you that close with Sakata-kun?”",
        "“Hey, what does this mean, Yuuichi?!”",
        "Everyone instantly went into an uproar.",
        "And while all this was happening, Yuuka was just standing completely still with a very stiff expression on her face.",
        "Ah… this is bad. Yuuka is so nervous, she can’t think straight at all.",
        "Reaching a point of resignation, I let out a deep sigh.",
        "As the atmosphere around us had become complicated, suddenly…",
        "“Watanae-san… are you for real?”",
        "Nihara-san’s eyes sparkled as she squeezed Yuuka’s hand.",
        "Then she clung to Yuuka’s body happily.",
        "“Oh my god, I’m so happy I can hang out with you! I mean, we’ve never talked to each other outside of class, right? That’s why I’ve always wanted to hang out with you!”",
        "“S-sure.”",
        "Nihara-san’s aggressive approach as an extroverted gyaru made Yuuka flinch a bit, but…",
        "Yuuka looked like she had made up her mind, as she nodded her head.",
        "“I’m also going to karaoke.”",
        "Nihara-san cheered at Yuuka’s declaration.",
        "It looks like this inspired the others too, as they started getting excited.",
        "“Err… what kind of development is this?”",
        "Masa looked puzzled as he tilted his head to the side, but I ignored him and hurriedly whispered to Yuuka.",
        "“…What are you trying to do, Yuuka?”",
        "“…I also want to hang out with Yuu-kun.”",
        "“…Everyone will get suspicious if you try to force yourself like this, you know?”",
        "“…I also want to hang out together with Yuu-kun. Isn’t it unfair if everyone else gets to hang out with Yuu-kun except for me..?”",
        "Maybe she didn’t like the way I said it since she puffed her cheeks out.",
        "Then her cheeks turned red and she glared up at me with upturned eyes.",
        "No, your expression! That expression is not okay!",
        "That’s definitely the expression you make at home!",
        "“Mmm? What’s wrong, Sakata?”",
        "“N-Nothing! I was just talking to Watanae-san about how I was looking forward to the karaoke!”",
        "I quickly thought of an excuse as I replied to Nihara-san.",
        "Yuuka was hiding behind me.",
        "Then, she said in a tiny voice:",
        "“This is the first time I’m going to karaoke with Yuu-kun. I’m looking forward to it.”",
        "Once again, her expression was that of her true self as she faintly smiled at me.",
        "Like I said!",
        "You’re not being cautious enough!",
        "Yuuka’s trait of being an airhead kept making me worried and anxious.",
        "Is this going to turn into a disastrous karaoke event..?",
        "◆",
        "Last one for today! 2 more coming out tomorrow!"
    ]
}