{
    "id": "chapter-17-ive-been-invited-to-go-out-by-the-class-extrovert-but-how-do-i-turn-her-down-1-2",
    "title": "Chapter 17: I’ve been invited to go out by the class extrovert, but how do I turn her down? (1/2)",
    "content": [
        "“Ehehe~ Walking to school with Yuu-kun again~”",
        "A few minutes ago, Yuuka was smiling like a kitten, saying those words softly.",
        "“Morning, huh.”",
        "Right now, Yuuka had a robot-like, expressionless face as she said those words coldly.",
        "As usual, the Yuuka at home and the Yuuka at school are 2 very different beings.",
        "She feels like a completely different person. In fact, why did her school version choose such weird words like, “Morning, huh.” Shouldn’t it be  “Good morning!” or something like that?",
        "“Watanae-san is really scary as usual, huh?”",
        "Masa whispered to me from his seat beside me.",
        "Well, he’d be right, if he was judging from her school version alone.",
        "Such an unsociable and cold girl at school becomes an incredibly cheerful and innocent girl at home.",
        "Normally… no one would be able to imagine that.",
        "“Okay, everyone. Back to your seats, back to your seats!”",
        "As I was idly thinking such thoughts, the door to our class suddenly opened, and Gousaki-sensei entered the classroom.",
        "Gousaki Atsuko. 29 years old. Single.",
        "He’s the homeroom teacher for our class, class 2A. He’s also a little stiff and cold at times.",
        "“Why is everyone so lifeless today?! Come on, you can shout louder than that! If you’re so lifeless during morning homeroom, then your whole day will be dull and boring!”",
        "“He’s really going all in today, just as usual. Right, Yuuichi?”",
        "“Yeah…”",
        "By the way, I don’t really like Gousaki-sensei.",
        "He’s not a bad teacher, but his personality is way too different from mine.",
        "Things like ‘Team play’ and ‘Solidarity’ are too much for an antisocial person like me.",
        "“Be lively and have fun together! Of course, studying is important too, but more than that, you have to find something more precious, ‘friends’. If you do, your lives will be much richer!”",
        "I stared coldly at Gousaki-sensei, whose eyes were shining brightly.",
        "I don’t mind the fact that he cares about his friends and colleagues.",
        "It’s just that, the world he’s in is completely different from mine.",
        "“Heey! Sakata?”",
        "There was a girl with brown hair looking back at me from a seat diagonally in front of me and smiling.",
        "That girl was Nihara Momono… the extroverted gyaru.",
        "“Sakataa. Just now, you were probably thinking something like ‘He’s in a completely different world from mine’, right?”",
        "“Are you an esper or something, Nihara-san?”",
        "What the heck? Do gyarus have the ability to read people’s minds?",
        "“I mean, you’re a pretty easy person to understand. Your facial expressions give me a general idea of what you’re thinking.”",
        "“Ahh… that’s true. Yuuichi’s expressions usually reflect his feelings.”",
        "Masa grinned as he joined in our conversation.",
        "“Yeah, yeah! His expressions accurately reflect his feelings, don’t they? He’s like a child, so cute~”",
        "Nihara bent forward and laughed hysterically.",
        "When she bends like that, I can catch a glimpse of her chest through her blazer. It’s basically poison to my eyes.",
        "“Hey, hey, Sakata. How about we follow Gousaki’s advice once in a while?”",
        "“What do you mean..?”",
        "“What I mean is…”",
        "Nihara-san grinned at me.",
        "Her red lips were somewhat charming.",
        "Even a person like me would unconsciously get a little nervous.",
        "Nihara-san slowly pointed her finger at me.",
        "“How about… after school… today? ☆”",
        "◆",
        "“And so! Today we have a guest coming with us to karaoke, Sakata! Kurai too!”",
        "“Why did you mention me like a bonus or extra?!”",
        "Nihara-san clapped her hands and laughed, as Masa retorted at her.",
        "We were surrounded by about 7 classmates, a mix of both girls and boys.",
        "Honestly, I don’t even know their names because I’m not usually involved with them.",
        "“Even though Sakata looks like this, he’s a pretty funny person! It’s okay if he joins us, right? Yeah!”",
        "“Nobody said anything though!”",
        "I quickly retorted at Nihara-san, but everyone around us just laughed wrily.",
        "Wait a minute, wait a minute.",
        "Someone, please! Stop Nihara-san! And please kick us out while you’re at it!",
        "“Well… If Momono says so… right?”",
        "A girl with short-cut hair, whose name I don’t even know, scratched her cheek.",
        "“Well, even if I said anything, Momo wouldn’t listen to me anyway, right?”",
        "“Yeah, she’d just do what she always does.”",
        "“But Kuramasa is a bit of an issue…”",
        "“Hey! I can hear you! Also, don’t call me Kuramasa!”",
        "Kurai Masaharu, or simply Kuramasa.",
        "『Kurai』sounds just like『Dark』, so he doesn’t really like that nickname.",
        "【TLN: His name, Kurai, is read the same way as dark or darkness. Kuramasa might sound like Dark Masa, so he doesn’t like it, I guess.】",
        "…Wait, why am I even talking about Masa right now?!",
        "“Okay, so that’s that! Let’s enjoy our karaoke after school together! ☆”",
        "I could hear everyone clapping quite loudly.",
        "Eh? Why is everyone accepting this situation so easily?",
        "Incredible… so this is how adaptable extroverts really are.",
        "“Wait, wait! Nihara-san, I’m not really good at this kind of thing-”",
        "“Didn’t Gousaki-sensei tell us earlier? That we should try and get more friends?”",
        "I kept trying to politely refuse her offer, but Nihara-san was persistent and wouldn’t back down.",
        "The mood gradually turned into a welcoming and receptive mood.",
        "Oh no… This is really bad…",
        "*ring ring ♪*",
        "“Ah, Nihara-san! Wait a minute!”",
        "I hurriedly took out my phone and made sure Nihara-san couldn’t see the screen as I quickly opened Line.",
        "Sure enough, there were messages from Yuuka.",
        "『You look like you’re having fun. How nice… I also want to talk with Yuu-kun. Buu~』",
        "『Karaoke? Is that what they’re saying? Hmmm~ Are you going to karaoke, Yuu-kun?』",
        "『Buu~ Buubuu~』",
        "【TLN: Imagine the cutest and holiest pout】",
        "“Eh? What are you doing? You’re acting suspicious, you know?”",
        "I hurriedly put my phone back in my pocket as Nihara-san peeked at the screen.",
        "“I-I’m not acting suspicious or anything! I was just checking if my schedule is free…”",
        "“Ooh! You’re interested in going now? That’s great, that’s great! You must be free, right? Then, let’s go karaoke now!”",
        "Ah… I can’t turn her down anymore.",
        "Having no other choice, I nodded my head.",
        "It’s not like I want to go. I don’t want to put Yuuka in a bad mood, so honestly, I’d really love to refuse her offer and just head home.",
        "Gousaki-sensei… you said too much back there.",
        "I sighed as I tried to keep up with the group…",
        "“…Wait.”",
        "◆",
        "1 more chapter coming out."
    ]
}