{
    "id": "chapter-5",
    "title": "[Alice Stage #6] Ranmu, A Character Who Is Just Cool And Beautiful",
    "content": [
        "『Hey, Yuuichi. Today…doesn’t it feel like everyone in the world could be a fan of Ranmu-sama? 』",
        "I don’t.",
        "RINE—a communication application that allows users to exchange messages and make calls for free.",
        "Masa’s message that was sent through it could only be described as unintelligible.",
        "Today, the unveiling event of “The Eight Alices” will be streamed online.",
        "Masa was a local participant in the event, so I knew that his excitement level was crazy…but there are definitely other fans besides him for Ranmu-chan. It was normal.",
        "“Yuu-kun, why are you making such a difficult face?”",
        "“Oh, no. It’s nothing.”",
        "I was staring at the screen of my phone, but the voice called me back to reality and I looked up.",
        "The person peeking at me from the side was — yes, a suspicious person.",
        "A mysterious girl wearing sunglasses, a mask, and a knit cap.",
        "Even though it was summer, she was wearing a long black coat.",
        "If she had a thick voice, I would have reported her to the police immediately, but her voice was that of a beautiful, pure woman.",
        "Or rather, the familiar voice of my forgiving fiancée.",
        "That’s right. Frankly, this suspicious person was — undoubtedly, Yuuka.",
        "“…Yuuka. Isn’t that going to make you stand out more?”",
        "“Really? But if I dress this way, then they won’t know that I’m Watanae Yuuka or Izumi Yuuna, right?”",
        "“Well, they won’t know but…”",
        "Yuuka won’t be joining them on stage today, but she’s been invited to the officials’ table.",
        "She took great care to avoid being exposed by bumping into Masa at the scene, who had won the privilege of sitting at the bleachers.",
        "It was quite suspicious…well it was better than being exposed.",
        "By the way, the lottery for the bleachers was won by the fans who voted for “The Eight Alices”.",
        "Since I voted for Yuuna-chan…well at that point I had no choice but to watch the broadcast.",
        "Gee, I’m not sad at all about that.",
        "“Haha…Anyway, Ranmu-senpai is amazing, isn’t she? She made her debut only a few years ago, but she has already gained so much popularity to be on such a big stage!”",
        "“Cool and beautiful characters are always popular. It’s not that Yuuna was defeated in her efforts, it’s just that Ranmu was the one whose characterization stuck with the majority of otaku…”",
        "I’m a fan of Yuuna-chan, so I unconsciously started to defend her.",
        "When Yuuka saw me like that, she smiled…I think she was laughing.",
        "She was wearing a mask, so I really couldn’t tell.",
        "“It’s not just that. I know because I work in the same agency as her… Ranmu-senpai, Shinomiya-san, is a voice actor who works incredibly hard. Even Hotta says, ‘I’ve never seen a voice actor as stoic as Ranmu before.’”",
        "Yuuka used to collaborate with Hotta and Ranmu-chan, who played Shinomiya Ranmu, on internet radio.",
        "These two are the senior members of the same agency as Izumi Yuuna.",
        "Shinomiya Ranmu was one of the fledgling voice actors who debuted not too far away from Izumi Yuuna.",
        "It was true that her voice acting and singing skills are remarkable, but…",
        "From my point of view, Izumi Yuuna has put in a lot more effort.",
        "“She’s like a swan, you know? Ranmu-senpai.”",
        "Yuuka’s eyes shone as she admired her…or it was just my hunch that she did.",
        "I don’t actually know because she’s wearing sunglasses.",
        "“She does her best to pour her blood, sweat and tears into her work when the fans aren’t around. But, of course, she would never let her fans know that. In front of everyone…she’s a graceful and beautiful swan. That’s the voice actress, Shinomiya Ranmu .”",
        "I stared at Yuuka as she spoke.",
        "“Yuu-kun? Why are you staring at me like that?”",
        "“No. I was just thinking that Yuuka has that look on her face when she talks about her senpai.”",
        "I couldn’t see clearly, though, thanks to her mask and sunglasses.",
        "It was like a mixture of emotions— admiration, respect, and the feeling that I can’t lose.",
        "I don’t know…I guess it’s the mentality of ‘I’m a “voice actor” after all’, or something like that.",
        "“Well then, Yuu-kun, I better get going.”",
        "Yuuka glanced at her watch and straightened the collar of her coat.",
        "“Have a good day, Yuuka.”",
        "“I’m off, Yuu-kun…Don’t go having an affair with another Alice idol, just because I won’t be able to see you, okay?”",
        "“That’s a silly question. It’s impossible for me, the “Grim Reaper in Love,” to lose my eyes for anyone other than Yuuna-chan, even if the heavens and earth were turned upside down.”",
        "When I replied with a straight face, Yuuka laughed “Ahaha.”",
        "Going for another Alice Idol was actually impossible for me.",
        "That’s how much Yuuna-chan meant to me…the one and only goddess.",
        "『Hey, Yuuichi. I can’t stop shaking…』",
        "As the event was about to start, Masa sent me a RINE.",
        "『What time did you go to the venue?』",
        "『I was so excited about Ranmu-sama’s event that I couldn’t even sleep at all last night and so I arrived at the venue seven hours early!』",
        "『…You’ve got a lot of energy, man.』",
        "There was no merch being sold today, though.",
        "Well, even if they did sell merch, there would probably be very few Yuuna-chan related merch.",
        "In cases like these, whenever I see a popular character, I think, “Gnnn…”",
        "Quickly, the screen switched to show the stage.",
        "“‘Love Idol Dream! Alice Stage ☆’ — ‘The Eight Alices’ unveiling event, good afternoon, Alice!!”",
        "As soon as the announcer announced the start of the event, a tremendous cheer went up.",
        "The selected Alice idols went up on stage in turn, and after a short animation was played, they performed short versions of their songs — a tear-jerking event for the fans.",
        "The Alice idols were called out in order of 8th place, 7th place, and finally 6th place.",
        "Masa’s turn to cheer came.",
        "“And now, ‘The Eight Alices’ — let me introduce you to the third one! The one who was chosen is always calm and collected. The cool and beautiful Alice Idol diva…Ranmu-chan!”",
        "“Whoooaaaaaa! RANMU-SAMAAAAAAA!!!”",
        "I felt like I could hear Masa’s voice even though it was being broadcast over the Internet.",
        "And then—",
        "“‘The Eight Alices’? The result was obvious. Who do you think I am?”",
        "Thundering cheers echoed from the other side of the screen.",
        "The amount of excitement was a testament to her popularity.",
        "Then, on the stage — she appeared.",
        "“Enjoy yourselves this evening. This Ranmu-sama will show you a dream that you will never wake up from—Hello Alice. I’m Shinomiya Ranmu, playing the role of Ranmu.”",
        "She said in a matter-of-fact tone and smiled.",
        "Long purple hair that reached her waist.",
        "She was wearing a sleeveless dress with frills.",
        "A wristband that extended down her arms.",
        "The red choker around her neck stood out against her all-purple outfit.",
        "Shinomiya Ranmu flipped up her eye-piercing, open-chested stage costume, picked up a microphone, and spoke to the audience.",
        "“I am very honored to have been selected for ‘The Eight Alices’. However, I’m not satisfied yet. The reason for this is simple. There are still five Alice idols above me.”",
        "The voice, which seemed to be calm but somehow filled with passion, had an aura that could engulf all who heard it.",
        "“Sooner or later, I will be at the top of the Eight Alices. That’s what I, Ranmu, promise. Ranmu will surely become the best Alice idol. All you have to do is wait for that moment and look forward to it.”",
        "For a moment, the stage was silent.",
        "Then, there was a storm of cheering, as if an explosion had gone off in the surrounding crowd.",
        "The performance was so outstanding that even I, a fan of Yuuna-chan, could not help but gasp.",
        "“That’s my girl, Ranmu-chan! You are still as cool as ever, and your ambition is amazing!!”",
        "The event moderator shouted to the ever-growing crowd.",
        "And then, poof, Ranmu-chan’s SD character was projected on the large screen.",
        "On either side of them were the SD characters of Yuuna-chan and Deru-chan.",
        "Is this event using animation?",
        "Even though she’s an SD character, I didn’t expect Yuuna-chan to make an appearance.",
        "My excitement was soaring and I couldn’t stop.",
        "『Ranmu-chan! This time, really! Congratulations!!』",
        "『Yuuna-chan, if you lower your head that much, you’ll break your neck, okay? …But, Ranmu-chan. It was a great result this time. It’s like you’ve drilled for oil.』",
        "『No, Deru-chan…drilling for oil sounds like a fluke to me…』",
        "『What are you talking about, Yuuna-chan? Even drilling for oil requires a lot of research, you know. I admire your diligent efforts, Ranmu-chan.』",
        "『No, the oil analogy is a bit…』",
        "『Yuuna, Deru. Thank you, both of you. But you two—are you sure you want to do this?』",
        "『Eh? What do you mean?』",
        "『You and I are both Alice Idols. We are friends in arms who continue to work hard together to reach the top. And yet…this is not the time to be celebrating me, is it?』",
        "『R-Ranmu-chan? I know, but today is a happy day, so…』",
        "『Let’s go, you two. We’re training now. I’m not letting you leave until tonight. I’m going to train you both to catch up with me. Of course, I’ll be—improving as well.』",
        "『『P-Please spare us!?』』",
        "The audience went up in a whirlwind of laughter, as the screen went dark.",
        "I see. The three of them are in the same agency, so that’s why they did this collaboration.",
        "『Yuuichi…today might be the day I die.』",
        "Masa sent me a concerning RINE which left a weird bit of tension, but oh well, I guess it can’t be helped.",
        "If my favorite were to get this much PR, I’d probably die of shock from the excitement.",
        "Being selected as one of “The Eight Alices” was a big deal.",
        "—Well, for me, it doesn’t matter who’s chosen or not.",
        "The fact that I’m devoted to Yuuna-chan will never change.",
        "“So burn it into your minds, my friends. Tonight, I am more composed than usual. It’s warm…because we are lighting this up. Here we go— ‘Ranmu☆Meteor Violet’.”",
        "As if on cue, the spotlights all turned purple and illuminated her entire body in a bewitching way.",
        "At the same time, a fierce beat began to flow.",
        "Shinomiya Ranmu gripped the microphone with both hands and looked down at it.",
        "The aura that overflowed from it was so tremendous that it could not be put into words…",
        "“Thank you for your support. I’m ‘Shinomiya Ranmu’ as Ranmu.”",
        "After bowing deeply, Shinomiya Ranmu left the stage.",
        "The next thing I knew, I was applauding her.",
        "Even though I’m not a fan, Shinomiya Ranmu had a certain charm that overwhelmed me.",
        "—Ranmu-senpai, the voice actor known as Shinomiya Ranmu, was an incredibly hard worker.",
        "—Hotta-san also said, “I’ve never seen a voice actor as stoic as Ranmu before.”",
        "The words that Yuuka had previously said suddenly came to mind.",
        "After a performance like that, I could understand what Yuuka was trying to say.",
        "It was amazing. I don’t know how old she is, but she couldn’t be much older than us…",
        "—Prupru♪",
        "Suddenly, I felt my phone vibrate in my pants pocket.",
        "What popped up on the phone after I took it out was…a RINE from Yuuka.",
        "『Yuu-kun. By any chance, are you gawking at Ranmu-senpai?』",
        "『I know it was an amazing performance…but Yuuna is still the best, so, you know?』",
        "As expected of Yuuka.",
        "She knew all of my excitement and tension points.",
        "As I looked at the message, I found myself naturally smiling.",
        "It was true that I was impressed by Shinomiya Ranmu’s performance.",
        "But I also said that I will never change the fact that I think Yuuna-chan is the best."
    ]
}