{
    "id": "chapter-35-a-game-event-and-a-school-event-overlapped-with-each-other-3-3",
    "title": "Chapter 35: A game event and a school event overlapped with each other (3/3)",
    "content": [
        "“Sensei!”",
        "“Hmm? Oh, Sakata? What’s wrong?”",
        "It’s recess time.",
        "I made sure there wasn’t anyone else around. Then, I called out to Gousaki-sensei.",
        "Gousaki-sensei had a puzzled look on his face.",
        "I’m not really good at talking to teachers like him.",
        "I can’t mess around here.",
        "“Why did you decide on Watanae-san?”",
        "“Ahh… You mean the volunteering work…”",
        "Gousaki-sensei smiled broadly and walked over to me.",
        "Then, he grabbed me by my shoulders.",
        "“I was a bit confused on whether I should’ve sent Sakata or Watanae back there.”",
        "I was a little confused because I didn’t expect my name to come up.",
        "“…Why me and Watanae-san?”",
        "“Because you two are similar.”",
        "Sensei suddenly said something like that.",
        "I felt even more shaken now.",
        "“H-how are we even similar? I’ve barely ever spoken to Watanae-san… and I think we’re very different types of people.”",
        "“It’s true that both of you are different types of people. But at the same time, there are some parts of both of you that are very similar.”",
        "“…What do you mean?”",
        "I was getting more and more annoyed with Gousaki-sensei, who kept talking like a philosopher.",
        "I don’t know if he knows how I’m feeling right now or not.",
        "Gousaki-sensei just raised his index finger proudly as he continued speaking.",
        "“Sakata, you’re a friendly and kind person, but other than Kurai, you aren’t well acquainted with anyone else in the class, right? Watanae is really bad at communicating with others, and her sense of distance with other people isn’t really good. You know, I believe that communicating with people is the most important part of becoming an adult. That’s why when I see you two… I get worried.”",
        "Sensei’s observation, which was spot on, shocked me.",
        "I thought he was just an enthusiastic and overexcited teacher.",
        "I would’ve never imagined that he’d be able to notice even the smallest details about his students.",
        "“Watanae is too stiff when she talks to other people. If this goes on, I think she’ll definitely have a hard time in life.”",
        "“B-but Watanae-san is..!”",
        "As Yuuna-chan, she can talk a whole lot with other people!",
        "I want to tell him. But I can’t.",
        "This is a secret between me and Yuuka.",
        "“But..?”",
        "“No… nevermind.”",
        "“In my class, there are two people who aren’t good at communicating with others. Watanae and… Sakata. As your teacher, I want both of you to discover how much fun school can be.”",
        "I knew what Sensei was trying to say.",
        "I know he’s worried about us.",
        "But at the same time, I also felt annoyed.",
        "When my dad divorced my mom, I stopped dreaming of marriage.",
        "When I experienced a painful heartbreak in middle school, I decided I’d devote myself entirely to the 2D world.",
        "And just like me, I’m sure… Yuuka also has something in her past.",
        "Each person has something they’re carrying inside them, be it a light burden or a heavy burden.",
        "Each person has their own way of life.",
        "That’s why I don’t agree with Gousaki-sensei’s view that everyone is the same.",
        "“A school should be a place where students can enjoy themselves the most… Is that not okay?”",
        "I bit my lip and squeezed those words out",
        "Then, I glared at Sensei…",
        "“Gousaki-sensei, Sakata-kun.”",
        "At that very moment.",
        "Yuuka flipped her ponytail and adjusted her glasses.",
        "Then, in her school mode, she slowly approached us.",
        "“Yuu… Watanae-san.”",
        "Yuuka glanced at me.",
        "Unlike how she usually was at home, her face was expressionless, but… it was as if she was trying to say “Thank you” to me.",
        "That’s the kind of impression I got from her.",
        "“… Sensei, I heard your conversation earlier. You wanted me to… gain more social experience, right?”",
        "“Exactly! It should be easier to build relationships with preschool students than with people your own age! You see, with this volunteering task, I want Watanae to… become a girl who can laugh along with everyone else.”",
        "“… I see.”",
        "Yuuka suddenly dropped her gaze.",
        "She seemed to waver as her eyes were, just slightly, teary and moist.",
        "“Ok, Sensei. I’ll do it.”",
        "… Gaining social experience?",
        "Yuuka is Izumi Yuuna, you know?",
        "She’s been working way harder than any of us.",
        "She brings a smile to many of her fans.",
        "Laugh along with everyone else, you say?",
        "Yuuka is always smiling in front of me.",
        "Even when she’s acting as Yuuna, she always sounds like she’s having fun.",
        "She’s always laughing and smiling… with so many of her fans.",
        "But. just because of the school’s expectations and constraints, they scolded Watanae Yuuka.",
        "If they’re going to shove her into a conventional cage and deprive her of her precious time, then…",
        "Helping your wife when she’s in a predicament like that…",
        "…is the role of the husband, right?",
        "“Sensei.”",
        "I stepped in front of Yuuka and bluntly told Sensei.",
        "“I’ll do it. I’ll volunteer at the preschool.”",
        "Yuuka’s eyes widened.",
        "Gousaki-sensei also looked at me, trying to guess what my intentions were.",
        "“Sakata. What do you mean?”",
        "“Sensei, you said that I also had some communication issues, right? If that’s the case, let me try first. Or is there a reason why I can’t do it?”",
        "I boldly spoke up to Sensei.",
        "I’m not sure how Gousaki-sensei saw my attitude, but he just smiled happily.",
        "“Okay then. The volunteer work in 2 weeks will not be done by Watanae, but you, Sakata. You’ll be the one to go!”",
        "◆",
        "“I’m sorry, Yuu-kun. You did that for me…”",
        "After Gousaki-sensei walked away, Yuuka bowed her head apologetically.",
        "“If I had fit in better with everyone else, Gousaki-sensei wouldn’t have said those things to me…”",
        "“If you had fit in better with the class, I’m sure that you and I wouldn’t have become fiances.”",
        "I jokingly said that to Yuuka.",
        "“Yuuna-chan has always been there for me, and I haven’t been able to repay the favor. This is the least I can do for you.”",
        "“Yuu-kun…”",
        "“Oi, Sakata and Watanae! What’re you guys doing?”",
        "As we were having our conversation, Nihara-san suddenly appeared from out of nowhere.",
        "“N-Nihara-san?”",
        "“It’s unusual for the two of you to be talking to each other, you know? What are you guys talking about?”",
        "Nihara-san then took a close look at Yuuka’s expression.",
        "Oh no… Is she going to find out about our relationship?",
        "“… Nothing much? Sakata-kun just told me that he wanted to replace me as the volunteer. That’s all.”",
        "It was as if Yuuka’s tearful expression earlier was a lie.",
        "Yuuka returned to her usual expressionless face as she indifferently conversed with Nihara-san.",
        "“Mmm? Sakata’s doing it? The volunteer work?”",
        "“Yes. He said he wanted to.”",
        "Then, Yuuka just turned around and left us.",
        "“Hey, Sakata. Doesn’t Watanae-san look like she’s in a bad mood?”",
        "“W-who knows…”",
        "Gousaki-sensei said that Yuuka was bad at communication, even though he only knew 1 side of Yuuka",
        "But in fact, the real Yuuka has so many different expressions.",
        "She is always doing her best, interacting with lots of people.",
        "“You want to do volunteer work? Isn’t that unusual for you, Sakata?”",
        "“I guess so… It might be surprising, but I’m actually pretty good at things like this.”",
        "I’m going to support Yuuka from the shadows, because…",
        "That’s my duty as her fiance.",
        "… And, because it’s a way for me to express my love for my beloved Yuuna-chan.",
        "◆",
        "Discord: https://discord.gg/6kFNSeZWHX Poll: https://forms.gle/2onmNMU2cWiLPfaD6 Poll lasts until I finish v1, or on April 11, whichever comes last. 2 arcs left in v1. Next mini-arc is 2 chapters, coming out in… maybe 2 days. Sorry ’bout that.",
        "Ko-fi"
    ]
}