{
    "id": "chapter-7-theyre-going-to-find-out-about-our-engagement-anytime-soon-2-2",
    "title": "Chapter 7: They’re going to find out about our engagement anytime soon (2/2)",
    "content": [
        "As we got closer to school, we made sure to keep our distance from each other.",
        "Then, we entered the classroom just in time before the bell rang.",
        "I glanced at Yuuka-chan to check how she was doing. She was already sitting down in her seat as usual.",
        "“Yo, Yuuichi!”",
        "As soon as I sat down on my seat, my friend Masaharu Kurai called out to me from behind.",
        "His hair, still as messy as ever, was brushing against my shoulder, and it was a little annoying.",
        "“What are you looking at?”",
        "“E-eh? U-uhh…”",
        "Masa’s black glasses seemingly shone for a moment.",
        "“I see… You’re finally able to see Yuuna-hime, right?”",
        "“…Huh?”",
        "I mean, it’s true that I can see Yuuna-chan’s voice actor now.",
        "But, I don’t think that is what Masa is trying to say.",
        "“You love Yuuna-hime so much, you can even delude yourself into thinking she’s in the classroom. Yes… because Yuna-hime is already burned into your retina!”",
        "“How are you saying all these things without getting embarrassed…”",
        "“I understand how you feel, Yuuichi! You’ve become my comrade too! I can see Ranmu-sama here too! In fact, I can see everyone in the class as Ranmu-sama!”",
        "“You need to go to the hospital, right now.”",
        "While having this ridiculous conversation with Masa, I turned my attention to Yuuka-chan.",
        "I wonder what she’s like at school.",
        "I haven’t interacted with her at all until now, so I don’t know.",
        "She did say before that she tries to stay silent as much as possible, but I’m sure she has at least some communication once in a while.",
        "“Watanae-san! Do you have a minute?”“…Yes?”",
        "“You know, the homework yesterday, wasn’t it really difficult? I couldn’t understand the questions at all, y’know? I can’t do it at all~. Did you understand the questions, Watanae-san?”",
        "“Yes.”",
        "“Ooh, impressive! Watanae-san, you’re pretty smart, aren’t you? Soo, can you teach me how to do this question?”",
        "“No.”",
        "“Eeh~? Why not~?”",
        "“I’m not good at teaching.”",
        "“Ah… Okay…”",
        "So stiff!",
        "Her responses are like an AI on a smartphone.",
        "Her intonation is flat and it’s almost like talking to Google Assistant or Siri.",
        "On top of that, her facial expression barely changes.",
        "She said her glasses help her restrain herself, but she’s so restrained she’s basically like a different person.",
        "Yesterday, she looked so happy and excited when we were discussing anime. Where did that Yuuka-chan go?",
        "Actually, I guess this shows that she can change her personality quickly, which is why she’s so good at voice-acting Yuuna-chan.",
        "“Hey, Yuuichi. What kind of face do you see on Yuuna-hime? Is she smiling?”",
        "“I don’t see any Yuuna-chan, you idiot.”",
        "I don’t understand how he said all that with such a serious face.",
        "Anyways, it’d be bad if someone found out I was staring at Yuuka-chan.",
        "I stopped staring at Yuuka-chan and turned my attention to Masa, trying to concentrate on our conversation.",
        "Just as I was about to do so, my phone started vibrating. I saw a notification from Line, which read:",
        "『Yuu-kun, your impression at school is really different, huh? I think you look cool when you’re like this~!』",
        "“Pfft?!”",
        "“Mmm? What’s wrong, Yuuichi?”",
        "“Ah, no… it’s nothing.”",
        "I couldn’t help that reaction… I quickly pulled myself together.",
        "I slowly looked up.",
        "And what I saw… was Watanae-san, staring at me with her sharp eyes and a blank look on her face.",
        "I can tell she’s just staring at me as usual. But if a stranger did this to me, I’d be terrified.",
        "“Mmm? Isn’t Watanae-san looking at us?”",
        "“Eh? R-really?”",
        "Oi, Masa’s going to get suspicious!",
        "In a panic, I blinked my eyes quickly, trying to make eye contact with Yuuka-chan.",
        "Then, my phone vibrated.",
        "“Why are you blinking your eyes so much? Are you ok? Do you need eye drops?”",
        "No! That’s not my point!",
        "“O-oi, Yuuichi! For some reason, her expression just soured! It’s making me feel really uneasy…”",
        "I quickly looked up from my screen.",
        "Then, I saw a dark haze behind Yuuka-chan.",
        "【TLN: This line baffles me. It might be something like this, but I’m not completely sure.】",
        "I’m just guessing here… but maybe she’s worried about my eyes?",
        "But wow… if someone saw her expression right now, they’d think she was about to murder someone.",
        "I have to make sure Masa doesn’t find out about us. I sent her a message on Line, making it as direct as possible.",
        "『Looking is bad.』",
        "Then, another notification came in.",
        "『Eh?! Your eyesight is bad?! Isn’t that an eye disease?! You have to go to the hospital!』",
        "【TLN: A joke lost in translation. Tried my best but I just can’t think of an equivalent in English. Here’s an oversimplified explanation: He said あんま見ない, where あんま can mean ‘too much’ or ‘not much’. Then, he used 見ない which basically can mean ‘not look’ or ‘can’t look’. So, put both of the alternative meanings together, and you get ‘can’t look very much’.】",
        "No! You’re still not getting my point!",
        "“Sakata-kun.”",
        "While I was still getting anxious at her misunderstanding, Yuuka-chan had moved right beside me before I knew it.",
        "Masa had a curious look in his eyes as he watched us.",
        "Ah… our engagement is going to be exposed this soon… it’s all over…",
        "Are they going to draw those love umbrellas with our names under it?",
        "Or maybe, if I make a remark during class, are they going to just whistle annoyingly or something like that?",
        "While I was thinking all these depressing thoughts, Yuuka-chan came up to me and told me in a decisive tone.",
        "“You should go to the hospital.”",
        "The air around me froze in an instant.",
        "Yuuka-chan then turned around and went back to her seat.",
        "“O-Oi, Yuuichi. Did you do something to Watanae-san?”",
        "“N-no… I didn’t do anything.”",
        "“You say that, but she’s telling you to go to the hospital! Isn’t she really angry at you? You must be crazy! Are you cursed to be hated by all 3D people?”",
        "“None of your business.”",
        "As I was arguing with Masa, my phone vibrated in my hand. Looks like there’s a notification from Line.",
        "『I’m worried, you know? You should go to the eye doctor as soon as possible. Do you want me to go with you?』",
        "I quickly sent her a message telling her I’m just fine.",
        "“Youichi, why are you casually playing with your phone? That’s what I’m talking about!”",
        "“What do you even mean…”",
        "I slowly put my phone in my pocket and sighed.",
        "I guess it’s exactly as Yuuka-chan said…",
        "Whether she talks too much or too little, she definitely has problems communicating with other people.",
        "I guess she genuinely wanted to express her concern for me.",
        "But everyone else definitely thinks she’s verbally abusing me, asking me to get my head checked at the hospital.",
        "Well, they didn’t find out that we were engaged to each other, so I guess it’s alright.",
        "Our classmates probably see Watanae Yuuka as an unapproachable and stiff person.",
        "But, only I know.",
        "Only I know that Watanae-san actually has an extroverted side.",
        "Only I know that she’s Izumi Yuuna, the voice actor for Yuuna-chan.",
        "And… Only I know how Yuuka-chan really is when she’s at home.",
        "I know them all.",
        "And, I’m the only one who knows…",
        "I glanced at Yuuka-chan.",
        "She still had her blank expression, but… just for a moment, she smiled at me.",
        "I’m sure no one else noticed Yuuna-chan’s expression just now.",
        "And the thought of that… made me a little happy.",
        "“Oi Yuuichi! You’re looking at Watanae-san again? You really need to stop doing that, seriously.”",
        "I take that back.",
        "Dealing with you really is difficult. Please restrain yourself, Yuuka-chan. I’m begging you.",
        "◆",
        "So, another double release. Again, I kinda rushed this, so any corrections or suggestions are welcome. I keep speeding through these chapters, and it’s beginning to look like quantity > quality. And, translating too much takes up lots of my time, and I do have some other projects I’m working on. So, for the time being, I’m gonna try and reduce my release frequency to 3 chapters every week. I might release 3+ chapters if they’re short, but that depends. I was motivated to release 1 chapter every day, but I feel like even now, my chapters are kinda bad. If I was reading this, I’d rate this translation a 5/10. Probably 5+ errors you can spot if you look really hard. So, I’m going to try and keep my releases a little more spaced so I can work on each individual chapter for longer, and (hopefully) make them a little more readable for you. Next chapter might be 2-3 days. Sorry, and have a good day!"
    ]
}