{
    "id": "chapter-21-my-little-sister-asked-me-if-id-already-graduated-from-my-virginity-how-should-i-object-here-1-2",
    "title": "Chapter 21: My little sister asked me if I’d already graduated from my virginity. How should I object here? (1/2)",
    "content": [
        "It’s the first day of Golden Week. I was alone, sitting in a daze with my computer on.",
        "Yuuka left the house early in the morning, saying, “I have to head out for the online radio!”",
        "Izumi Yuuna. A new voice actor who got selected last year for a major position in the newly released 『Love Idol Dream! Alice Stage☆』.",
        "So far, other than her role as Yuuna-chan, she’s only voiced side characters, but…",
        "I know… that she has great potential.",
        "Because, Izumi Yuuna is the one and only voice actress who breathed life into the angel called Yuuna-chan.",
        "『A haunted house? I’m not scared at all, you know? Eh..? What do you mean, “You’re literally trembling”? No, that’s not it. This is, uh… excitement! I’m trembling with excitement!』",
        "“Fuu…”",
        "I was lying down on my sofa, looping Yuuna-chan’s voice line over and over.",
        "During the Golden Week campaign, I rolled the special gacha, and I managed to get Yuuna-chan’s card.",
        "Of course, it’s a normal card.",
        "But, to me, this card is basically worth an SSSSSSR card.",
        "If I close my eyes, ahh… I can see Yuuna-chan-",
        "「Yuu-kun!」",
        "I quickly got off my sofa.",
        "My heart was beating really fast, as I placed my hand on my chest, trying to calm down.",
        "“Just now… I saw… Yuuka’s face..?”",
        "No, Yuuna-chan’s voice is exactly the same as Yuuka’s voice.",
        "I’m certain that’s the only reason I saw Yuuka’s face just now.",
        "Yuuka and I live together, so we see each other a lot, and it’s become a normal occurrence for me.",
        "But… I never would’ve imagined that I would think of a 3D girl instead of Yuuna.",
        "“…No, Yuuna-chan isn’t Yuuka. They’re 2 different people.”",
        "I kept telling myself that.",
        "Because if I don’t…",
        "I feel like my image of Yuuna-chan and Yuuka will slowly overlap with each other…",
        "*ring ring*",
        "“Woah?!”",
        "My phone started ringing with such perfect timing.",
        "I hurriedly took my phone and answered it.",
        "“Hello.”",
        "『You’re so slow. Nii-san. You should’ve picked up on the first ring.』",
        "The one complaining to me in a sullen mood right now was my sister, Sakata Nayu.",
        "She’s acting so arrogant and rude. It’s been a while since I’ve seen her, but it looks like she hasn’t changed at all.",
        "“You just called me out of nowhere, that’s impossible…”",
        "『Making excuses… haa…』",
        "“No, it isn’t an excuse, okay? Humans have a certain reaction time-”",
        "『Whatever, I don’t care. I’m coming over to the house, nii-san.』",
        "“Huh? You’re coming back to Japan? When are you-”",
        "*ding dong*",
        "『I’ve just arrived, you know?』",
        "“How sudden! You should’ve called sooner!”",
        "“You complain too much.”",
        "I heard that last remark not from my phone, but from behind me.",
        "I turned around nervously.",
        "Short, fluffy black hair. Sharp eyes.",
        "She was dressed roughly, wearing a jacket over her T-shirt and shorts.",
        "Her chest wasn’t conspicuous, so she still looked like a “pretty boy”.",
        "Nayu had her phone in one hand as she looked around the room with a somewhat sour look on her face.",
        "“The room is clean and tidy.”",
        "As soon as she said that, Nayu plopped down on the sofa.",
        "Then, she started playing on her phone.",
        "“Nii-san, cappuccino.”",
        "“We don’t have anything that fancy…”",
        "“Then, get me a peperon.”",
        "“Peperon..? Isn’t that spaghetti?”",
        "“I’m so hungry. For real.”",
        "【TLN: Peperon is short for spaghetti aglio e olio, also known as olio e peperoncino.】",
        "Nayu had her gaze on her phone the whole time.",
        "She’s still being self-conceited, as usual… Well, I guess this isn’t the first time I’ve seen her like this.",
        "I just gave up and started heating up some frozen pasta.",
        "“Frozen food?”",
        "“Do you think I can actually cook?”",
        "“Uwa, you’ve become defiant.”",
        "“So? Why did you come here all of a sudden, Nayu?”",
        "“Hah? Do I need a reason to come home?”",
        "“No, but since you came so suddenly, I thought you must’ve had one.”",
        "“…Yeah, well.”",
        "Nayu placed her phone on her lap.",
        "Then, she propped her elbows on the sofa and sighed.",
        "“Dad was really concerned about your life together with Yuuka. He was so annoying, ugh. He would say things like, 『What if he’s being rude to Yuuka-san?』or 『What if Yuuka-san wants to break up with him?』. Well, I wasn’t really worried though…”",
        "“Why are his concerns all about me messing up..?”",
        "【TLN: If I didn’t make it clear enough, he’s wondering why his father isn’t concerned about Yuuka messing up.】",
        "“Isn’t that a habit of yours? Well, that’s why Dad asked me to come all the way here.”",
        "“I see… Well, I guess that does sound like something Dad would say.”",
        "I just had to sigh here.",
        "Without even a glance at me, Nayu said as if it was obvious:",
        "“Well, whatever. So? How far have you two gone? Have you reproduced?”",
        "“What the hell are you suddenly asking…”",
        "“Shut up. So. have you done it?”",
        "“Of course I haven’t!”",
        "“…Huh, are you serious?”",
        "【TLN: She really did use reproduction here. I don’t think I got it wrong.】",
        "Nayu’s expression, which was sullen since she arrived, softened for the first time.",
        "Then she gave me a sidelong glance.",
        "“B-but, maybe you used a condom for protection? At least you’ve kinda done it?”",
        "“Why are you being so indirect? You’re making it hard to understand! And no! I’ve told you, I haven’t done it yet!”",
        "“Eh… seriously?”",
        "Nayu stared at me incredulously as her jaw dropped.",
        "Stop looking at me like you’re looking at a virgin. Please stop.",
        "“I see. I guess it’s good that your progress with her is going… even slower than I expected..? I guess this is the limit of a person whose age = the number of years they’ve gone without a girlfriend.”",
        "“Stop making fun of my virginity! In fact, aren’t I already living together with a 3D girl in real life? Isn’t that good enough-”",
        "“Then, have you stroked or patted her head?”",
        "“Huh? No, that much is… well…”",
        "“Tch. Then, what about a kiss?”",
        "“Why are you clicking your tongue at me?!”",
        "“Whatever. Just answer with a yes or a no.”",
        "“…No.”",
        "“Fumu. Have you seen her naked?”",
        "“No.”",
        "“Fumu. Have you shown Yuuka-chan your naked body?”",
        "“Wouldn’t that make me a molester?! No! Of course no!”",
        "What the hell is she thinking about our relationship?"
    ]
}