{
    "id": "chapter-14-how-to-sleep-with-your-fiance-and-not-get-aroused",
    "title": "Chapter 14: How to sleep with your fiance and not get aroused",
    "content": [
        "From the first time we met, I knew that our interests were pretty compatible.",
        "Whenever we had free time, Yuka and I would often spend it watching anime together.",
        "“Ah. Look, look! Isn’t this heroine cute?”",
        "“Really? I prefer this senpai character, though.”",
        "“Eh?! The childhood friend is cuter and braver though! I think she’s the kind of girl the protagonist would prefer to get married with!”",
        "“No. She’s a blue-haired childhood friend. Those are losing flags.”",
        "“Mou! Don’t say something so meta!”",
        "【TLN: Not very sure what meta means, apparently it means “referring to itself or to the conventions of its genre”. Basically, he’s talking about the cliches in anime and manga.】",
        "We sat next to each other on the sofa, watching anime and chatting.",
        "When Yuuka is engrossed in anime, she gets really excited.",
        "She tears up during emotional scenes, and she shouts and flails her arms and legs during intense scenes.",
        "She expresses her emotions very well.",
        "I think that’s what makes her a great voice actress.",
        "“Uwaa, it ended on a cliffhanger! I’m so curious now, mou!”",
        "She sighed and before I knew it, she curled herself up on the sofa, grasping her knees.",
        "【TLN: Imagine something like this.】",
        "At school, Yuuka wears glasses and a ponytail, but at home, her impression is completely different.",
        "Her black hair, which she had untied after taking a bath, had reached all the way below her shoulders, and the tips of her hair were puffy.",
        "Her eyes look sharp and slanted when she wears glasses, but when she takes them off, they look rather droopy.",
        "The slender legs peeking out of her nightgown were white and beautiful.",
        "“It was really entertaining, right Yuu-kun?”",
        "Yuuka smiled at me as her legs were squirming about.",
        "Unexpectedly, when she sits like that, she looks really defenseless.",
        "When I almost caught a glimpse inside her skirt… I quickly averted my gaze.",
        "At that moment…",
        "I could see a flash of light through the gap in the curtains.",
        "A few moments later, the sound of thunder echoed through the house.",
        "And then… all the lights in my house went out at once.",
        "◆",
        "“Sorry… Yuu-kun.”",
        "“No, it’s okay…”",
        "What happened after was a huge mess.",
        "Yuuka looked as if she would burst into tears from the thunder and darkness as she clung to me.",
        "Her body was really soft, and I hurriedly tried to pull her away.",
        "But Yuuka, who was already in a state of fear and panic, wouldn’t leave me at all.",
        "And eventually… we got into this situation.",
        "I brought Yuuka’s futon into my room and set it up a distance away from my futon.",
        "“Okay, Yuuka, you can sleep in that futon-”",
        "“No!”",
        "Yuuka hurriedly put her futon together with mine.",
        "The two futons lined up side by side without any gaps.",
        "“No, no. This would definitely be bad, wouldn’t it?”",
        "“But… I’m scared…”",
        "“No, that might be the case, but still… this is definitely not okay, you know?”",
        "When I see Yuuka crying because she’s afraid of the thunder, well… I can understand how she feels.",
        "I guess we’re engaged, and sleeping together is… well, I guess it’s not unthinkable.",
        "My instincts are telling me that this is a bad idea.",
        "Even though I’m now living with Yuuka, I’m still not comfortable with the idea of falling in love with a three-dimensional girl.",
        "Even if she’s her voice actress… Yuuna and Yuuka are still 2 different people.",
        "I’m still afraid of hurting others or being hurt by having strange expectations.",
        "…But",
        "Sleeping together in such a defenseless way is a different matter.",
        "It’s not a matter of being scared or not. It’s a completely different level of stimulation.",
        "“Yuu-kun… I’m begging you…”",
        "Yuuka didn’t seem to notice my distress as she had tears in her eyes, grabbing the hem of my shirt.",
        "“I’m scared… Please sleep next to me…”",
        "There was a flash of lightning outside the window and a roar of thunder.",
        "Yuuka let out a small scream and crawled all the way under the futon.",
        "Then, she suddenly poked her head out and peeked at me through the covers.",
        "“I get it… I’ll sleep together with you…”",
        "“…Thank you…”",
        "I got under the covers and quickly turned my head in the opposite direction of Yuuka and shut my eyes.",
        "I don’t want to look at Yuuka at all…",
        "Because, if I get conscious of the fact that I’m sleeping with our futons lined up together, in a room that’s completely dark… I definitely won’t be able to stay calm.",
        "“……”",
        "I could hear rustling from the futon next to me.",
        "The room was completely silent.",
        "…Is Yuuka asleep?",
        "I slowly turned my head and looked at Yuuka.",
        "“Ah.”",
        "“Ah.”",
        "My eyes met Yuuka’s, who was just sticking her face out of the futon.",
        "The moment our gazes met, Yuuka swooped down and dove under the covers.",
        "“*glance*”",
        "I quietly muttered, and Yuuka peeked her head out again. Then, of course, her eyes met mine.",
        "“Kyaa…”",
        "Yuuka crawled back into her futon.",
        "“*glance*”",
        "Again, she peeked her head out, and our eyes met.",
        "“Kyaa…”",
        "She shuffled back into her futon.",
        "“*glance*”",
        "“*peek*”",
        "“Kyaa…”",
        "…No, no, no, no! Let’s not keep doing this, okay?",
        "If you do that, I won’t be able to stop my heart from pounding. Seriously.",
        "“…Hey, Yuu-kun.”",
        "Yuuka, with only half of her face peeking out, looks up at me.",
        "【TLN: Again, imagine something like this.】",
        "Her moist eyes were very sexy… I quickly shut my eyes.",
        "“Ah! You’re pretending to be asleep, aren’t you?”",
        "Yuuka complained, but I was determined not to open my eyes.",
        "With firm determination, I focused my attention on trying to sleep.",
        "“Mou… Yuu-kun, you baka.”",
        "I could hear Yuuka let out a deep sigh.",
        "Then, I heard a quiet mutter from her.",
        "“Even though I’ve already… prepared myself.”",
        "Those words made me reflexively sit straight on my futon.",
        "Next to me was Yuuka, her mouth hidden under her futon.",
        "Her eyes were as moist as ever, and her face was bright red.",
        "“What do you mean… prepare?”",
        "“You shouldn’t ask those kinds of things to girls… baka”",
        "Yuuka’s shoulders were shaking a bit.",
        "She looked so fleeting and fragile as I stared at her.",
        "…I instantly felt something inside of me burst open.",
        "Before I knew it, I couldn’t hear the rain from outside.",
        "The thunder and lightning had completely subsided as well.",
        "So there’s no reason for us to be sleeping in the same room… anymore.",
        "But.",
        "No… should I say, precisely because of this…",
        "I slowly crawled out of my futon.",
        "I closed the distance between me and Yuuka.",
        "And so.",
        "This is how our long night began.",
        "◆",
        "Just yesterday, I posted my Ko-fi link. And the way I was thinking was something like, “Maybe I’ll get a dollar every month?”. So, you have no idea how surprising it was to get a $4 donation the very next day. So, it looks like I’m going to be releasing 15-16 chapters for the next week. You have ShadowKnight3000 to thank for this. I’ll try to get 3 chapters/day, so 2 more chapters today. Also, the onomatopoeia was a little tricky to translate into English, so gimme some suggestions if they sound weird."
    ]
}