{
    "id": "chapter-33-a-game-event-and-a-school-event-overlapped-with-each-other-1-3",
    "title": "Chapter 33: A game event and a school event overlapped with each other (1/3) - Volume 1 Short Story",
    "content": [
        "“Fufu, fufun… ♪”",
        "I was relaxing in the living room when Yuuka came out of her room in a good mood, humming and singing.",
        "She was holding an outfit I had never seen before.",
        "Then, she waved it in front of me, emphasizing how frilly and fluttery it was.",
        "It’s like she’s just waiting for me to retort at her.",
        "“Yuu-kun, here’s a question! What do you think this is?”",
        "“Some clothes you bought recently?”",
        "“Bzzt! Wrong answer!”",
        "Yuuka grinned mischievously at me.",
        "“The correct answer is… an outfit for an upcoming event!”",
        "“What… did you say..?”",
        "An outfit for an upcoming event?",
        "Wait, so that means… no way…",
        "“Yuuka… you’re going to perform in the upcoming Alice Stage event?!”",
        "It’s a little sad for me to say, but… Yuuna is usually found on the lower half of the ranking charts.",
        "I really love her, but I’m pretty sure she shouldn’t be popular enough to be included in the event, right?!",
        "“Well actually, Hotta-san was supposed to be performing, but she couldn’t make it. That’s why I was quickly called to perform, along with one more Alice Idol from the same office as me. We’re just substitutes, though.”",
        "“Even so, that’s incredible! I’m so happy for you, Yuuka!”",
        "“Yeah! Thanks, Yuu-kun!”",
        "Even though there are various circumstances here, but…",
        "Yuuna-chan is finally popular enough to be chosen for an event.",
        "I was so moved that I couldn’t help but burst into tears.",
        "“So, with that said… Tada! This is a replica of Yuuna’s stage outfit!”",
        "I stood up as fast as possible and rushed to Yuuka’s side.",
        "It was a pink dress, decorated with laces in various places.",
        "There was a large yellow ribbon on the left side of the skirt",
        "To put it mildly, it was an angel’s robe.",
        "“What do you think, Yuu-kun?”",
        "“I feel like I’m about to get a nosebleed.”",
        "“Eh?! I’m sorry, but if you get blood on the dress, I’ll get angry!”",
        "Yuuka was surprised by my comment as she hurriedly pulled her dress towards her.",
        "Then, she glanced at me.",
        "“So, uh… do you want to see me wear it..?”",
        "I imagined Yuuka in the same outfit as Yuuna, with a big smile on her face.",
        "Ah…",
        "“……”",
        "“Yuu-kun?”",
        "Yuuka poked my shoulders a few times.",
        "But I couldn’t say anything at all to her.",
        "“Hmph! Yuu-kun, you baka! I won’t show you anymore then!”,",
        "“Ah, n-no, that’s…”",
        "“If you don’t want to see it, then fine.”",
        "Then, as she stuck her tongue out at me, she slammed the door behind her and went into the room beside us.",
        "I suddenly felt an intense pain in my chest.",
        "“Yuuka, t-that’s not it! How do I say this…”",
        "If I had to choose between whether I wanted to see it or not…",
        "Of course… I’d want to see it…",
        "But, there’s also a part of me that feels scared.",
        "If I saw Yuuka in the same outfit as Yuuna, with a big smile on her face…",
        "I’m scared that the two of them would be completely identical.",
        "And, I’m scared that my resolve to only love 2D girls… would start to waver.",
        "……But.",
        "That’s just an excuse, isn’t it?",
        "“…I want to see it.”",
        "I made up my mind and started talking to Yuuka on the other side of the door.",
        "“I want to be the first person… to see you in your stage outfit.”",
        "The door opened vigorously.",
        "“Mou! You made Yuuna wait for so long. Unforgivable!”",
        "And what I saw was Yuuka, who looked exactly like Yuuna-chan…",
        "She had brown hair tied into 2 ponytails.",
        "Her mouth was curled and round, just like a cat’s.",
        "Her pink dress, which I’ve seen in event gachas, was dazzling.",
        "And between the black thigh-high socks and the skirt… there were a few centimeters of absolute territory.",
        "【TLN: Imagine something like this. I’m too “pure” for this. You can go ahead and google thigh-high socks yourself.】",
        "It was so cute that I was speechless.",
        "“At the end of the event, everyone is going to sing the theme song together! There, Yuuna will be wearing this outfit while she sings and dances!”",
        "“I’m going. I’m definitely going.”",
        "I had already bought the tickets for the event.",
        "I didn’t think that Yuuna-chan would be performing, but I did promise Masa I’d go together with him.",
        "“I’ll definitely go see it. As『The Grim Reaper in Love』, I’ve decided that I will always support Yuuna-chan.”",
        "“Yes! Yuu-kun… no,『The Grim Reaper in Love』. Thank you so much for your support!”",
        "The event is on Sunday, 2 weeks from now, huh…",
        "I can’t wait for the day to come.",
        "I’m looking forward to it so much that… I might not be able to sleep at night until then.",
        "◆",
        "Here’s the first of 3 chapters to come. As mentioned in the previous chapter, I have a Discord server (https://discord.gg/6kFNSeZWHX) if anyone wants to join. Still small but hey, you can watch me rant about useless things. And on a more important note, I went ahead and created the poll early. I actually made it a few days ago on Discord, so shame on you for not joining (kusa). Anyways, feel free to vote here on which series I should pick up next: https://forms.gle/2onmNMU2cWiLPfaD6.",
        "Ko-fi"
    ]
}