{
    "id": "chapter-4",
    "title": "It's Tanabata, And I Think My Black History Will Be Exposed",
    "content": [
        "After a full day of Tanabata business, I came home.",
        "Yuuka and I were sitting next to each other on the sofa, sipping coffee in silence.",
        "“…”",
        "“…”",
        "Yuuka had already changed into her loungewear.",
        "Her hair was untied from her ponytail, causing the fluffy ends to spread out.",
        "Without glasses, her eyes would stop drooping, making her look younger than she did with glasses on.",
        "Her uncovered bosom and shoulders peeking out from her clothes were alluring, to say the least.",
        "The beauty of her smooth, white legs, partly due to the fact that she wasn’t wearing socks, made that part of her stand out the most.",
        "“Umm, Yuuka…”",
        "“Ugh, Yuu-kun’s an idiot!!”",
        "As soon as I began to talk, Yuuka exploded in a shout.",
        "She then glared up at me, waving her arms in the air.",
        "“The bigger the better, after all! Just like Nihara-san!!”",
        "“N-No, I didn’t say that, did I!? Aren’t you worrying about that too much, Yuuka!?”",
        "“Muuu… I mean, they all say that big is better than small.”",
        "That’s probably not a fitting phrase for this situation.",
        "Does she have a complex about the size of her chest?",
        "Though she was right in front of me, Yuuka was massaging her chest with pursed lips, almost as if she were contemplating about the size of them.“Hey, s-stop that.”",
        "“Why? Is it because my chest is too small for you?”",
        "“No, not that! I’m telling you not to do that because it makes me feel weird!!”",
        "It doesn’t matter what size they are, high school boys would die of over-stimulation if they saw a girl playing with their chest like that. In many ways.",
        "—Piriririririri~♪",
        "“Whoa!?”",
        "At that moment, my phone started ringing.",
        "I turned my back to Yuuka and answered the phone.",
        "“Hello?”",
        "『Haa…Nii-san, why don’t you answer with one ring every time? You’re so badly brought up.』",
        "The first thing that came out of her mouth was an unbelievable amount of abuse from my sister—Sakata Nayu.",
        "She is in the second year of junior high school, living with my father who has been transferred overseas.",
        "By the way, our mother was gone.",
        "I don’t know how many years ago it was, but she divorced and left home. Since then me or Nayu hadn’t heard anything from her.",
        "Eh… didn’t me and Nayu both grow up together?",
        "So, technically, it would be unreasonable to say that I wasn’t brought up well, right?",
        "『Why aren’t you talking? I’m serious. You haven’t called me in a long time, so at least say something to your sister.』",
        "“Ah, ahh…long time no see.”",
        "『Wow, you’re not serious. Even a monkey could say that line.』",
        "“Isn’t that a bit much?”",
        "『Wow, he’s talking back. This is sexual harassment. Oh no…you have a harasser in your body.』",
        "That’s the first I’ve heard of a harasser—!?",
        "However she’s right, I might have been a little too distant to my sister who had called me.",
        "Taking in that reflection, I opened my mouth again.",
        "“How are you doing? How long has it been… since we’ve talked like this?”",
        "『Ew, gross, I can’t.』",
        "It was a total denial.",
        "“W-What’s the matter with you? It’s been a while since I’ve talked to you, so I’m just trying to look out for you…”",
        "『It’s physiologically bad. Seriously, you should be more firm and convey your love for your sister.』",
        "“L-Love… What are you talking about? Embarrassing—”",
        "『Nii-san you’re the one who’s doesn’t know what you’re talking about. I’m serious.』",
        "Seriously, maybe it was time that I hung up.",
        "I let out a sigh at my foolish sister’s overly selfish attitude.",
        "“Uh, Yuu-kun…is that Nihara-san by any chance on the phone?”",
        "Maybe it was because we were talking about something related to Nihara-san earlier.",
        "Yuka spoke up with a misunderstanding in an impossible direction.",
        "“No, that’s not possible, is it? I’ve never had a phone call from Nihara-san before.”",
        "“So, then… Raimu-san?”",
        "“Isn’t that more impossible!?”",
        "I desperately tried to deny it, but Yuuka put her hand on her chin and mumbled something like a great detective.",
        "“…I see. You said that the strips of paper were addressed to ‘Yuuna’…but that itself was a mislead, and the strips are addressed to ‘Raimu’ that Nihara-san mentioned? If that’s the case, the phone call…at this time is still Raimu’s!”",
        "“What do you mean!? What kind of logic is that!”",
        "『…Nii-san, you’re being annoying. Raimu? Why are you talking about that b*tch with Yuka?』",
        "“Well, it’s a long story…for starters. I’m going to put you on speaker so you can tell Yuuka who you are. Before we get into trouble.”",
        "『Huh? Uza… well, okay.』",
        "Then I turned on the speaker button and put my phone on the table.",
        "Yuuka looked into the screen of my phone with a serious face.",
        "Then, she inhaled quickly—",
        "“Um, my name is Watanae Yuuka. Who are you?”",
        "『…My name is Nonoka Raimu. I am the lascivious devil who stole the heart of Sakata Yuuichi.』",
        "Yuuka’s scream echoed through the house.",
        "Nayu… please seriously reflect on that for the next time you see her.",
        "『I’m sorry, Yuuka-chan… I’m really reflecting on it.』",
        "“Nayu-chan, you idiot! There are things you can do and things you can’t do!!”",
        "『Um, well…』",
        "“Don’t ever do anything naughty like this again, okay? Okay, Nayu-chan?”",
        "『…Yes. I’m very sorry…』",
        "Nayu, the uninhibited and free-spirited girl, had become meek.",
        "That’s my girl, Yuuka. My dad and I can’t calm her down like you.",
        "As I was admiring her, Yuuka squirmed beside me.",
        "She looked like a puppy with slouched ears.",
        "“…I’m sorry, Yuu-kun. My reasoning was totally wrong. I’m sorry for being jealous.”",
        "“Well, you definitely had a wild line of logic… but it’s okay, as long as you know.”",
        "After that we bowed to each other.",
        "We looked at each other and chuckled.",
        "『…This is all the work of a person named Nonoka Raimu.』",
        "I could hear Nayu’s evil voice coming from my phone, which was on speaker.",
        "『It’s Tanabata in Japan, and I just thought I’d give your a call… but because of that scumbag… Yuuka-chan got mad at me.』",
        "“Yuuka got mad at you because you played some weird prank on her, right?”",
        "I made a perfectly legitimate comment to the unexpecting Nayu.",
        "“Hey, Yuu-kun. You know, about that person, Raimu-san. You…don’t think anything of her anymore?”",
        "“Ahh. To be honest, I didn’t think anything of her until Nihara-san told me.”",
        "『That’s true. We can just erase that demon from our memories.』",
        "I heard Nayu blurting out in a soft voice.",
        "Yuuka spoke to Nayu.",
        "“Hey, Nayu-chan. You really hate her…so, that thing with Raimu, was it awful? That was what made Yuu-kun…get sick with three-dimensional love.”",
        "『—It was when Nii-san was in the third year of middle school.』",
        "“Wait a minute, you! Why are you talking about my past like you’re reminiscing or something!?”",
        "『Today’s trouble turned into a big deal because you didn’t explain everything to Yuuka, right? You need to face your black history.』",
        "No, I know what you mean, okay?",
        "But, can you just put yourself in the shoes of the person whose black history is being exposed for once? Goodness.",
        "『Yeah, when Nii-san was in his third year of middle school—』",
        "And Nayu, ignoring all my protests, started to tell Yuka about my black history.",
        "You know, my parents are divorced.",
        "After the divorce and my mother’s departure, my father became very depressed.",
        "My brother and I both felt that marriage was really a bad idea.",
        "Well, on a different note, my brother was not that serious either.",
        "What was my brother like in middle school, the one who was…getting carried away?",
        "Yes, yes, you call yourself an “otaku but an extrovert.” It’s painful and funny at that point.",
        "The brother who thought he was hotshot like that was also a thing.",
        "And it was spurred on by…which I don’t even want to call names.",
        "“Nonoka Raimu” a manizing devil.",
        "Until the winter of his third year of middle school, I think my brother and that guy were, well, close.",
        "Nonoka Raimu was…at best, she was friendly. At worst, she was an all-around scum.",
        "Around that time, my brother brought many friends over to our house to play.",
        "Nonoka Raimu also came along and acted like she was a smiling, energetic character to everyone, including Nii-san and Kuramasa —Ah, I mean Kurai.",
        "Especially with Nii-san, she was kind of close to him. It was creepy to me. Seriously.",
        "In December of his third year of middle school, I will never forget.",
        "Nii-san thought she had something for him, didn’t he? So he confessed to Nonoka Raimu.",
        "Well, I know how she feels. I mean, that person seemed to have a thing for Nii-san.",
        "And yet, that demon — cruelly rejected Nii-san.",
        "That alone was not serious, but the next day, the rumor that Nii-san had been rejected spread around the class.",
        "I don’t know for sure. But I’m convinced that it was her.",
        "That’s why I won’t forgive her for the rest of my life. Tsk.",
        "For the next week or so, Nii-san was holed up in his room.",
        "I seriously thought that he would never leave his room… But then, somehow, he managed to pick himself up.",
        "The reason for this is…you know, don’t you, Yuuka-chan?",
        "Yuuka-chan was the actor for… someone.",
        "He got into that girl and proclaimed, “I only love two-dimensional things,”… and so, he made his way back into society.",
        "Chan-chan.",
        "“Guooooooo…….”",
        "I was sprawled out on the carpet with my head in my hands.",
        "What’s with the chan-chan?",
        "You exposed my black history, everything…I seriously thought I was going to die for a minute.",
        "『…Well, that’s what happened. I’m not sure if Nii-san still has a thing for Nonoka Raimu or not. If there was—I’d beat him with a steel pipe to bring him back to his senses.』",
        "In a tone of voice laced with hatred, Nayu quickly said something scary.",
        "I stood up with my hands on the table, breathing heavily.",
        "“Haa…ha…w-well. My black history was just like Nayu said. So, the story in school today was completely Nihara-san’s fantasy…Yuuka don’t have to worry about it—”",
        "—Fuwa.",
        "The soft touch, warmth, and sweet smell…all wrapped around me at once.",
        "“Yu-Yuuka?”",
        "“I’m sorry…Yuu-kun…I didn’t know that…”",
        "Yuuka was wailing as she hugged me.",
        "If you understand, then please realize that I don’t care anymore.",
        "“I will definitely… cherish Yuu-kun for the rest of my life, okay? I’ll never let you go until you tell me to stop loving you!!”",
        "Yuuka continued to fuss like that, as she was overwhelmed with emotions.",
        "As I held Yuuka in my arms, I was at a loss as to what to do.",
        "And then, Nayu—",
        "『Hey…if you’re going to flirt, can you please do it after you hang up? …Tsk.』"
    ]
}