{
    "id": "chapter-19-me-its-not-a-song-i-can-sing-in-front-of-a-crowd-fiance-1-2",
    "title": "Chapter 19: Me: “It’s not a song I can sing in front of a crowd…” Fiance: “...” (1/2)",
    "content": [
        "“Yeah!!! Is everyone having fun?!”",
        "In the karaoke room, Masa held the mic in one hand as he shouted out loud.",
        "…Why the hell are you so excited?",
        "Even though he obviously looks out of place at a gathering like this, somehow he’s getting really excited along with Nihara-san and the others. You’re really impressive, you know?",
        "Such a chaotic karaoke room, full of people whose names I don’t even know… Scary.",
        "Ah, they’ve started playing some tambourines. Scary.",
        "Now they’re waving their maracas. Scary.",
        "“Nice! I’ll be going next!”",
        "Nihara-san took the microphone from Masa and began to sing.",
        "Everyone around us was cheering, and you could hear people shouting “Yeah!” or “Woo!”.",
        "And in such an unfamiliar situation, Yuuka was…",
        "“……”",
        "She was frozen right next to me with a denmoku in her hand.",
        "【TLN: Looks like karaoke rooms in Japan give you this small tablet or device, called a denmoku, where you can search for songs and play them (or queue them, as you will see later). Here’s an example. Don’t quote me on this though, I’m just going by Google Images.】",
        "“Umm… Yuuka, are you okay?”",
        "“Y-yeah.”",
        "Yuuka replied to me in a whisper, but she didn’t look okay at all.",
        "Her cheeks were twitching and her expression was even more blank than usual.",
        "“This is because you forced yourself too much…”",
        "“I-I mean…”",
        "Yuuka looked down at her denmoku as she blurted out:",
        "“…『Yuuna will always be right by your side!』, right..?”",
        "Uuu… That’s the voice line for the tsundere event they ran 2 months ago for Yuuna (Normal).",
        "I imagined Yuuna-chan sulking with a pout on her face, which made my heart pound.",
        "“Sakata, have you queued your song?”",
        "Nihara-san suddenly spoke to me.",
        "“Uh… are you done singing your song, Nihara-san?”",
        "“Eh? Weren’t you listening to me? I think I’m pretty good at singing, you know?”",
        "You’re too close!Why is she placing her hand on my lap? And why is she looking at me with upturned eyes?",
        "“…Ahem.”",
        "If you keep bending forward like that, I’ll be able to see past your collar, you know?",
        "“Ahem, ahem!”",
        "Her chest area is….",
        "“*cough*, *cough*! *cough* *cough* *cough* *cough*!”",
        "Yuuka, who was sitting next to me, was coughing intensely.",
        "I calmed myself down and slowly turned my gaze to Yuuka.",
        "Yuuka was glaring fiercely at me as she was pointing to her chest repeatedly.",
        "『I knew it, it’s all about the chest, huh?』",
        "She gestured at me, expressing her jealousy to me.",
        "I’m telling you, that’s not it! I can’t help it if I just so happen to catch a glimpse of it, right?!",
        "“Heey, Sakata? Aren’t you going to sing something?”",
        "“Wait?! N-Nihara-san?!”",
        "Nihara-san suddenly clung to my body, and I tried to shake her off as fast as possible.",
        "That was close… Just now, I could smell something really good…",
        "And right beside me, I could sense an intense bloodlust being directed straight at me…",
        "“Do you want me to queue a song for you? You probably know this song, right? Do you wanna sing a duet with me?”",
        "“N-no, I’ve never heard that song…”",
        "“Eh?! It’s the theme song of a TV drama airing right now! Sakata, are you part of the ‘No TV’ cult?”",
        "“What kind of cult is that..? No, I do have one, but I don’t watch those kinds of shows or anything.”",
        "I only watch late-night anime shows…",
        "“So, you don’t know lots of songs?”",
        "“Honestly…”",
        "If you’re talking about anime songs, then I know lots of those.",
        "“Muu~ That’s a serious problem.”",
        "“I’ll just listen to everyone else sing, so…”",
        "“Well then, do you know this song?”",
        "I tried to politely refuse her and run away from having to sing in front of everyone, but Nihara-san forced the denmoku into my hands.",
        "And on the screen… was the theme song of a robot-themed anime featuring a versatile humanoid weapon that fought huge battles.",
        "“Sakata, didn’t you like this song back then? When we were in middle school, we used to sing this in the back of the classroom, right? Then we’d say stuff like ‘Guoooo!’.”",
        "Yes. We used to run around and pretend like we were the robot in the anime.",
        "Somebody kill me, please.",
        "“Then, Sakata… Can you sing this one?”",
        "No, I know I shouldn’t have tried to run away back there, but…",
        "If I said something like, “Yeah, I know that song! It’s the best!”, I’m afraid that I’ll revert back to how I was during middle school, and it’s making me have second thoughts here.",
        "“I-I’m telling you, Nihara-san… Me singing is a bit…”",
        "◆",
        "1 more chapter!"
    ]
}