{
    "id": "chapter-2",
    "title": "What day is it today? Does anyone know?",
    "content": [
        "“Alright, I have a question for you! So, Yuu-kun, do you know what day it is today?”",
        "After I got home from school, I was lying down on the sofa in the living room and casually reading some manga.",
        "All of a sudden, Yuuka decided to quiz me.",
        "When I turned to face her, I saw her with her hands on her hips and a rather smug look on her face.",
        "Hmm… today?",
        "Was there something important happening today?It was neither mine nor Yuuka’s birthday.",
        "And there wasn’t any sort of new event taking place in Alice Stage.",
        "Perhaps it’s the anniversary of Alice Stage’s release? …No, it was released  in winter. Besides, there was no way I’d forget about something that important.",
        "Damn, I’m drawing a complete blank.",
        "“You have 10 seconds left~”",
        "“Ugh, I seriously have no clue here. I mean, if you asked this question tomorrow, then obviously I would answer with the Tanabata festival, but…”",
        "“Ah, you’re so close! A little bit more, Yuu-kun! What’s the day before Tanabata?”",
        "“The day before Tanabata? July 6th? Er, is there something important on July 6th?”",
        "“July 6th! That’s it, that’s it! You’re getting really close!”",
        "Wait a second. Isn’t July 6th just July 6th? It’s just another ordinary day, right?",
        "I racked my brains, trying as hard as possible to think of something. But in the end, I couldn’t come up with anything.",
        "Having found no answer, I timidly announced that I gave up.",
        "“Sorry, I give up. So, what’s the correct answer, Yuuka?”",
        "“Fufufu. The correct answer is… drumroll please!”",
        "For some reason, she started making drumroll noises.",
        "She seems to be really excited, huh. This fiance of mine.",
        "Then, after a brief moment, she raised her index finger, and with a proud expression on her face, she said:",
        "“Believe it or not, today… marks the 3 month anniversary since I became your fiance! Kyaa, how exciting! Applause. please!”",
        "──I see.",
        "Never in a million years would I have guessed that.",
        "I tried my best to stay calm as I watched Yuuka get all worked up.",
        "“Now that you mention it, we first met on the day of the entrance ceremony, huh. Indeed, it has been exactly 3 months since then, but… is it really something to get so excited about?”",
        "“Of course it is! It’s been 3 months, you know?! It means we’ve been together for about an entire season’s worth of anime. Knowing that we’ve been together for so long… of course it’d make me happy!”",
        "(TLN: A season typically has 12-13 episodes, and since each episode airs weekly, it amounts to 12-13 weeks (3 months))",
        "Yuuka put her hands on her cheeks as her expression turned into one of pure bliss.",
        "Seeing her look so happy… made me feel kinda embarrassed.",
        "“W-Well… it felt like these 3 months flew by in a flash, didn’t it? I honestly didn’t think I’d be able to make it this far while living together with a 3D girl.”",
        "“We’ve still got a lot more ahead of us, you know? After all, I will eventually become your wife… your lifelong partner!”",
        "She spoke those words as if they were obvious as she looked at me with her clear eyes.",
        "Her hair fluttered around the shoulder area of her light blue dress.",
        "I could also see that her cheeks were slightly flushed.",
        "…My face was probably in a similar state.",
        "Yuuka is always straightforward with her words, even if she would normally be too embarrassed to say them.",
        "It’s because she’s such an honest and sincere person that I, despite having a strong aversion to 3D girls, feel like I can rest easy living together with her… probably.",
        "“Ah! Yuu-kun, why did you look away?”",
        "Feeling embarrassed, I tried to avert my gaze away from her, but Yuuka seemed to notice right away as she strongly pulled my arm.",
        "I could directly feel Yuuka’s body heat being transmitted through the contact, which made me feel even more flustered.",
        "“Geez, come on, Yuu-kun. It’s our three month anniversary! The fun’s only just beginning, you know?”",
        "“‘Only just beginning’? What on earth are you planning to do?”",
        "“Fufufu~… That, I can’t tell you~”",
        "When I glanced at Yuuka’s face, she deliberately averted her gaze, her mouth pursed.",
        "Then, shortly after, she glanced my way.",
        "But when our eyes met, she averted her gaze once more.",
        "*glance*",
        "──She’s doing this on purpose, isn’t she?",
        "I could really feel this air around her that seemed to scream, “Please ask me about it!”I couldn’t help but laugh.",
        "“I’m really curious, so please tell me, Yuuka.”",
        "“Geez, if you’re that curious, then I guess I can tell you, Yuu-kun~”",
        "When I asked her the question she’d been waiting for, she spun around to face me with a proud look on her face.",
        "Then, smiling innocently, she said:",
        "“To commemorate our three month anniversary──let’s have a celebratory party, Yuu-kun!”",
        "◆",
        "And so.",
        "To celebrate the three-month anniversary of our engagement on July 6th, it was decided that we would have a party.",
        "…Was it normal to celebrate something like this in 3 month intervals?",
        "At this rate, we’d be having these sorts of anniversaries every time an anime season ended… Well, Yuuka looks like she’s rather serious about this.",
        "I couldn’t help but smile wryly as I thought of the innocent face of my fiancee.",
        "──Yuuna-chan would probably do something like this too.",
        "This just reminds me that Yuuka really is Izumi Yuuna.",
        "I’m not sure whether it’s the character taking after the voice actor or the other way around, but… they sure do have a lot in common with each other.",
        "“Let’s see… party crackers, party crackers…”",
        "While Yuuka was at home cooking up a sumptuous meal for the party, I was at a mass retailer shopping for party goods.",
        "She said she wanted to have a grand celebration, so for now I’ll need some party crackers.",
        "What else… Maybe some stuff that can play music?",
        "I’ve never really gone to parties, so I’m not sure if my taste is all that impressive.",
        "I came across a flower figurine that had a face painted on it, and I tried touching it.",
        "『Kyun~ Pyoko~』",
        "The figurine began to undulate and dance as it let out a flat, inflectionless voice.",
        "…This doesn’t seem to be too fitting for the party, does it?",
        "Putting my hand on my chin, I sank deep into thought.",
        "『Voice Bullet (Fairy)──Charming Fairy!』",
        "J-just now… did I hear Izumi Yuuna’s voice?",
        "What I heard right after the robotic voice was definitely the voice of Izumi Yuuna.",
        "She was shouting the name of some sort of strange skill.",
        "I wondered what was going on, so I headed to the back of the store where the voice came from.",
        "And there, I saw──",
        "“Uryaa!”",
        "『Voice Bullet (Heat)──Dead Blaze』",
        "For some reason, I saw a gyaru from my class, Nihara-san, holding some kind of bulky toy gun in the store.",
        "When she pulled the trigger, I heard another voice that was different from the one I heard earlier… Hold on, isn’t this Shinomiya Ranmu’s voice?!",
        "What kind of strange gun is that? Why does it produce the sounds of Alice Idols chanting these weird skill names?",
        "“…Ah.”",
        "As I stared at her in a daze, my eyes met with Nihara-san’s, who was still holding the gun in her hand.",
        "We stared at each other for a brief moment.",
        "“O-Oh! I was wondering who it was, but it turned out to be you, Sakata! What’re you doing here?!”",
        "“Er, I’m just shopping for some stuff… Nihara-san, why do you seem so nervous?”",
        "“I-I’m not really nervous or anything like that! I’m also just here to do some shopping!”",
        "“Really? Isn’t that… a Cosmos Miracle Man gun you’re holdi─”",
        "“This is a Kamen Runner ‘Talking Breaker’ gun. It’s not a Cosmos Miracle Man gun, okay? They are both Tokusatsu shows, but you mustn’t confuse the two.”",
        "“Heh?”",
        "What on earth is she talking about?",
        "When Nihara-san saw my baffled expression, she suddenly had a look of realization on her face before she started quickly explaining.",
        "“Ah… well, you know that I’m really good at playing around with little kids, right? Like, that volunteering work we did the other day. That’s why I’m pretty knowledgeable about Tokusatsu shows and stuff!”",
        "Oh yeah… that time when Gousaki-sensei asked us to do some volunteering work at a preschool, she was excitedly playing a game of make-believe with the little children there, acting as characters in the Cosmos Miracle Man show.",
        "She always calls herself my “spiritual older sister”, messing around with me and stuff like that, so she might actually have a younger brother in her family.",
        "…Well, enough thinking about that.",
        "“Nihara-san, that gun… did you hear voices of various girls coming from it?”",
        "“Hm? Ah. In Kamen Runner, the characters use their voices as weapons in battle. When you scan a microphone item into the ‘Talking Breaker’ and pull the trigger, it produces various different voices. And depending on the type of voice, the attribute of the attack changes. Like this.”",
        "『Voice Bullet (Break)──Oil Shock!』",
        "Now it’s Hotta Deru’s voice, huh.",
        "What the heck, are they doing some sort of collab with the Alice Idols?",
        "“What’s wrong, Sakata? Why are you staring at me like that… Ah. T-that explanation just now was also something I just heard from the little kids who knew about that sort of stuff, okay?”",
        "Well, I get what you’re trying to say, but why are you talking so fast?",
        "*bzzt bzzt*",
        "Suddenly, the phone in my pocket vibrated.",
        "『Sorry, Yuu-kun! We ran out of yakiniku sauce… can you please get some for me?』",
        "Interesting. So we’re having yakiniku today.",
        "I replied, “Sure,” and put my phone back into my pocket.",
        "“Well then, Nihara-san. I have to stop by at the supermarket for a bit on my way home, so…”",
        "“Ah, gotcha. I’m pretty sure you’re living by yourself, right? So you cook your own meals and stuff?”",
        "“W-Well, I guess…”",
        "“Even though you only make terrible food in cooking class?”",
        "“Y-Yeah, well… I-It’s not like they’re inedible or anything.”",
        "I chose my words carefully in order to avoid leaking the fact that I was living together with Yuuka.",
        "I’m not sure why, but in response to my words, Nihara-san put her hand to  her chin and thought for a while before she suddenly clapped her hands together.",
        "“If that’s the case, then next time, I’ll come over to your house and make you some food! I’m a pretty good cook despite how I look, you know?”",
        "“Eh?! I-I’m just fine cooking by myself, okay?!”",
        "“You don’t have to hold back~. Oh right… since it’s almost summer vacation, I’ll come visit you then! I’ll make you some really good food. People do say that the way to a man’s heart is through his stomach, after all!”",
        "What the hell is this gyaru trying to do by winning over my heart?",
        "Anyways, Yuuka is at home, so please don’t actually come to my house.",
        "To keep the conversation from going any further in the wrong direction, I broke off the conversation and tried to head towards the supermarket located underground.",
        "──However.",
        "That gun that Nihara-san was holding… In the end, I couldn’t get it off my mind, no matter how hard I tried.",
        "◆",
        "“Tada! Take a look at my ‘Yuuka Deluxe Party Menu’!”",
        "Laid out on the table was yakiniku, prepared on a tabletop hot plate.",
        "…Not just that, but steak, sushi, roast beef, and so on.",
        "There was an unusual amount and variety of food laid out all over the table.",
        "“…Still, isn’t this way too much food?”",
        "“Fufufu. I’ve still got more than this!”",
        "Yuuka proudly disappeared into the kitchen, and after a short while, she emerged while carrying a whole cake on a plate.",
        "“…Eh? Did you, by any chance, make that by yourself?”",
        "“Yeah! Sweets aren’t really my forte, so if it doesn’t taste good, then I’m really sorry, okay?”",
        "The cake, made of white cream, looked so good that, actually, it looks just like the cakes being sold in bakeries.",
        "And on top of the cake, I saw a chocolate plate with a message written on it with cream, and it said:",
        "『I hope we can get even closer from now on, Yuu-kun☆』",
        "“…Thank you, Yuuka.”",
        "Quietly muttering those words to myself, I handed some party crackers to Yuuka.",
        "Then, we shouted our countdowns.",
        "“Congratulations on our 3 month anniversary, Yuu-kun!”",
        "『Voice Bullet (Fairy)──Charming Fairy!』",
        "“Gyaaaaaaa?!”",
        "Instead of using the party crackers, I opted to use the Kamen Runner gun… and for some reason Yuuka let out a horrific shriek.",
        "She proceeded to snatch the gun away from me.",
        "“W-Why did you… Why did you buy this, Yuu-kun?!”",
        "“I mean, why wouldn’t I? This gun has a compilation of Alice Idol voices in it. In fact, I feel ashamed of myself for not knowing about this item earlier… Naturally, I immediately decided to buy it right then and there.”",
        "“It has nothing to do with Alice Idols! This piece of work was mainly centered around Hotta-san, who did most of the voices for it, and as part of an agreement between our offices, I only recorded a single voice line… In fact, the company who made the product gave me one to take home! Now you’ve gone and bought another one, it makes me feel so embarrassed… Geez!”",
        "I see. So Yuuna-chan was barely involved.",
        "But, well… this is proof that Yuuka is really doing her best as a voice actress.",
        "Personally, I’m still glad to have bought this.",
        "Well, putting all that aside.",
        "Congratulations on our 3 month anniversary──Yuuka."
    ]
}