{
    "id": "chapter-20-me-its-not-a-song-i-can-sing-in-front-of-everyone-fiance-2-2",
    "title": "Chapter 20: Me: “It’s not a song I can sing in front of everyone…” Fiance: “...” (2/2)",
    "content": [
        "Yuuka silently stood up while I was arguing back and forth with Nihara-san.",
        "She held the microphone tightly with both her hands.",
        "A melody started playing.",
        "Then, Yuuka took a deep breath.",
        "Like an inhuman angel, she began to sing that song.",
        "She still had the same expressionless face as usual, but her voice was beautiful and crystal clear.",
        "“Ah, I’ve heard this song before on some singing show!”",
        "“Uwaa, Watanae-san is so good at singing!”",
        "As expected of the voice actress, Izumi Yuuna.",
        "She was singing so well that you can’t even compare her skills to mine.",
        "And her overwhelming singing skills made the atmosphere into one where no one really cared if this was an anime song or not.",
        "“There’s Ranmu here… Oi, Yuuichi! I see Ranmu in front of me!”",
        "【TLN: I had trouble with this line, I’ll explain below.】",
        "No, you’re just being delusional. Why are you even crying?",
        "Well… I guess Watanae-san at school resembles her… a bit.",
        "Yuuka’s singing filled the entire room.",
        "I felt something was out of place though. I pondered over what it might be.",
        "…How do I say this?",
        "Her voice sounds somewhat different from the voice I hear on Yuuna-chan’s theme song.",
        "◆",
        "And just like that, the terrifying karaoke party ended safely without any incidents.",
        "“Watanae-san! Let’s hang out again sometime! The fact that you came along with us made me really happy!”",
        "“If I feel like it.”",
        "Yuuka’s reply was surprisingly cold.",
        "“Okay, see you later Masa.”",
        "“Yeah… See you later.”",
        "Masa was surrounded by a gloomy aura as he trudged back home.",
        "He sang lots of denpa songs that no one really knew, and the girls criticized him a lot. Seriously, he should’ve just read the mood and sang another song.",
        "【TLN: This is oversimplified, but denpa songs = anime songs. Here’s the Wikipedia.】",
        "After I parted with everyone, I decided to take a detour on the way home.",
        "…No, this is definitely a necessary precaution.",
        "If by any chance Yuuka and I were caught entering the same house… I don’t even want to think about it.",
        "After I arrived at my front door, I carefully surveyed my surroundings. After I was sure that it was safe, I walked into the house.",
        "“Welcome back!!!”",
        "“What?!”",
        "The moment I entered the house, Yuuka leaped at me, her eyes sparkling so brightly, they could have been mistaken for those of a giant dog.",
        "As she was hugging me tightly, she puffed her cheeks out, seemingly pouting.",
        "“I got tired of waiting!”",
        "“No, I’m sure you’ve only been waiting for 3 minutes. Definitely.”",
        "“What will you do if, during those 3 minutes, I grow slack or something?”",
        "“Then I’d just think, ‘Wow, she gets soggy faster than instant noodles, huh?’ ”",
        "【TLN: They used 伸びる (nobiru), which can mean ‘to grow soggy’ or ‘to get exhausted’. Not sure which meaning they’re using, but I assume Yuuka used ‘exhausted’ and Yuuichi used ‘soggy’. Or maybe they’re using both. I’m just guessing here.】",
        "Yuuka giggled happily.",
        "The expression on her face was completely different from how it was earlier. Right now, her expression was completely relaxed and carefree.",
        "Seeing Yuuka looking so relaxed, I felt my shoulders relax as well.",
        "“Haa… Karaoke with everyone is really tiring…”",
        "“Hey! There were so many more songs I wanted to sing, but I couldn’t!”",
        "“Even though all the songs were ones I didn’t know, they kept asking me stuff like ‘You know this song, right?’”",
        "“And then they ask if you want to sing a duet with them! It’s like they were trying to kill us back there!”",
        "Since both of us were introverts, we started complaining about things we wouldn’t be able to say in front of others.",
        "It was kind of comforting to be able to converse like this, where both of us could sympathize with each other.",
        "“Ah, that’s right! Yuu-kun, can you please listen to a song I want to sing right now?”",
        "“Huh? Even though we just got back from karaoke?”",
        "“Yes. Well then, please listen closely.”",
        "Yuuka took a deep breath and started singing.",
        "The song she was singing right now was the one she sang back at the karaoke room, the incredibly famous anime song.",
        "But, somehow… her voice sounds different from back at the karaoke room.",
        "“…Yuuna-chan.”",
        "I quietly muttered, and Yuuka smiled happily.",
        "“Huh? But back at the karaoke room, your voice sounded completely different..? Eh?”",
        "“Yeah. I was singing with a different voice on purpose!”",
        "“Why?”",
        "“If I sang seriously in front of everyone, I might get exposed, and Yuu-kun wouldn’t like that, right? You said that Kurai-kun also liked Alice Stage, so…”",
        "Ah… that’s right.",
        "I nodded my head, now understanding the reason behind her actions. But Yuuka’s face turned red as she looked up at me with upturned eyes.",
        "“…But, that wasn’t the only reason…”",
        "“You had another reason?”",
        "Is there any other reason she would do that, other than to prevent herself from getting exposed?",
        "I was really confused, and Yuuka laughed at me, seemingly exasperated at my reaction.",
        "She put her fingers on her lips, as she said:",
        "“Keeping it a secret between me and Yuu-kun… makes me really happy.”",
        "◆",
        "So, Masa originally said「綾○がいる……おい、遊一！俺の前に綾○がいるぞ!!」, but I have no idea who or what 「綾○」 is supposed to refer to, so I just put Ranmu, Masa’s favorite heroine. If anyone knows the reference, please let me know. I need to learn more Japanese…",
        "Also, it’s been less than a week since I set up my Ko-fi. I’m gonna say it again because it’s important, but I was only expecting $1/month or something. So you have no idea how surprising it was when someone donated another $20. And it wasn’t even for extra chapters (I can’t do 60 chapters in 1 week rip), it was just a simple thank you. $1 would’ve made me plenty happy, but damn. I can’t do 60 chapters in 1 week, but I guarantee that I’ll finish v1 by the end of March. Thanks a lot for the donation, I don’t know why you decided on $20, but I’ll try and buy some LN volumes with that money (kusa)."
    ]
}