{
    "id": "chapter-4-the-girl-im-getting-married-to-turned-out-to-be-an-acquaintance-1-2",
    "title": "Chapter 4: The girl I’m getting married to turned out to be an acquaintance? (1/2)",
    "content": [
        "“Sakata-kun… You’re the 『The Grim Reaper in Love』?! Ehh?!”",
        "Watanae-san looked shocked, and her body staggered backward.",
        "Seeing her exaggerated reaction, I knew I messed up.",
        "I know I said it on the spur of the moment, but I shouldn’t have told her I was actually『The Grim Reaper in Love』.",
        "I’m not trying to brag or anything, but I do send a fair amount of fan letters to her.",
        "If a huge forum found out about this, they’d say stuff like, 「So disgusting lmao」, 「The Grim Reaper in Love lolol」, 「We should report him to the police」, and so on. Or it might be at a level even worse.",
        "As I was thinking about stuff like that, Watanae-san was silent and she had her hand on her chin.",
        "She occasionally made this “Hmm…” sound, which made me very nervous.",
        "Then, Watanae-san suddenly stood up… and bowed her head.",
        "“Although I may be incompetent… I, Watanae Yuuka, the voice actor for Izumi Yuuna, will do my best as your wife starting today. So, please treat me well!”",
        "“…Huh?”",
        "The situation was completely different from how I imagined it to be. My brain froze for a moment.",
        "“Hmm… But I feel like something’s not right. Is there something we’re doing wrong… Ahh! Honorifics! Because we’re using honorifics and formal language, it feels a little weird, doesn’t it?!”",
        "“Ah, yeah… We’re classmates, so we don’t have to use honorifics or speak too politely.”",
        "“Ok, so we’ll be speaking casually then! We’re married and we’re the same age, so using formal language would make us feel a little distant, right?!”",
        "“U-umm… Watanae-san?”",
        "“Ah! The way we call each other! That’s right!”",
        "Without any delay, Watanae-san kept on talking to me.",
        "“Call me Yuuka! If you call me by my last name even though we’re married, it’d feel weird, wouldn’t it?!”",
        "“U-ummm…”",
        "“Then, I’ll also be calling you ‘Yuu-kun’! What’s next..? What other things do married couples do..?”",
        "“E-excuse me!”",
        "Raising my voice a little, I interrupted Watanae-san.",
        "Then, Watanae-san stared at me, having a look of surprise for a brief moment… before she eventually became dejected. She then sat down on the sofa quietly, like a docile cat.",
        "“Sorry… I talked too much, didn’t I…”",
        "“No, that’s okay, you know? I mean, you looked really excited as you were talking.”",
        "“I’ve always been bad at socializing with others… I always think to myself: ‘I have to say something!’, and I end up talking too much…”",
        "As Watanae-san was looking dejected… For a moment, my heart skipped a beat.",
        "Because… seeing Watanae-san talking constantly reminded me of Yuuna-chan.",
        "Yuuna-chan, an Alice Idol still in middle school. She’s always so lively and energetic.",
        "Her cheerful nature can influence those around her.",
        "Sometimes, she might tease you like a little devil.",
        "But, when you tease her back, she’d get shy and flustered.",
        "She’s like a kaleidoscope. Her expressions are always changing. This is why I love Yuuna-chan.",
        "“I really talked too much… I did it again…”",
        "As I was having my delusions about Yuuna-chan, Watanae-san looked heartbroken as she slumped her shoulders.",
        "“You’re really different from the impression you give off at school, huh?”",
        "“At school, I keep my mouth shut as much as possible. I don’t want people thinking of me as ‘that weird kid who talks too much’. I try my best to talk as little as possible, but because of that, people don’t really talk to me.”",
        "“Ah… I totally understand how you feel.”",
        "People only talked to her when necessary.",
        "She was like a ghost, unnoticed by everyone.",
        "Just passing the days by peacefully.",
        "That was how Watanae-san lived her school life.",
        "“So, Sakata-kun… no, ‘Yuu-kun’”",
        "Watanae-san took a deep breath and smiled sweetly.",
        "“Will you marry me?”",
        "“No.”",
        "Even though I felt bad, I instantly turned her down.",
        "“Eeh?! Why?!”",
        "Watanae-san protested as she looked dissatisfied.",
        "“I’m Izumi Yuuna. I’m the voice actor of the one and only Yuuna-chan. How often do your parents arrange a marriage for you, and your partner just so happens to be the voice actor of your favorite heroine? This is a rare opportunity! Actually, aren’t I the only person who fulfills all those conditions?”",
        "“Yeah. But… voice actors are human beings.”",
        "I quietly muttered that.",
        "“It’s true that I definitely love Yuuna-chan more than anything else on Earth. And, you’re the one and only voice actor for Yuuna-chan, Izumi Yuuna. But, even so… I think it’s wrong to assume that both of them are the same people… ”",
        "I laughed at my sad, disgusting, horrible, pathetic nature.",
        "“Trust me when I say I’m really happy right now. This is the first time a girl has ever confessed to me. But… I’ve already decided I’d never fall in love with a 3D girl. Because in real life, you can hurt people, and people can hurt you…”",
        "Watanae-san’s expression became sad and gloomy as I looked at her.",
        "The way she looked was somehow similar to the way I looked back then.",
        "Ahh. So this is why.",
        "When you confess your feelings, both sides could get hurt.",
        "This is why I’m scared of falling in love with a 3D girl…",
        "◆",
        "The title might be wrong, but I’ve racked my brain for an hour and I can’t think of a better one. At least the chapter should be okay. Next chapter in a minute, because I hate cliffhangers. As always, corrections and suggestions are more than welcome!"
    ]
}