{
    "id": "chapter-1",
    "title": "My fiance is too cute, what should I do?",
    "content": [
        "“Fuuu! Yuuichi, did you see that?! The world will finally belong to Ranmu-samaaaa!!!”",
        "In the classroom, during lunch break.",
        "As I chewed on the bread I had bought from the canteen, Masa suddenly stood up in front of me and shouted in a strange voice.",
        "Right now, I really want to pretend that I don’t know him.",
        "“Hey, Yuuichi! Don’t turn your eyes away… from Ranmu-sama’s glorious future!!!”",
        "“I’m turning my eyes away from how disgraceful you are.”",
        "I’ve been friends with Masa, or Kurai Masaharu, ever since junior high, but this might be the very first time a situation this outrageous has ever happened.",
        "Just look at the stares of disgust from everyone in the classroom.",
        "But Masa, not even caring about that, just brushed his ruffled hair up.",
        "The eyes underneath his black-rimmed glasses had a needlessly sharp glint in them.",
        "“Hey, hey, Sakata~. What are you two so excited about~?”",
        "“The only one getting ‘excited’ here is Masa, you know?!”",
        "“But you’ve joined your table with his, and you’re talking to each other, so you can’t just claim innocence by yourself~”",
        "My classmate, Nihara Momono, was the one who retorted at me as she cackled and laughed.",
        "She had light brown, long hair.",
        "She was also wearing a bit of makeup, and her eyes were large and bright.",
        "Her blazer was lazily put on, so her chest area really stood out.",
        "To put it simply─she was just like a gyaru.",
        "“Aren’t you going to follow along with him~? That whole ‘The world is finally blablabla’ thing.”",
        "I won’t do it, and I beg you, please don’t lump me in with the likes of him.",
        "I’m not the type of person who announces my feelings and thoughts to everyone like Masa does.",
        "And right now, I’m someone who’s pretty inconspicuous in class… and I feel like this status of mine really suits me.",
        "I’m not a fan of 3D girls or extroverts, so… I want to live my life without getting too involved with them as much as possible.",
        "“Masa, I know how you feel right now. But, if you make such a huge commotion, what will the people around you who don’t know of ‘Alice Stage’ think?”",
        "“You don’t have to be so jealous of me just because my waifu got chosen in the ‘8 Alices’ event, Yuuichi.”",
        "──*snap*",
        "“Masa… doing something like using your waifu to attack others… you’ve really fallen rock bottom as an Alice Stage fan. You have to realize that words like yours could very well damage the image of your waifu, you know.”",
        "“Hah? Yuuichi… I don’t give a crap no matter how much you badmouth me, but I won’t forgive any slander against Ranmu-sama!”",
        "“Hold on, what are you two talking about?! Also, don’t start a fight here, geez.”",
        "Nihara-san tried to gently intervene between us, but neither of us would back down at this point.",
        "Both Masa and I could tolerate any sort of insult, no matter how demeaning, that was directed towards us.",
        "However, any slander directed towards our waifus was an unforgivable sin.",
        "If you choose to smear the name of my waifu, then… I have no choice but to fight.",
        "“8 Alices”. It referred to the top 8 Alice Idols from the『Love Idol Dream! Alice Stage☆』game based on the results of a popularity poll.",
        "There are close to 100 idols, all fully voiced.",
        "Beautiful idols. Charming characters. And frequently held events.",
        "Each character had the same name as their respective voice actor’s first name, and there was huge coverage from the media.",
        "A brilliant social game on which a major company had bet its entire future on─That was Alice Stage.",
        "A short while ago, Alice Stage held the “1st 8 Alices Poll”, a revamped version of the previously held “Top 11 Contest”",
        "【TLN: The Top 11 Contest was mentioned in Chapter 3, in case you forgot.】",
        "And the 6th place winner for the “8 Alices Poll” was Masa’s waifu, Ranmu-chan (CV: Shinomiya Ranmu).",
        "“Ranmu-sama is… my dream!”",
        "“Why are you crying, Kurai?!”",
        "Nihara-san got flustered when she saw Masa shouting while crying.",
        "“Ranmu-shama kept persevering and working hard… and her efforts reached the Alice Stage users, which is why she got chosen as one of the ‘8 Alices’. It’s almost like a Cinderella story… Isn’t she just divine, Yuuichi?”",
        "“Becoming a Cinderella alone isn’t all there is to being an Alice Idol, you know… Masa.”",
        "“Hey, Sakata, aren’t you crying too?! What the hell is going on?!”",
        "Just as she’d said, I noticed that my vision had gone blurry at some point.",
        "Ranmu-chan had been working really hard. I understood that.",
        "But, I knew another girl that was working just as hard as her.",
        "She came nowhere close to being one of the “8 Alices”, but… to me, she’s the only Alice Idol I’ll ever devote myself to.",
        "“Masa, no matter what you say… My Alice Idol is Yuuna-chan and Yuuna-chan alone.”",
        "Yuuna-chan (CV: Izumi Yuuna). She is my goddess.",
        "In the winter of my third year in junior high, I was turned down by a 3D girl, and everyone in my class found out about it. I felt so hopeless and depressed, which is why I eventually stayed home, not going to school at all… But, Yuuna-chan’s innocence and cheerfulness gave me the hope to keep on living.",
        "She had brown twin tails and a pouty mouth. Her chest was full of love and affection.",
        "Honestly, as a character, her popularity is still quite low, but…",
        "To me, she’ll always be my number one.",
        "“Yuuichi… I… did something so horrible to you…”",
        "“Masa… So you do understand…”",
        "I firmly shook hands with Masa.",
        "Nihara-san watched our exchange with a puzzled look on her face, but I didn’t care.",
        "Because we are.. comrades-in-arms who have fought for the honor of our respective waifus.",
        "“─Can you two be quiet?”",
        "As Masa and I continued making a racket, someone suddenly thrust a sharp warning at us.",
        "I nervously turned to where the ice cold voice came from.",
        "And there, I saw… my classmate, Watanae Yuuka.",
        "She had black hair tied up in a ponytail. She wore her blazer in a way that strictly adhered to the school regulations, keeping it neat and tidy.",
        "She had a small build, and her body was quite slender.",
        "She wore thin-framed glasses, and underneath those I could see her slightly slanted eyes.",
        "There was a sharp glint in her eyes, and combined with the frighteningly blank look on her face, it was… incredibly powerful.",
        "“You’re a nuisance. Act in a way befitting a highschool student.”“Y-yes.”",
        "Masa suddenly shrunk under the pressure, like a frog being stared down by a snake.",
        "Nihara-san squealed, saying, As expected of Watanae-san!”",
        "And I, without being able to say anything, just stared at her.",
        "Then, perhaps noticing my gaze on her, she glanced my way.",
        "It was only for a brief moment, before she immediately averted her eyes and muttered.",
        "“A-anyways… even if it’s lunch break, you’re being too noisy.”",
        "After saying that in a slightly softer tone, “Watanae Yuuka” went back to her seat.",
        "“W-Watanae-san is so scary…”",
        "“It’s ‘coz the two of you were makin’ too much of a fuss. Well, that being said… I think it’s good that you two have a relationship where you can say whatever you want to each other without holding anything back, you know? I yearn for that kind of thing~”",
        "“What’re you talking about? Don’t you always tell people whatever’s on your mind, Nihara?”",
        "“This is why you’re unpopular, Kurai. You see, every girl has their own… secrets.”",
        "As I heard Masa and Nihara-san whispering to each other… I felt a slight ache in my chest.",
        "I’m sorry, Masa.",
        "Girls aren’t the only ones who keep secrets from others.",
        "I also have a secret I can’t tell anyone else, even you.",
        "All the more so, since you are a huge fan of Alice Stage.",
        "Watanae Yuuka is, in fact, Yuuna-chan’s voice actor, “Izumi Yuuna”.",
        "At school, she’s a straight-laced and serious student, who is inconspicuous and unsociable. But her true nature is that of an innocent and pure, angel-like girl.",
        "On top of that, she’s also my fiance, and we’re living together under the same roof.",
        "Well… even if I said all that to him, I’m sure he wouldn’t believe it anyway.",
        "◆",
        "“Yuu-kun, that’s a no-no!”",
        "As soon as I got home, Yuuka intensely glared at me, but… unlike the one she did at school, this one didn’t feel scary at all.",
        "She’d already changed out of her blazer and into a light blue dress.",
        "Her black hair was untied from the ponytail she had at school, and it now flowed straight down to the area around her shoulders.",
        "Her eyesight wasn’t really that bad, so whenever she wasn’t outdoors, she took her glasses off.",
        "And whenever she did, her slanted eyes would mysteriously form-change into droopy eyes.",
        "It was impossible for me to be scared of her when she was this cute.",
        "“You can’t make such a huge fuss about Alice Stage! Geez!”",
        "“Is it really something to be so concerned about? Well, I’ll admit we were being noisy, but…”",
        "“I don’t care about the fact that you were causing a huge racket with your friend! That’s not the point I’m trying to make here!”",
        "“Really?”",
        "I tilted my head to the side, which made Yuuka puff her cheeks out.",
        "“If you praise Yuuna so loudly─it makes me feel embarrassed, baka!”",
        "“Eh, that was the problem?!”",
        "Her reasoning was so unexpected, I accidentally let out a strange sound.",
        "Then, Yuuka started hitting me on my chest over and over.",
        "“Baka, baka! You’ve been getting too carried away lately, Yuu-kun!”",
        "“What kind of accusation is that?! I’m just trying my best to live a calm and peaceful life with you while I love Yuuna-chan, just as usual─”",
        "“It’s too much! Your love for Yuuna is so heavy to the point where it’s crushing me!”",
        "Then, Yuuka handed me a piece of paper.",
        "■ From: “The Grim Reaper in Love” (pen name) ■",
        "Hello, Yuuna-chan! It’s finally time for the “8 Alices Poll”, huh.",
        "I casted my vote as soon as the polls opened. As for who I voted for… I’ll be keeping that a secret.",
        "Here’s a hint: She always has a dazzling smile on her face, she’s a bit of an airhead and she’s really innocent, but she works harder than anyone else─a really loveable girl.",
        "Whether she wins or loses this poll, I’ll continue to support her. She’s a girl I love more than anyone else.",
        "“…Oh. Isn’t this the fan-letter I sent to Yuuna-chan? What’s wrong with it?”",
        "“Why don’t you just tell me in person! We’re already living together!”",
        "“Well, ‘coz if I want to tell Yuuna-chan my feelings for her, then I have no other choice but to write her a letter, right?”",
        "“You can’t say ‘no other choice’! Here, here! Yuuna-chan’s voice actor is right here!”",
        "With her cheeks puffed out, Yuuka snatched the letter away from me and carefully put it back in its envelope.",
        "Then, she glanced at me.",
        "“…Making Yuuna look like this is absolutely unforgivable! As your punishment… you have to say that you love me 100 times, baka!”",
        "“Guhh!”",
        "I vomited a ton of blood. I’m now dead.",
        "Because just now, she did a perfect reenactment of the climax in Yuuna-chan’s new event.",
        "The protagonist goes to an amusement park and ends up participating in an attraction with a tagline that says “Let’s say a hundred things you love about your girlfriend”. The protagonist then goes on to praise Yuuna-chan a lot.",
        "Then Yuuna-chan, who was about to die of embarrassment, unintentionally uttered this incredibly moe line.",
        "On the day I first heard the line, I ended up looping it for 3 hours straight in the middle of the night.",
        "Since then, I’ve made it a habit to listen to this line 3 times a day, every day.",
        "If that line was said directly to my face… I’m not sure if I’d feel embarrassed or anguished. At any rate, my mind would probably break.",
        "What the heck? Is this girl trying to kill me?",
        "“As your punishment, you have to say that you love me 100 times! Baka!”",
        "“Yuuka, I’m sorry. I’m really sorry, so please, let’s just stop─”",
        "“Tell me that you love me! Baka, baka!”",
        "Even though my HP had already dropped to 0, Yuuka kept attacking me with her moe attack.",
        "She’s probably starting to enjoy herself a bit, since she now has a smug look on her face.",
        "If that’s how you want to play, then I’ll…",
        "“S-So, Yuu-kun? Have you reflected on your actions? If you do too many things that make people embarrassed, then─”",
        "“I love you.”",
        "“Ehh?!”",
        "Now Yuuka was the one who got flustered after she heard the words that left my mouth.",
        "She hurriedly flapped her arms around, and her expression turned into one of panic.",
        "“H-hold on! I was just quoting Yuuna’s line to make you reflect on your actions, okay? It wasn’t like I actually wanted you to do it or anythi─”",
        "“I love you. I love you. I love you. I love you.”",
        "“Gyaaaaaa?!”",
        "If I had to make a comparison, it was as if I was using some sort of magic spell to exorcise a spirit.",
        "Yuuka shrieked and fell on the floor at the same time as she writhed and floundered around.",
        "…This is kinda fun.",
        "“So Yuuka, have you reflected on your actions? If you do too many things that make people embarrassed, then you’ll be a bad person.",
        "“You’ve done enough! I understand now! Just stop! If you keep whispering such sweet words to me, then my mind will break─”",
        "“I love you. I love you. I love you. I love you. I love you. I love you. IloveyouIloveyouIloveyouIlove──”",
        "“Funyaaaaaaaaa?!”",
        "─One hour later. I was made to do a seiza on the floor.",
        "Sitting on the sofa with her arms folded, Yuuka pouted her lips as she glared at me, her face as red as an apple.",
        "“…Yuu-kun. You started enjoying yourself halfway through your act, didn’t you?”",
        "“…But this all started because you tried to kill me with Yuuna’s moe voice.”",
        "“Mmm… so?”",
        "“Since you tried to kill me with moe, I retaliated. I think it’s called a Double Moe Payback?”",
        "“It was nowhere near double though?!”",
        "That’s right. Outside, she acts all serious and plain, but at home, she’s a bit of a silly girl.",
        "She works really hard as Izumi Yuuna, but at home, she’s just a small animal.",
        "She is my─Sakata Yuuichi’s一fiancee.",
        "This is the story of our chaotic and lively days."
    ]
}