{
    "id": "chapter-38-my-fiance-is-secretly-sweet-with-me-1-3",
    "title": "Chapter 38: My fiance is secretly sweet with me (1/3)",
    "content": [
        "“Onee-chan! Cosmos Miracle Dynamite!”",
        "The boy looked tense as he raised his eyebrows and ran towards Yuuka.",
        "Then, they collided with each other.",
        "“Boom!”",
        "“Uwaa, you got me!”",
        "Yuuka intentionally fell to the ground.",
        "When the boy saw this, he raised his hands in joy and celebrated.",
        "How do I say this… It’s so relaxing.",
        "Despite the fact that she was in her Watanae Yuuka persona, wearing glasses and a ponytail, her expression right now was softer than her expression at school. Maybe it’s because it’s a child she’s dealing with.",
        "…”Watanae Yuuka” at school.",
        "Izumi Yuuna, a voice actor for Yuuna-chan.",
        "And, the Yuuka at home.",
        "She has many different faces, but the face Yuuka is making right now when she’s playing with the boy is… yet again, another different face.",
        "It doesn’t matter which one is fake and which one is real.",
        "No matter how many kinds of Yuukas there are, all of them are a part of Yuuka.",
        "I’m sure that I also have various different faces as well.",
        "All of them are a part of “Sakata Yuuichi”.",
        "“Alright… let’s try it on Onii-chan this time, shall we?”",
        "“Yeah. Cosmos Miracle Dynamite!”",
        "The boy pronounced that line fluently.",
        "Then, he quickly ran towards me and tackled me on my waist.",
        "“Ahhh!!! I’ve been hit!”",
        "I screamed loudly and rolled around on the ground.",
        "My acting was definitely realistic, if I do say so myself.",
        "With this, I’m sure I’ve captured the heart of the boy.",
        "*bang*",
        "“Ouchhh?!”",
        "“Wait, Yuu-ku… Sakata-kun?! Are you okay?”",
        "I got carried away with my act, and I hit my head against the roots of a large tree.",
        "“Mou… You overdid it.”",
        "“How embarrassing…”",
        "I clutched my head in pain as I sat still next to the tree. Yuuka rushed to my side and heaved a sigh.",
        "The boy stared at the two of us.",
        "“Onee-chan, Onii-chan, are you two getting married?”",
        "“Ehh?!”",
        "“W-what are you saying?!”",
        "“I mean, both of you are very close to each other.”",
        "The toddler’s pure eyes stared at me and Yuuka as we fumbled around with our words, feeling flustered.",
        "Well, it’s true that our relationship is close to something like marriage, but…",
        "We can’t let anyone else find out about that, since we have a secret relationship…",
        "“Takkun!”",
        "“Ah, Mama!”",
        "We couldn’t say anything at all as we sank into silence.",
        "A person who looked to be the boy’s mother came rushing over to us.",
        "The boy’s face instantly lit up.",
        "The mother hugged the boy tightly and eagerly stroked the boy’s head.",
        "“I’m sorry, I got held up at work.”",
        "“It’s okay. Onii-chan and Onee-chan played a lot with me.”",
        "“Ah, really? Thank you very much for playing with my child.”",
        "The mother thanked us as she bowed her head.",
        "Right next to her, the boy was also bowing, imitating his mother.",
        "It was a pleasant and charming scene.",
        "“Thank goodness. Your Mama came.”",
        "“Yeah!”",
        "Yuuka smiled wholeheartedly at the boy and his mother.",
        "Seeing Yuuka with such a gentle expression… made me feel warm and fuzzy too.",
        "◆",
        "Ko-fi"
    ]
}