{
    "id": "chapter-29-yuuna-chans-younger-brother-1-2",
    "title": "Chapter 29: Yuuna-chan’s “younger brother” (1/2)",
    "content": [
        "As I was quietly reading my manga, an alarm rang from my phone.",
        "I immediately closed the manga and picked up my phone.",
        "I turned off the alarm and hurried over to my computer.",
        "On my computer was the official website of an online radio I had opened in advance.",
        "I closed my eyes and took a deep breath.",
        "I slowly clicked on the sound file…",
        "“Greetings, everyone! 『Love Idol Dream! Alice Radio☆』starts now!”",
        "Alice Stage’s online radio, also known as “Alice Radio”, was created at the end of last year.",
        "One of the defining features of this program is that it doesn’t have a set MC.",
        "For every broadcast, two Alice idols are invited to participate as personalities.",
        "The first half of the show is spent talking as the characters they voice, and the second half is free talk by the voice actors themselves.",
        "For Alice Stage fans, it’s a dream come true, as they get a chance to see their favorite characters become personalities.",
        "“Without further ado, for today’s personalities… I will be going first. Well then, everyone? ‘What money can’t buy, let’s go look for it together’. I’m “Hotta Deru”, the voice actor for Deru. I look forward to working with everyone.”",
        "Deru-chan is a popular Alice Idol who is always ranked in the top 20.",
        "She was born into an oil tycoon’s family and has lived a life without any inconvenience, but she decided that “what money can’t buy” was important.",
        "As a result, she became an Alice Idol… and she works hard day and night to bring a smile that money can’t buy to everyone’s faces.",
        "“And the other personality joining me today is…”",
        "She’s coming, she’s coming!",
        "I stared at the computer as I was trying to suppress my excitement.",
        "That’s right, the other personality is…",
        "“Hello! Ah, hey! I told you not to treat me like a little kid! Today, Yuuna is going to really entertain everyone, so… prepare yourselves, okay? I’m Izumi Yuuna, the voice actor for Yuuna! Nice to meet you all!”",
        "Yuuna-chan… A 14-year-old middle school student.",
        "She is an ordinary girl who was invited to apply for the role of Alice Idol by her sister, Nanami. Both of them applied together, and now both sisters are Alice Idols.",
        "She is innocent, naive, and full of energy. She’s at the age where she wants to show off a bit, and when she tries to look “mature”, she makes lots of silly mistakes. Basically, she’s a clumsy girl.",
        "She sometimes approaches you like a little devil, but she’s so pure that she gets embarrassed and stops halfway through. And she’s actually a very sweet girl.",
        "【TLN: Last sentence either means, “a very sweet girl” or “a girl who likes to be spoiled/pampered by others”.】",
        "…To be honest, it’d be faster to find Yuuna-chan in the rankings counting from the bottom, but…",
        "Rankings are meaningless.",
        "Because for me, Yuuna-chan will always be number one.",
        "“…Fuu.”",
        "I realized that I had forgotten to breathe, so I took a deep breath.",
        "Ah, by the way, I’m having Yuuka run an errand for me.",
        "Even though she knows I’m the 『Grim Reaper in Love』… It’s still too embarrassing to show her this side of me.",
        "I sat on my chair properly, in a seiza.",
        "I’m going to focus all my attention on Alice Radio.",
        "“Hi there, Deru-chan!”",
        "“Yuuna-chan, you’re brimming with energy as always, aren’t you?”",
        "Then, the mini-drama began.",
        "“Yeah! Being cheerful is one of my strong points, you know! When Yuuna smiles, everyone smiles too! Then, everyone will be happy, right?”",
        "“How wonderful. Truly a kind of happiness that money can’t buy… I also want to be able to make everyone smile, too.”",
        "Yuuna is full of energy, while Deru is a quiet and gentle girl.",
        "These two make a great pair, and the atmosphere they created was wonderful.",
        "This was, to put it mildly, an incredible episode.",
        "“Anyways… Yuuna-chan, you really are big, aren’t you?”",
        "“Hmm? I-I wonder… I get embarrassed when people look at me like that…”",
        "“I have lots of oil at home, but my chest… isn’t as plentiful. I guess bigger really is better…”",
        "“I’m not sure… I’ve heard a lot of people say that boys like them bigger, though.”",
        "This guy! The person who wrote this scene! He’s the culprit!",
        "I don’t know when, but he’s the one who gave Yuuka the image that all boys prefer big breasts. I’m 100% sure!",
        "“But you’re so cute, Deru-chan! When you’re that cute, everyone just can’t leave you alone!”",
        "“Right back at you, Yuuna-chan. I want to be a bright and wonderful girl like you, Yuuna-chan.”",
        "“I wish I was a bit more graceful and ladylike, you know? I mean, Deru-chan, you’re so adult-like and mature! I also want to learn how to be more mature, too!”",
        "You’re cute just the way you are!",
        "Your childishness is cute! The way you’re so obsessed with trying to be more mature is cute! Everything about you is cute!",
        "In fact, the whole world is filled with happiness just because you exist, you know?",
        "Since the day I met her, I’ve always been the 『Grim Reaper in Love』for Yuuna-chan.",
        "◆",
        "Ko-fi"
    ]
}