{
    "id": "chapter-36-i-was-forced-to-volunteer-on-my-day-off-1-2",
    "title": "Chapter 36: I was forced to volunteer on my day off (1/2)",
    "content": [
        "“Okay, Yuu-kun. I’ll see you soon.”",
        "“Yeah. Good luck on the event!”",
        "As she slipped on her heels and grabbed her hand luggage, Yuuka bowed her head to me.",
        "“I’m really sorry… Yuu-kun.”",
        "“I told you it’s fine. I’m surprisingly pretty good at playing with children, even though I may look like this.”",
        "“I wonder~. I feel like the children are just going to tease you.”",
        "“Well, I’ll cross that bridge when I get there.”",
        "Even though she nodded her head, she still has a grim expression on her face.",
        "How are you going to get through the event if you’re so depressed here? Geez.",
        "I took out my phone out and pressed the send button on Line.",
        "*bzzzt* *bzzzt*",
        "“Yuuka, take a look at your phone.”",
        "“Eh?”",
        "■ From the pen-name: 『The Grim Reaper in Love』 ■",
        "Yuuna-chan, good morning! Today is the long-awaited day of the Alice Stage event!",
        "I didn’t expect Yuuna-chan to be able to perform at an event so soon. To be honest… I felt very moved. As a self-proclaimed number one fan, I was overjoyed to hear the news.",
        "Are you feeling nervous? If you’re too nervous, it will ruin your precious smile, so… relax and show everyone the usual charming and lovely Yuuna-chan!",
        "Yuuka slowly raised her head.",
        "Then, having worn contact lenses, she looked at me with her clear, transparent eyes.",
        "“…『The Grim Reaper in Love』, thank you for everything. Today, I’ll do my best to be the usual Yuuna! I’m going to give it my all! If you don’t support me properly… I’ll get angry at you, okay?”",
        "Then, Yuuna-chan… Yuuka smiled at me.",
        "Her smile didn’t have any trace of the dejection she had earlier.",
        "“I’ll be heading out, 『Grim Reaper in Love』”",
        "“Take care, Yuuna-chan.”",
        "We exchanged goodbyes, and waved to each other.",
        "Then, Yuuka headed to the event venue.",
        "“Fuu…”",
        "I have to get ready too, or else I’m going to be late for my volunteering work.",
        "But… just for a bit.",
        "I stared at the ceiling and idly thought.",
        "It’s Yuuna-chan’s first huge event.",
        "Honestly… I really wanted to watch her up close and cheer for her a whole lot.",
        "◆",
        "When I arrived at the preschool, I saw a familiar face playing around with the children.",
        "“Oii! If you do that, the sand hill will collapse! Ah, come on!!!”",
        "She had long brown hair tied up in a bun, and she was wearing a blue apron.",
        "She looked vastly different from usual. Nihara-san, a gyaru from my class, looked like she was playing around happily.",
        "“All right! Next, how about we play Tag? I’ll be the tagger, so get ready, okay? For our game of tag, let’s see… The kids who get caught will be eaten!”",
        "“You fit in really well, Nihara-san…”",
        "“Oh, Sakata!”",
        "When Nihara-san, who was playing with the children happily, noticed my presence, she called out to a nearby preschool teacher who looked to be in their thirties.",
        "“This here is Sakata. Both of us will be doing our best today, so please take care of us!”",
        "“Ah, u-umm… Please take care of us.”",
        "After we bowed to the teacher, Nihara-san quickly returned to where the children were waiting.",
        "Wait a minute…",
        "“Why are you here, Nihara-san? The original plan was for Watanae-san to volunteer, but I’m the one who should’ve acted as her substitute, right?”",
        "“Yeah, that’s right. But yesterday, when I told Gousaki-sensei, ‘I’d like to give it a try too’, he gave me the OK. So, I was allowed to participate too.”",
        "Eh, what the hell..? So if Nihara-san was here, couldn’t she have done this by herself?",
        "Such evil thoughts began to swirl in my head, but well… Gousaki-sensei probably only allowed her to tag along because one of the two problem children in his class was already going, so his original goal was already accomplished.",
        "“But anyways. Seriously, Sakata. Why did you choose to switch places with Watanae-san?”",
        "“E-err… Because even though I may look like this, I actually like children!”",
        "“Ah… yeah. I get that you might have that kind of fetish, but… If you actually try to touch them, you’ll get into trouble, okay?”",
        "“That’s wrong. I wasn’t talking about liking them as lolis or anything like that.”",
        "“It’s just a joke~”",
        "Nihara-san cackled as she poked fun at me.",
        "Then, she headed back to the yard where the children were calling for her.",
        "“… Right. I have to do my best here too.”",
        "I think they’re about to start admitting people into the venue for the event soon.",
        "Masa’s been excited to death since yesterday. I envy him, seriously.",
        "But, oh well… There’s no point in thinking about it anymore.",
        "I put on a white apron over my black T-shirt.",
        "Then, for the time being, I went to talk to a boy nearby.",
        "“Hi there, what’re you doing?”",
        "“……”",
        "The boy looked at me with a very anxious look in his eyes.",
        "Then, not knowing what to do, I also stared back at the boy.",
        "Just like that, a toddler and a 16-year-old boy stared at each other silently.",
        "“Mou, Sakata! What are you doing?”",
        "Perhaps Nihara-san couldn’t just stand to watch me like that anymore as she came between us.",
        "“All right! So, Onee-chan here will be the Cosmos Miracle Man, okay? You’ll be that alien over there.”",
        "“I don’t wanna! I’m going to be the Cosmos Miracle Man!”",
        "“Okay, okay. Then, I’ll be that alien over there. Whoosh, whoosh, whoosh.”",
        "Nihara-san easily got the boy to open his heart to her.",
        "Then, she excitedly played the role of an alien as both of them used figurines to fight each other playfully.",
        "Ahh… So Gousaki-sensei’s words probably had some truth to them.",
        "At times like this, I don’t know what to do.",
        "◆",
        "Discord: https://discord.gg/6kFNSeZWHX Poll: https://forms.gle/2onmNMU2cWiLPfaD6 A few things I forgot to mention last chapter. So, I don’t know the genders of any of these teachers, so I’m keeping it ambiguous where possible. I’ll assume they’re male, because of how aggressive Gousaki-sensei is portrayed in the novel. A professional translator might be able to infer their gender from their name or their way of speaking, but unfortunately, I’m an MTLer.",
        "Ko-fi"
    ]
}