{
    "id": "chapter-26-my-fiance-is-getting-along-with-my-cold-sister-2-2",
    "title": "Chapter 26: My fiance is getting along with my cold sister (2/2)",
    "content": [
        "At that moment…",
        "*rattle*",
        "The glass door to the balcony slid open vigorously.",
        "“Sorry, Yuu-kun, Nayu-chan! I came home really late this time!”",
        "Yuuka was gasping for air, probably because she was running on her way home.",
        "Her cheeks were flushed and there were drops of sweat on her glasses.",
        "Her hair was also somewhat messy.",
        "“Mou! I was wondering where everyone went! When I got home, there wasn’t anyone inside!”",
        "“How much running did you do? You’re all sweaty.”",
        "“Ah! Wait, stop! Don’t come any closer! Coming any closer is prohibited!”",
        "When Yuuka saw that I was about to rush over to her, she waved her hands wildly.",
        "Then, she took the collar of her tunic and pulled it up to her nose.",
        "“…I’m absolutely soaked in sweat right now. You can’t.”",
        "“I don’t really mind though.”",
        "“No, Yuu-kun, you’d definitely be put off! Because… Yuuna-chan would never smell like sweat!”",
        "Yuuka’s logic was pretty extreme as she argued with me.",
        "“For Yuu-kun’s sake… I want to be a wife who doesn’t smell…”",
        "“Pfft! Ahahahaha!”",
        "She looked up at me with upturned eyes as she seriously declared that.",
        "Seeing Yuuka like that, I couldn’t hold myself back any longer as I laughed out loud.",
        "“Ah, hey!!! Don’t laugh at meee! This is a serious problem for girls, you know!”",
        "“Sorry, sor– Pfft… Ahahahaha!”",
        "“Hey! Aren’t you laughing too much here?!”",
        "I couldn’t stop laughing here.",
        "It looks like Yuuka didn’t like that, because she puffed out her cheeks in anger.",
        "“Mou! You’re so rude, Yuu-kun!”",
        "“Sorry, sorry. Anyways, you’re sweating a lot. At this rate, you’ll catch a cold, so let’s head inside-”",
        "“Tch.”",
        "Nayu was watching our exchange.",
        "Then, she put a bath towel over her head, put her hands in her pockets, and walked towards her room.",
        "“Ah. Hey, Nayu-chan.”",
        "Nayu was about to head inside the house first, but Yuuka stopped her.",
        "“…What?”",
        "Nayu suddenly stopped walking.",
        "Yuuka ran up to her and used the towel on Nayu’s head to dry off her hair.",
        "“You have to dry your hair properly or else you’ll catch a cold, you know?”",
        "“…Whatever. It’s fine.”",
        "“It’s not fine at all. Even something like a cold can be scary, you know? Ever since I started voice acting, I’ve become more aware of things like that. A sore throat for people like us is really terrifying.”",
        "“……”",
        "I couldn’t tell what kind of expression Nayu had since she had a bath towel hanging over her head.",
        "At least she doesn’t seem to completely hate it, because she’s obediently letting Yuuka dry her hair.",
        "“Would you say the same thing if Nii-san was about to catch a cold?”",
        "“Eh? Of course! It’s a wife’s duty to worry about her husband’s health!”",
        "“What would you say to Nii-san if he was feeling lonely?”",
        "“Hmm… when he feels lonely, huh…”",
        "Yuuka put her finger on her chin as she thought about it for a moment.",
        "Then, she smiled and said.",
        "“First, I think I’d try and make him laugh to get rid of the loneliness.”",
        "“…Mmm.”",
        "Nayu nodded slightly and grabbed both ends of her bath towel.",
        "“Make him laugh. Do everything you can to make Nii-san laugh until he’s exhausted.”",
        "Then, Nayu turned her back to Yuuka and muttered quietly.",
        "“Please take good care of Nii-san… Onee-chan.”",
        "【TLN: Here, she used “Onee-chan” (お義姉ちゃん). This isn’t the usual Onee-chan (お姉ちゃん) used for someone’s blood-related older sister. This Onee-chan means “older sister-in-law”. In short, we have imouto’s stamp of approval.】",
        "◆",
        "Nayu went back to her room.",
        "After that, I handed Yuuka the bath towel I had brought and somehow, the two of us ended up gazing at the sky together.",
        "Yuuka dried her head with the bath towel as she pointed to the sky.",
        "“Look, look, Yuu-kun! A crescent moon!”",
        "“It might rain tomorrow, huh…”",
        "“Yeah, I guess so. It usually rains right after Golden Week.”",
        "Our time was peaceful together. The sky was peaceful as well.",
        "“…Ehehe… Ehehehe~”",
        "“What’s up with that creepy laugh?”",
        "“Creepy?! How rude!”",
        "No, I mean, you had this weird expression on your face while you were laughing.",
        "“Because… she called me ‘Onee-chan’, you know?”",
        "“Don’t you have any siblings?”",
        "“Ah… my sibling is… well… even though she’s still in middle school, she thinks I’m lower than her. She would never call me ‘Onee-chan’ or anything like that.”",
        "“Well… seeing how Yuuka is like at home, I also understand how she feels.”",
        "“What do you mean?! Mou! That’s not what I meant!”",
        "She glared at me for a moment, which didn’t scare me at all.",
        "Then, she huffed and smiled.",
        "“I felt that Nayu-chan finally accepted me as a part of her family, so I thought, ‘Ah, I’m now part of Yuu-kun’s family’. I guess it made me happy, you know?”",
        "“Ever since we got engaged, you’ve always been like family to me though.”",
        "“I know, but when another family member accepts you, it feels more like a real family! ”",
        "Being accepted… well, that’s certainly true.",
        "My stubborn and sharp-tongued sister, going so far as to say “Please take good care of Nii-san”.",
        "I think that Yuuka’s hard work as a bride is being conveyed not only to me, but also to my family members.",
        "“…I guess I’ll also have to work a little harder too…”",
        "“Hmm? Did you say something?”",
        "“Nah, don’t mind me.”",
        "“Eeh? You’re making me curious here!”",
        "“…How long are you two going to keep doing that? You’re annoying the neighbors.”",
        "Nayu opened the window to the balcony as she glared at us.",
        "She came up to Nayu and said, “You’re so cute!” as she started patting Nayu’s head.",
        "I see. My troublesome sister is weak to people like Yuuka.",
        "As I was thinking that, Nayu glared intensely at me.",
        "“…Nii-san, don’t laugh at me. Seriously.”",
        "◆",
        "Look at that, the imouto has redeemed herself. I was starting to dislike her a lot, but now I kinda like her. Also, say goodbye to ads. Adsense doesn’t like me so now no more ads. Ko-fi is good enough anyway."
    ]
}