{
    "id": "chapter-2-im-getting-married-and-shes-not-a-2d-girl-1-2",
    "title": "Chapter 2: I’m getting married, and she’s not a 2D girl (1/2)",
    "content": [
        "I sat down on a chair at my dining table.",
        "Watanae-san nervously fidgeted around, having nothing to do.",
        "On the other hand, Nayu had the nerve to just sit down arrogantly on a chair nearby.",
        "What the heck is going on?",
        "“U-umm, Watanae-san. For now, would you like some tea..?”",
        "“T-thank you…”“Ah, Nii-san. Make mine cold.”",
        "As requested, I started preparing 3 cups of barley tea.",
        "After that, I sat down in front of Watanae-san again.",
        "As I was drinking my tea, I happened to glance at her face.",
        "Looking at her now, I can see that her nose is well-defined, and she has large, bright eyes.",
        "Her face is quite beautiful, huh?",
        "I didn’t notice it before because she had her glasses on.",
        "Noticing my gaze on her, Watanae-san looked down bashfully and her face got red.",
        "“Ah… I-I’m sorry…”",
        "“N-no, I’m the one who should be apologizing…”",
        "“Tch. Thanks for showing me how innocent you two are.”",
        "“Shut up! Stop complaining and help me out here!”",
        "“Don’t wanna, it’s a pain in the ass.”",
        "What did she even come here for, anyway?",
        "Since she didn’t want to do anything, I had to speak up.",
        "“So, Watanae-san, have you also heard about the situation?”",
        "“Y-yes. My father got along really well with his business partner, and both of them agreed to have their kids married to each other.”",
        "No matter how many times I hear this story, it just doesn’t make sense to me.",
        "They’re too carefree about this.",
        "“So, Yuuka-chan, you’ve been in Tokyo since your 1st year of high school?”",
        "Nayu looked sluggish as she asked Watanae-san.",
        "“Ah, yes. I’m not actually from the Kanto region… I’ve been living by myself since I started high school.”",
        "“Huh. By the way, Nii-san is also living by himself.”",
        "“Yeah. My father is working overseas right now and my sister also moved with him…”",
        "“Anyways, is it okay if you moved here starting today, Yuuka-chan?”",
        "“Wait a minute.”",
        "Why did Nayu suddenly bring up moving? I quickly interrupted her.",
        "“Why are you suddenly deciding she has to move here?”",
        "“Hah? Our house is bigger, isn’t it? If you get married, obviously you start living together with your partner. What about it?”",
        "“Didn’t I already tell you on the phone? We’re both high school students. We can’t legally get married.”",
        "“It’s called a common-law marriage. Both parents already agreed to this.”",
        "【TLN: Common-law marriage is a marriage considered valid by both partners but not formally recorded or celebrated. Read more about it on Wikipedia.】",
        "“Even if our parents already gave their consent, it doesn’t mean that both of us actually want to get married.”",
        "“That’s just what Dad said. I don’t know anything.”",
        "Nayu had a look of blatant discontent on her face.",
        "Well, I guess it’s true she didn’t decide on any of this. She’s just a messenger.",
        "Even though I knew that, I still felt annoyed.",
        "“You know, Nayu… I’ve already decided I’d never fall in love with a 3D girl. You know this, right? Ever since Dad got divorced, I can’t imagine myself ever marrying anyone. And ever since I was rejected back then, I’ve only been interested in the 2D world. I’ve told you so many times by now.”",
        "When my dad broke up with my mom, I saw him looking so sad I thought he might die of grief or depression. I realized that when a marriage ends, it always brings immense suffering.",
        "And, after my incident during middle school, I decided I would only love 2D girls, where they couldn’t hurt me, and I couldn’t hurt them.",
        "That’s the kind of person I am.",
        "“Hahh… Even though you want to ‘marry’ that character and ‘make her happy’.”",
        "“Nayu, don’t call her ‘that character’. She has a proper name called Yuuna-chan. You should refer to her by her name properly.”",
        "“Wow… That’s what you’re hung up about?”",
        "She looked at me with a dumbfounded face and let out a sigh.",
        "“Well, if you combine 2D things, they become 3D. If you think of it like that, maybe you’ll feel better about marriage, or something? I don’t know.”",
        "“What kind of theory is that? You just don’t understand my logic at all.”",
        "“Well, Nii-san says things that don’t make sense most of the time anyway. Whatever. You should enjoy having a real wife while you still can. Tch.”",
        "“Again, why are you so grumpy?!”",
        "Nayu didn’t answer.",
        "Instead, she just ignored me.",
        "“Okay, we’re done here. I’ll let you two enjoy yourselves. See you later, Nii-san… I hope you die happily.”",
        "“What?! Die?! Why are you getting more abusive?!”",
        "And just like that, she forcibly stopped me from asking any more questions.",
        "Nayu left the house as quickly as she could, not even listening to me as I was trying to stop her.",
        "◆",
        "Dear Nayu-sama, how are you right now?",
        "The room is now completely silent after you left, and it’s already been 1 hour.",
        "“……”",
        "“……”",
        "We’re too shy to look each other in the eye, and we can’t even stand up from our seats.",
        "This awkward atmosphere is making me nervous.",
        "But…",
        "We can’t just stay like this forever.",
        "I cleared my throat and faced Watanae-san.",
        "Come on, you can do it, Yuuichi.",
        "“So, Watanae-san… I’m a pretty antisocial and gloomy person, just so you know.”",
        "“…Yes?”",
        "It might be painful, but I had to bring up my past, for both of our sakes.",
        "Watanae-san just tilted her head looking confused, but I continued anyway.",
        "“That’s why I’m not interested in girls. I don’t know about any good shops, I can’t tell the difference between tapioca and jelly strips, and I don’t know what songs are trending. The only topics I can talk about are manga, anime, and games. I… don’t have any topics that would interest girls.”",
        "【TLN: Tapioca and jelly strips are probably those toppings inside drinks like milk tea. Or Thai tea.】",
        "I started talking faster halfway through, and I had to calm myself down.",
        "But that’s fine. Go ahead and mock me, ridicule me, or whatever.",
        "We’ll break up after this. Our marriage will be canceled.",
        "This is for the best. This way, no one will get hurt.",
        "Hah… But seriously, I really want to haunt my Dad forever for setting up such a ridiculous marriage.",
        "Ah… but maybe that’d come back to bite me in the future.",
        "I was thinking such useless thoughts in my head.",
        "“…W-who’s your favorite heroine right now?”",
        "“…Heh?”",
        "Watanae-san’s shoulders were shaking and her eyes were shut completely.",
        "Since she said something so unexpected, I accidentally made such a weird sound.",
        "Then, using every last brain cell I had, I tried to interpret her words correctly.",
        "“I can’t tell the difference between AKB-48 and Sakamichi Series, you know?”",
        "【TLN: AKB-48 and Sakamichi Series are famous idol groups, just like Hololive… Right?】",
        "“I mean, I can’t remember the faces of more than 40 idols either.”",
        "What?",
        "When she said ‘heroine’, I thought she was talking about a 3D idol group,",
        "As I was feeling confused, she just looked at me with eyes that looked upset and started pouting.",
        "“I said, who’s your favorite heroine right now? Didn’t you just say you could talk about anime and manga and games?”",
        "“What are you trying to do by asking me that?”",
        "“…What did you think I was going to do?”",
        "“I thought this was a scam to make me buy vases, paintings, supplements, or something like that.”",
        "“Why did you think I was trying to scam you?! I’m just genuinely interested in your hobbies!”",
        "“You’re not going to scam me or anything? Or, maybe you’re going to go on social media and mock me there? Make it go viral, or something like that?”",
        "“Ahh, mou! How can your thought process be so negative?!”",
        "At first, her voice was timid, but as we continued arguing, her voice gradually got louder and more vibrant.",
        "Eventually, she just quietly sighed.",
        "“…By the way, I’m rooting for the fourth sister. She looks so cheerful on the outside, but she also has a dark side hidden. That makes her so moe, you know?”",
        "“…!? Fourth… sister..?”",
        "Hearing what she just said, I don’t think any otaku wouldn’t know what she’s talking about.",
        "“B-by any chance, Watanae-san… Are you talking about 『The Five Fiances』?!”",
        "【TLN: The original title, Gotoubun no Hanayome, literally means ‘The Five Brides’. Here, the author wrote Gobunkatsu no Iinazuke, which basically just replaces ‘Bride’ with ‘Fiance’, so it becomes something like ‘The Five Fiances’.】",
        "“That’s what I’ve been saying…”“I’m rooting for the third sister! Her headphones are so moe!”",
        "As Watanae-san was pouting, I interrupted her as I shouted my favorite heroine.",
        "After looking at me blankly for a moment… Watanae-san giggled to herself.",
        "“Fufu… Why do you have such a niche preference?”",
        "“I mean, aren’t girls with headphones just really moe? Covering up her ears even though they’re usually exposed. Doesn’t it just give you this sense of immorality?”",
        "“Soo, you prefer less exposure?”",
        "“Uhh… That depends on the situation… Sometimes, I like characters with lots of exposure…”“Eeh? Isn’t that a little different from what you said earlier?”",
        "“S-so Watanae-san, do you have any specific preferences?”",
        "“Eh? I-I don’t really have any…”",
        "“Ah. That’s definitely what people say when they actually do have one. Even though your face looks pure, Watanae-san, maybe you have some unexpected tastes..?”",
        "“W-what are you imagining?! My preferences are completely wholesome!”",
        "“Then, why don’t you tell me?”",
        "“Uuu… It’s a little hard to explain. Usually, when you wear shirts, you leave the button on the top open, right? Otherwise, you’d feel suffocated.”",
        "“True. Unless I’m wearing a tie, I usually just leave it open.”",
        "“Right! So, what if all the buttons are buttoned even without wearing a tie? What do you think?”",
        "“…What do I think..?”",
        "“I mean, isn’t it just moe? Hiding the collarbone and neck, even though they’re usually exposed. Doesn’t it just give you this sense of immorality?!”",
        "“Wow, your tastes are too niche.”",
        "“Eh?! Isn’t your headphone fetish weirder?”",
        "“No, your button fetish is definitely weirder.”",
        "“Mou…”",
        "Watanae-san puffed out her cheeks as I kept pretending to be stubborn.",
        "Suddenly, our eyes met and we both burst into laughter.",
        "Then, we continued talking excitedly about more otaku-related topics.",
        "◆",
        "I’m experimenting a bit with the notes. Maybe they’re necessary, maybe they’re not? Maybe they’re too intrusive? Maybe I should just put it down here? Any suggestions are welcome, and any corrections to my translation are more than welcome.",
        "Also, Yotsuba? Really? I’m on Team Nino. Nino beats Yotsuba any day. Next chapter probably in 2-3 days."
    ]
}