{
    "id": "chapter-10-even-though-im-a-loner-she-thinks-im-cheating-on-her-1-2",
    "title": "Chapter 10: Even though I’m a loner, she thinks I’m cheating on her… (1/2)",
    "content": [
        "Today, I left the house together with Yuuka, as usual.",
        "First, I looked left and right to check my surroundings. After I was sure there wasn’t anyone around, I slowly started walking.",
        "“Today I’m going to school with Yuu-kun again~♪”",
        "“Is that some kind of daily morning greeting?”",
        "“Because it’s a phrase I’ve always wanted to say! A married couple going to school together is exciting!”",
        "“I’ve never heard someone say that… What kind of strange phrase is that? Also, we’re not married yet.”",
        "We continued our silly conversation as we headed towards school.",
        "Whenever we’re in quiet and deserted areas, Yuuka behaves just like when she’s at home, always lively and excited.",
        "Right now, she has her hair tied into a ponytail and she’s wearing her glasses, just like at school.",
        "Her expression is bright and joyful, an expression dedicated only to me.",
        "But, as we get closer to school, we make sure to slowly separate from each other.",
        "Then, we enter the classroom at slightly different times.",
        "…The more we do this, the more immoral I feel. It’s like we’re doing something scandalous. But whatever.",
        "◆",
        "Every day, Yuuka and I go about our school lives without showing any signs of intimacy to each other.",
        "『Yuu-kun, look over here!』",
        "But sometimes, Yuuka sends me Line messages, luring me into a trap.",
        "With firm determination and resolve, I ignored her message.",
        "『Come on, look over hereee. Mouu.』",
        "I’m begging you, please stop…",
        "Everyone would get suspicious if I looked at her.",
        "And then I’ll have to come up with a reasonable lie…",
        "“Why do you have such a serious face, hmm?”",
        "I was surprised because Masa had left his seat earlier.",
        "Someone had suddenly leaned on my shoulder.",
        "“…Nihara-san.”",
        "“Hey there, Sakata!”",
        "She smiled broadly and, without hesitation, brought her face close to mine.",
        "I quickly turned away in a panic.",
        "“You’re close, too close!”",
        "“Isn’t it fine? If you don’t move, then nothing will happen… Of course, if you do move, then we might accidentally kiss, you know?”",
        "“I’m telling you, that’s definitely not okay.”",
        "“Fuhaha! Then we’re okay like this, right?”",
        "She’s definitely enjoying herself, seeing me getting flustered.",
        "Haaah… This is why it’s so hard to deal with her.",
        "Nihara Momono.",
        "She’s one of the few girls… I mean, the only girl in class who talks to me so amicably.",
        "Her appearance has several unique charms.",
        "She has long, brown hair, and you can see her forehead peeking out from underneath.",
        "Her eyes are very bright and large, probably because of the makeup she wears.",
        "Her blazer, unbuttoned a little more than usual, is pushed up from the inside, probably because her chest area is a little too tight.",
        "She’s the kind of girl who dresses like a gyaru.",
        "Gyarus are extroverted people who get close to basically anyone.",
        "But, if you misunderstand their intentions and do anything weird or unwanted, they will instantly become hostile to you, which can lead to really bad situations.",
        "In a nutshell, that’s how dangerous gyarus really are… Well, that’s just my impression of them.",
        "I’ve been trying to treat Nihara-san as cautiously as possible, but for some reason, she keeps talking to me… a lot.",
        "“Anyways, haven’t you been looking around the classroom a lot lately? Usually you just stare out the window, or something like that.”",
        "“Why do you even know what I’m looki-… actually, nevermind.”",
        "“What’s going on? You found someone you like? Why don’t you try consulting with onee-san here?”",
        "“What do you mean ‘onee-san’? We’re the same age, aren’t we?”",
        "“Mmm, I’m an onee-san on the inside. Here, Sakata. You can dive into onee-san’s breasts!”",
        "She spread her arms wide, and her already large, conspicuous breasts stood out even more.",
        "Well, since I’m a gentleman…",
        "I sneaked a peek, then I quickly turned my eyes away.",
        "Someone should praise me for being able to hold myself back.",
        "“Mouu… You’re a really tough nut to crack, huh?”",
        "“Eh?! W-wait!”",
        "I could feel 2 bouncy lumps on my right arm.",
        "Ahhh… so soft… Am I in heaven?",
        "…Wait a minute! Isn’t this bad?!",
        "I hurriedly tried to shake her off, but she clung to me tightly and wouldn’t let go of me.",
        "Every time I moved my arm, I could feel a soft and bouncy sensation, and I could slowly feel my sanity slipping away.",
        "Nihara-san laughed as she saw me looking flustered and panicked.",
        "“Yay, it’s my win! You should just quietly accept my hug and enjoy it!”",
        "“You know… this has been on my mind for a while but, why are you always getting involved with me?”",
        "Nihara-san fell deep into thought, while she was still hugging my arm.",
        "Then, she smiled broadly.",
        "“Because I want to see the bright and cheerful Sakata once more.”",
        "“Wow…”",
        "Her comment made me feel really disgusted.",
        "There are only 2 people here who went to the same middle school as I did.",
        "The first one is Kurai Masaharu, or Masa.",
        "And the other one is… Nihara Momono.",
        "Everyone in high school knows me as the person who doesn’t stand out at all, a person who blends into the background.",
        "But Nihara-san… she knows the ‘me’ before high school.",
        "She knew I was an extroverted person, a person who was basically the center of the class.",
        "She also knew about my confession, and how I was completely rejected, and how I secluded myself at home… ultimately becoming a dark and gloomy person who stays hidden in the shadows.",
        "“Why don’t you talk more, like you used to? Why are you acting like a loner now? Do you have chuunibyou or something?”",
        "I don’t know what’s so funny, but Nihara-san started laughing out loud.",
        "I took the opportunity to quickly shake off Nihara-san and get out of my seat.",
        "“Haaah… Extroverted gyarus like you always seem to like getting all touchy-feely, and some people might misunderstand your intentions, so you should stop doing that.”",
        "“Ehh? I’m not really an extroverted gyaru, you know?”",
        "“Then, what are you?”“An introverted, gloomy country bumpkin.”",
        "What are you even talking about?",
        "In fact, why a country bumpkin? It’s not a country bumpkin is the opposite of a gyaru.",
        "“Actually, I’ll have you know that I don’t get all touchy-feely with just about anyone, you know? I’m not an easy girl.”",
        "Saying that, Nihara-san covered her chest with her arms and puffed out her cheeks.",
        "Then she brought her lips close to my ear.",
        "“…I’m only like that with Sakata…”",
        "“Hah?! What do you mean by that..?”",
        "“Pfft, hahaha! Sakata, you’re so flustered!”",
        "Nihara-san started laughing out loud again.",
        "Ah…",
        "I really can’t deal with gyarus. I can feel my past scars reopening…",
        "I really want to turn my phone on and ingest my daily dose of Yuuna-chan as soon as possible…",
        "As I was having those thoughts…",
        "From a seat far away, I could feel a deathly cold stare piercing right through me.",
        "And there, I saw a death god staring right at me.",
        "She wasn’t the usual expressionless and stiff Watanae Yuuka.",
        "Right now, she looked like she was in a really, really bad mood.",
        "I nervously picked my smartphone up and opened up Line.",
        "『Oh? Yuu-kun, aren’t you pretty close with Nihara-san?』",
        "『Umm… I feel like you’re a little too close to Nihara-san. Could you please try putting some distance?』",
        "『You looked at her breasts, didn’t you?』",
        "『Her breasts touched you, right?』",
        "『So, it’s all about the breasts, huh?』",
        "『You should just get married to breasts.』",
        "『Baka.』",
        "The messages gradually got colder and colder, just like how she is now. Obviously, I would get shivers running down my spine.",
        "What should I do… Because of that gyaru, I’m having my first crisis with my wife so soon…",
        "◆",
        "It’s Wednesday just as I promised. Got some illustrations, you can check them out here : V1 Illustrations."
    ]
}