{
    "id": "chapter-11-even-though-im-a-loner-she-thinks-im-cheating-on-her-2-2",
    "title": "Chapter 11: Even though I’m a loner, she thinks I’m cheating on her… (2/2)",
    "content": [
        "I was on my way home from school.",
        "I crossed the intersection and immediately turned right.",
        "Then, I stopped walking and looked up at the clear blue sky.",
        "Just as usual, there wasn’t anyone commuting on this road.",
        "“Yuu-kun.”",
        "While I was vacantly staring at the sky, Yuuka arrived a little later.",
        "Her cheeks were slightly puffed out, and she was clenching her fists tightly.",
        "She’s definitely angry…",
        "“First of all, could you let me explain the situation?”",
        "“Suure, let’s hear it.”",
        "“Nihara-san knew me from back when I was in middle school, which is why she gets involved with me for no reason at all. She just enjoys making fun of me… Actually, I’m almost certain she thinks of me as nothing more than a plaything.”",
        "“…Well, I guess you didn’t do anything, since Nihara-san was the one who approached you. That can’t be helped, I think. Besides, I never did prohibit you from talking to other girls.”",
        "Yuuka’s cheeks were puffed out.",
        "Rather than being angry, I feel like she’s just sulking.",
        "“But… Nihara-san is still being unfair…”",
        "“Unfair? What do you mean?”",
        "“Uuu… Anyways! She’s being unfair!”",
        "Yuuka puffed her cheeks out even more, and she put her hands over her well-sized chest.",
        "Ah… now that I think about it, all her Line messages were about breasts.",
        "“…Even Yuuna’s model had them pretty big, huh. In the game, she is said to have an F-cup. She’s a middle-schooler and her height is a mere 147cm, but despite that, her chest is a mass weapon of destruction. She is the perfect combination of cute and sexy. The imbalance between her innocent, child-like expression and her mature, adult body is so irresistible…”",
        "“Yuu-kun, are you an idiot?”",
        "…Yes, I’m sorry.",
        "I was definitely being inconsiderate just now…",
        "I just stayed silent for the time being, waiting for Yuuka to say something.",
        "“…Eii!”",
        "Boing.",
        "I suddenly felt a soft sensation on my arm.",
        "Yup, it looks like Yuuka is clinging onto my arm tightly.",
        "Yuuka’s hair was tied up in a ponytail, and I could smell a citrusy fragrance coming from her.",
        "I could feel Yuuka’s heat coming from her arm.",
        "Yuuka looked at me with upturned eyes and muttered:",
        "“They aren’t as big, aren’t they…”",
        "“Umm… what do you mean?”",
        "“They’re not as big as Nihara-san’s chest or Yuuna-chan’s chest, but mine should be sizeable enough, you know?”",
        "Yuuka pressed her body against my arm tightly.",
        "The soft sensation on my arm melted not just my arm, but my head as well.",
        "My heart rate went through the roof, and I couldn’t breathe properly anymore.",
        "I was speechless due to my racing heartbeat, but Yuuka seems to have misunderstood this as she pouted her lips.",
        "“I knew it, you like them bigger, don’t you? Another voice actor once told me that the bigger one’s chest is, the more boys will like them…”",
        "“Is the voice acting industry filled with people who like saying useless stuff like that?! Isn’t that his own preference?!”",
        "“But, Yuu-kun… You like Yuuna-chan, don’t you?”",
        "“I like Yuuna-chan herself! Not her breasts!”",
        "Even though I desperately tried to refute her logic, Yuuka didn’t look like she was convinced by my argument.",
        "“Muu… You better remember this, Yuu-kun.”",
        "Yuuka stopped clinging onto my arm and stuck her tongue out at me.",
        "“I’ll definitely get bigger soon!”",
        "Haah… why the hell is she trying to compete over chest size?",
        "For now, she looks like she’s recovered from her bad mood earlier, so I guess it’s fine.",
        "But… I should really remember…",
        "Even if we talk about anime or stuff like that, I should never ever bring up breasts when talking with Yuuka, because that would be a really bad idea.",
        "◆",
        "I know it’s really short, and I probably should’ve gotten this out yesterday, but I got those juicy color illustrations yesterday and I had to translate those too. I got more grayscale illustrations, but I’m figuring out where to put them. Another double release because there’s another mini-arc, so expect it to come out by… Saturday? Don’t quote me on that."
    ]
}