{
    "id": "chapter-31-i-tried-to-nurse-her-back-to-health-but-i-couldnt-make-rice-porridge-1-2",
    "title": "Chapter 31: I tried to nurse her back to health, but I couldn’t make rice porridge (1/2)",
    "content": [
        "“Yes. I think it’s the Great Scipio.”",
        "The teacher suddenly asked Yuuka a question, but despite that, she was able to answer without hesitation.",
        "Then, as Yuuka was trying to sit back down…",
        "She hit her elbow on her desk.",
        "“Ah… I’m sorry…”",
        "Yuuka bowed her head and took her seat, quickly trying to open her textbook in a panic.",
        "“…..?”",
        "For some reason, seeing Yuuka’s actions made me feel like something was out of place.",
        "How should I say this… I guess you could call it a fiance’s intuition?",
        "◆",
        "“*cough* *cough*”",
        "“I knew it…”",
        "As soon as we got home, I forcefully handed Yuuka a thermometer and had her take her temperature.",
        "And should I say I expected this? The display showed her temperature, clearly higher than normal.",
        "“Yuuka… You definitely caught a cold.”",
        "“I-I didn’t catch a cold! It’s just a temporary, inexplicable rise in temperature!”",
        "“Isn’t that scarier than a cold?!”",
        "Why is she being so stubborn and refusing to admit that she has a cold?",
        "“I’m just fine! I’m going to make dinner now!”",
        "“Wait, wait!”",
        "I hurriedly stopped Yuuka, who was trying to head for the kitchen with wobbly steps.",
        "“Muu! Don’t stop me! I’m going to make dinner!”",
        "“It’s okay, I’m going to be making dinner today.”",
        "“Making meals is my job! Yuu-kun’s job is to eat the meals!”",
        "“But, you’re not feeling well…”",
        "“I’m feeling just fine! My body is heating up because I’m getting fired up here!”",
        "“No, that’s just a cold. Your white blood cells are fighting right now.”",
        "Her cheeks were flushed, and she occasionally had a coughing fit.",
        "In fact, the general way she’s speaking seems to have regressed as well.",
        "It was clear that Yuuka wasn’t feeling well, but she refused to back down here.",
        "But… she looks so weak and languid. Making her cook dinner like this is just too…",
        "“Ah.”",
        "“What? Just so you know, no matter what you say to me, I’m still going to do my job!”",
        "“Yuuka, isn’t this… the special married couple event?”",
        "“The special married couple event..?”",
        "Yuuka twitched her eyebrows at the phrase.",
        "Okay, I think I’ve got a good grip on this.",
        "“Right. A wife who usually took care of her husband, but unfortunately fell ill.”",
        "“Yep, yep.”",
        "“So the husband thought, ‘We’ve always only done our own roles. So in times like these, what if we had an event where we switched places?’.”",
        "“So…”“We swap roles!”“…they’re kind of like us?”",
        "“Well, you’re not quite right, but I guess that’s the general idea.”",
        "Even after all that, Yuuka put her hand on her chin and groaned, still looking reluctant.",
        "Good grief, she’s being so stubborn here.",
        "But still, taking into account Yuuka’s poor health, I couldn’t back down here either.",
        "I resolved myself as I put both my hands on Yuuka’s shoulders and looked straight into her eyes.",
        "“Yuuka.”",
        "“Y-yesh?”",
        "Yuuka’s face turned red as the tips of our noses almost touched each other.",
        "I continued staring at her face as I started explaining.",
        "“Married couples help each other, right? When couples get married, I’m sure there are times when the wife will be feeling weak or troubled, and her husband will be the one to help her. That’s why… Let me nurse you back to health, just like what a husband should do for his wife.”",
        "“I-I’m gonna be nursed by Yuu-kun… with special technique..?”",
        "“For some reason, it feels like you’re implying something completely different?! In fact, you’re not speaking clearly anymore!”",
        "“I dun knoww! But, getting nursed by Yuu-kun…”",
        "And just like that, I managed to get Yuuka’s consent just barely…",
        "…before Yuuka fell unconscious right in front of me!",
        "◆",
        "For the time being, I carried Yuuka, who seemed to be having some sort of nightmare, into her room. I carefully laid her on her futon.",
        "Then, I placed an ice pillow on her futon and some ice packs on her forehead.",
        "I had a mug of barley tea ready on her bedside. This will help her hydrate herself when she wakes up.",
        "And to be extra sure, I also had a jello drink on hand.",
        "Right. For now, this should be good enough for nursing her.",
        "…So from here on out, true hell awaits me.",
        "“I did say I’d make dinner, but…”",
        "I’m not proud of this, but my cooking level is still at its starting level, level 1.",
        "I was more or less living alone before Yuuka came, but…",
        "I was so catastrophically bad at cooking that I just gave up and bought food at the convenience store.",
        "However, I’m dealing with Yuuka, who is sick right now.",
        "Obviously, I have to get her something good for her digestion and her health.",
        "…Okay!",
        "“…Ah. Hello, Nayu?”",
        "『…Haaah… What?』",
        "From the other side of my phone, I could hear my sister’s voice, clearly sounding displeased and sullen.",
        "But right now, the only person I can rely on… is Nayu.",
        "“Look, Yuuka isn’t feeling well right now. So I’d like to make her something that’s healthy and good for her. Nayu, I’m pretty sure you could cook fairly well, right?”",
        "『For the most part, yeah.』",
        "“Then, teach me how to cook something!”",
        "『No. Too much of a hassle.』",
        "“I hope you can somehow find it in your heart to teach me how to cook something.”",
        "『No. Is that something you’d ask from your little sister? Are you kidding me? You’ve lived by yourself before, right?』",
        "“As embarrassing as it is, you’ve got a point, but… I mean, come on. This is an emergency…”",
        "『Seriously, just google it.』",
        "*click*",
        "Nayu ruthlessly left me with those few words and hung up.",
        "What a heartless sister I have…",
        "“Haaah… Guess I’ll just have to google it…”",
        "Putting my hands on the kitchen counter, I let out a deep sigh.",
        "…Hmm?",
        "I noticed a notebook on the corner of the counter.",
        "『Yuuka’s secret recipe book!☆』was written on the cover.",
        "“Recipe book..?”",
        "◆",
        "Ko-fi"
    ]
}