{
    "id": "chapter-27-when-you-can-almost-see-under-the-skirt-but-cant-1-2",
    "title": "Chapter 27: When you can almost see under the skirt, but can’t (1/2)",
    "content": [
        "On the last day of Golden Week, Nayu left Japan again.",
        "As usual, she was very harsh with me, clicking her tongue at me and telling me to shut up.",
        "But for some reason, she wanted to shake hands with Yuuka.",
        "“Please get along with Nii-san… Seriously.”",
        "“Yeah! Nayu-chan, you should also come back to Japan sometime!”",
        "I couldn’t see Nayu’s expression because she hung her head really low, and I could only see the top of her head.",
        "Nayu’s tone seemed to be… softer than usual.",
        "◆",
        "“I hope Nayu-chan got home safely…”",
        "“She’ll be fine. She’s not the type of person to die just from something like a plane crash.”“That isn’t even human anymore, you know.”",
        "On the way to school, Yuuka laughed at my light-hearted comment as she retorted at me.",
        "The first day of school after Golden Week is usually a dreadful time for me, but… this year is different.",
        "This year, I have Yuuka with me, so I’m sure I won’t get bored.",
        "Somehow, before I knew it, going to school together with Yuuka became natural for me.",
        "“Yuu-kun, Yuu-kun!”",
        "But, I do feel somewhat troubled when she’s too intimate with me.",
        "Because… I don’t know when we might encounter someone from our class.",
        "Her ponytail was fluttering in the wind.",
        "She looks a little sharper and stiffer than at home because of her glasses, but…",
        "The way she smiles innocently at me is still the same Yuuka I’ve always known.",
        "◆",
        "“Hey there, Sakata! How have you been?”",
        "As soon as I sat on my seat, Nihara-san slapped me on my shoulders.",
        "Then, she sat on my desk with her long brown hair swinging in the air.",
        "Her dangerously short mini-skirt only went up to her thighs, and she even sat in a risky position.",
        "“Where are you looking, hmm?”",
        "Nihara-san laughed as she said such an absurd thing.",
        "“I-I’m not looking anywhere, you know?”",
        "“That’s a lie~ Just now, you were trying to look at my panties, weren’t you?”",
        "“No, I wasn’t. Please stop that.”",
        "“I mean, Sakata is a boy, so if I wore a skirt like this, you’d obviously be interested, hmm?”",
        "“Please stop that. You’re mistaken. It’s the truth. Please believe me.”",
        "Nihara-san might be joking here, but I really want to stay alive.",
        "Because if I’m careless here, my social life is as good as dead.",
        "I can now understand how those old men who are falsely accused of molestation feel…",
        "“…Nihara-san. Do you have a moment?”",
        "I heard an extremely cold voice that froze the air around us in an instant.",
        "“Watanae Yuuka” suddenly came up to us and cut into our conversation.",
        "“Hey there, Watanae-san! We should hang out at karaoke again some ti-”",
        "“Nihara-san… Your appearance is vulgar.”",
        "Without moving a single eyebrow, Yuuka mercilessly cut her off.",
        "“I-It’s a catfight!”",
        "【TLN: Catfight = fight between women】",
        "Masa was watching the scene as he said something nonsensical.",
        "It looks like news spread quickly as everyone else began making a commotion as well.",
        "But Yuuka isn’t the kind of person who cares about the atmosphere.",
        "“Nihara-san. Sakata-kun is looking at you with vulgar eyes. It’s disrupting public morals. Stop it.”",
        "“I-I wasn’t lo-”",
        "“Sakata-kun.”",
        "Yuuka’s voice was ice cold.",
        "She only called me by my last name, but it felt so serious, like a death sentence… I ended up staying completely silent.",
        "Perhaps Nihara-san sensed the strange atmosphere around us as she quickly got off my desk.",
        "“Well, Sakata-kun is a quiet and reserved person, so if a beautiful girl like me were to dress inappropriately, obviously he’d burn the image deep into his memory.”",
        "“I didn’t do that. Please stop that. I didn’t do any of that. You’re mistaken.”",
        "“Whether you saw it or not… you can’t prove it at all.”",
        "【TLN: The last line sounds like it’s from Yuuka】",
        "In contrast to the light-hearted Nihara-san, Yuuka kept her cold demeanor.",
        "And with an icy expression on her face that I’ve never seen at home or at school, she said.",
        "“In any case, I think… it’s disgusting to be sexually aroused by a girl’s body.”",
        "◆",
        "“Hmph! Yuu-kun, you baka! Baka! You got aroused because of Nihara-san’s bare legs! Disgusting! You’re the worst!”",
        "Yuuka’s IQ dropped by about 50 points.",
        "I thought she was mad at me because I went home before her, but seeing how Yuuka carelessly threw her bag as she puffed out her cheeks in the living room, it looks like it might be something else.",
        "“U-umm, Yuuka…”",
        "“You saw it, didn’t you? You pervert!”",
        "“You can’t prove whether I saw it or not, you know?”",
        "“Aaah~ Aaah~ I can’t hear your excuses! Wow, I can’t hear anything, you know? That’s because you keep making excuses!”",
        "“Isn’t it because you’re covering your ears?!”",
        "No matter what I said, Yuuka kept sulking and pouting.",
        "She tightly shut her eyes and covered her ears as she stuck her tongue out at me.",
        "She had an indescribably silly expression right now.",
        "Seeing her like that, I couldn’t hold back anymore as I burst out in laughter.",
        "“Why are you laughing here?! Even though I’m really mad at you!”",
        "“Yeah, yeah. You’re really mad, aren’t you?”",
        "“I might stay in a bad mood like this forever… Ahh… Yuuka-chan is so pitiful…”",
        "“Geez, are you sulking that much?”",
        "“Uwaa! You’re so defiant!”",
        "I bowed my head to Yuuka, who was making a ruckus.",
        "“Okay, Yuuka. I’m sorry.”",
        "“I can’t hear you~”",
        "“I said I’m sorry…”",
        "“I really can’t hear you at all~”",
        "“That’s because you’re covering your ears… Wait, can’t you hear me right now?!”",
        "We weren’t making any progress, so I grabbed Yuuka’s arm and pulled her hand away from her ear.",
        "As a result, I’m in a position where I’m grabbing both of Yuuka’s arms.",
        "“…Your face… is too close…”",
        "Our noses were so close, they were almost touching. Yuuka awkwardly pulled away from me and pouted her lips.",
        "I hurriedly looked away from Yuuka.",
        "And so, with an indescribably complicated atmosphere… both of us stayed silent for a while."
    ]
}