{
    "id": "chapter-9-my-friend-called-her-his-wife-isnt-he-being-overfamiliar",
    "title": "Chapter 9: My friend called her his \"wife\". Isn't he being overfamiliar?",
    "content": [
        "『I… I don’t want to go home yet… because today, I had so much fun… Which is why, I will never go home for the rest of my life! That way, we’ll have so much fun for the rest of our lives, won’t we?』",
        "“Woooo! A god-tier event!!!”",
        "Masa started making this weird sound in celebration right next to me. Because of that, my overwhelming excitement started dying down.",
        "Without paying any attention to me, Masa started doing this weird dance with the phone in his hand. It was like a dance of some ethnic group celebrating a good harvest.",
        "“Oi, Yuuichi. Why do you look so emotionless? Isn’t this an event for your favorite heroine, Yuuna-hime?!” “You got ridiculously excited and that was kinda gross.”",
        "We gathered in Masa’s room, and each of us tried rolling at the gacha in Alice Stage. And when I won Yuuna’s SSR, I unlocked a special episode.",
        "Here’s the rundown of the special episode.",
        "I take Yuuna on a date to an amusement park with lots of intense attractions, while Yuuna tries to act tough.",
        "We go on one of the fastest rollercoasters in Japan, and Yuuna, obviously scared as hell, says, “I-I’m fine with this! Perfectly fine!”",
        "…In the end, she screams really, really loudly.",
        "After we got off the rollercoaster, Yuuna-chan hit me over and over, with tears in her eyes. Thus, we enjoyed our date until the sun went down, and then we slowly walked towards the exit. Yuuna-chan held the hem of her skirt tightly and looked at me with cute, upturned eyes, as she said:",
        "“I… I don’t want to go home yet… because today, I had so much fun… Which is why, I will never go home for the rest of my life! That way, we’ll have so much fun for the rest of our lives, won’t we?”",
        "To put it mildly… she was a goddess. I don’t care if I end up in an amusement park for the rest of my life. Yuuna-chan definitely helps bring a smile to my face.",
        "“I knew it, Yuuna-hime is my wife!” Masa looked excited as he said such ridiculous things. I felt irritated and glared at Masa.",
        "“Masa, isn’t your favorite heroine Ranmu-chan?”",
        "“Haaaaaa~ Ranmu-samaaaa~”",
        "“Are you a baby or something?”",
        "“Ranmu-chan is my… my mama! And, Yuuna-hime is my wife!”",
        "“Everything you just said… do you have any idea how disgusting they sounded?”",
        "“Shut up! I live and breathe for Alice Stage! I don’t give a crap about other people’s opinions!”",
        "He does have incredible determination… to a certain extent. I guess I am pretty impressed… not.",
        "“Anyways, you can’t choose Yuuna-chan. Because… Yuuna-chan is my wife.”",
        "『Greetings to all Alice Stage players! I’m the voice actor for Yuuna-chan, Izumi Yuuna!』",
        "At that very moment, my smartphone started playing an ad from Alice Stage.",
        "She usually had her black hair styled into a ponytail, but this time, she had long brown hair. She’s probably wearing a wig to act as a fictional character and protect herself from getting doxxed.",
        "She was dressed in a pink tunic, a checkered miniskirt, as well as some black kneesocks. This is probably fanservice, since everything she’s wearing is exactly the same as Yuuna-chan.",
        "She wasn’t Watanae Yuuka right now. She was Izumi Yuuna.",
        "『Is everyone enjoying Alice Stage?』",
        "“Yeahhhhhhhh!!!”",
        "Masa shouted right next to me. I hit him on the head, telling him to quiet down. Then, he just stared at my screen, where she continued talking.",
        "『Yuuna is a naive but mischievous child, and a natural airhead who can’t seem to do anything right… That’s how pure and innocent she is.』",
        "She kept smiling as she continued.",
        "『Please keep supporting me from now on! Or else, Yuuna won’t let you off so easily!』",
        "The ad disappeared, and the screen went back to the game. But I was a little disoriented as I was unable to move, still holding my phone in my hand.",
        "“Izumi Yuuna…” Masa seemed deep in thought as he muttered those words.",
        "“Didn’t she just debut as an Alice Stage idol? What’s more, she’s a high school student just like us. I’m sure she’s definitely dreaming of becoming a voice actor and working as hard as possible with her frail and tiny body. But even after all that, she never forgets to keep smiling happily. Isn’t she just too cute?”",
        "“…Is that so?”",
        "I vaguely replied to Masa as my gaze wandered around.",
        "“Of course, I’m sure she’s working really hard as a voice actor. But girls like her, don’t they have 2 sides to them?”",
        "“Isn’t that fine? I love it when they have gaps like that!” 【TLN: You probably know gap moe, where a person has 2 different sides, which is considered cute. Can be a matter of appearance, personality, or both.】",
        "“Your interests are way too broad, Masa… I’m telling you, you should give up on Izumi Yuuna. 100%.”",
        "“Why are you so harsh on her? I feel bad for my wife…”",
        "“What are you talking about?! She’s my wife!”",
        "As soon as I said that, I quickly shut my mouth in a panic. Oh no… I got caught up by Masa’s excitement… Our relationship, is it finally going to be exposed..?",
        "“Y-you… No way…” Masa looked at me with a serious face. I’ve never seen him this serious before.",
        "Cold sweat was running all over my body. My heart was pounding so hard.",
        "D-damn… Has he found out the truth?",
        "“You… do you like Izumi Yuuna that much?”",
        "Yup, him finding out about our relationship is basically impossible. Thinking about this calmly, there’s no way anyone would suspect that a young voice actor would be a high school student nearby, and married on top of that.",
        "◆",
        "“…And that’s what happened today.” While I was having dinner with Yuuka, I told her everything that happened today. I was only having a casual conversation. Just a chat between friends. But, Yuuka suddenly said: “Ehehe… He said “She’s my wife!”… Ehehe~”",
        "She looked so happy, smiling and laughing bashfully. In fact, she looked a little too happy, so I corrected her in case she misunderstood.",
        "“No, when I said “wife”, I was referring to the ones in 2D, you know?”",
        "“Ehehe~”",
        "“It wasn’t my intention to say anything that extreme, you know?”",
        "“Ehehe~”",
        "“You aren’t listening to me at all, are you?!”",
        "Well, I definitely did feel somewhat uncomfortable when Masa kept calling her his “wife”. I won’t say anything more than that though.",
        "◆",
        "Finally after a whole century, another chapter. I’m way past my bedtime right now so I’ll keep it short. Any suggestions or corrections are more than welcome, especially since I was a little sleepy working on this chapter. Next release will be 2 chapters, because there’s another mini-arc coming up. Expect it to come out by… Wednesday..?"
    ]
}