{
    "id": "chapter-8-guys-how-do-you-call-your-fiance",
    "title": "Chapter 8: Guys, how do you call your fiance?",
    "content": [
        "It takes about fifteen minutes to walk home from school.",
        "After walking for a while, I crossed an intersection and immediately turned right.",
        "I’ve never seen anyone from my school go home through this road.",
        "There aren’t many people taking this route in the first place, so I often arrive home without seeing anyone.",
        "As I was walking on that peaceful and quiet road…",
        "“Yuu-kun!”",
        "It was probably the first time someone had called out to me on this road, and on top of that, it was with an extremely friendly and intimate tone.",
        "I turned around in a panic and saw Yuuka-chan waving at me, seemingly out of breath.",
        "“Hey, hey! We’re still on the way home! Don’t call me Yuu-kun so loudly!”",
        "“Oh, sorry! Sakata-kun, I was trying to catch up with you, you know?”",
        "No, but, just changing how you call me won’t really solve the underlying issue…",
        "“…You’re still trying to keep our engagement a secret, right?”",
        "“Of course! You said that you didn’t want to be teased or run into any other troublesome things!”",
        "“Right?”",
        "“…But, catching up with your fiance and going home with them is… kind of exciting.”",
        "“…You did say you’re trying to keep our relationship a secret, didn’t you?”",
        "“Of course!”",
        "I couldn’t help sighing at her response.",
        "Yuuka-chan just laughed innocently beside me… She’s completely different compared to the Watanae Yuuka at school.",
        "I’m sure she’s trying to be careful, but her actions don’t seem to match her intentions.",
        "As expected of Yuuna-chan’s voice actor… Both of them are natural airheads.",
        "◆",
        "A little while after I got home, the movers rang the doorbell.",
        "Yuuka-chan’s belongings were being brought into the room that Nayu had used up until last year.",
        "Little by little, the room was being dyed with Yuuka-chan’s colors.",
        "“Hmm… This one goes here, that one goes there…”",
        "Even after the movers left, Yuuka-chan was absorbed in tidying up her stuff.",
        "I felt uneasy staring at a girl’s room, so I went back to the living room alone.",
        "There was a cardboard box carelessly placed there, still unopened.",
        "After the last box was carried into Yuuka-chan’s room, I was reminded once again that from now on, I was going to be living together with her.",
        "“Yuu-kun, sorry for keeping you waiting~”",
        "As I was still thinking about various things, Yuuka-chan, who seemed to have finished cleaning up, suddenly came into the living room.",
        "She had black hair that reached her shoulders. It was untied right now, unlike at school.",
        "When she took off her glasses, her eyes looked kind of droopy and cute.",
        "She showed off her light blue dress and smiled like a puppy.",
        "“You know, when I was moving my stuff into my room, it reminded me once again that I was going to be living together with Yuu-kun starting today…”",
        "After saying that, Yuka turned her head down, looking flustered.",
        "After seeing Yuuka-chan like that, I also felt embarrassed, I couldn’t help but look away too.",
        "There were two cups on the table.",
        "One of them was my black mug that I always use.",
        "The other one is Yuka-chan’s mug with a conspicuous rabbit character on it.",
        "“Yuu-kun.”",
        "Yuuka-chan called out to me out of nowhere.",
        "“What’s wrong, Yuuka-chan?”",
        "“Yuu~kun~”",
        "“For some reason, that just now sounded like an animal…”",
        "“Hmmm…”",
        "Yuka crossed her arms and tilted her head with a serious look on her face.",
        "I don’t know what she’s thinking about, but it looks important.",
        "“We call each other Yuu-kun and Yuuka-chan, but is that really okay as fiances?”",
        "“Eh? Isn’t it just fine?”",
        "“No. In anime, there are many other ways… I think it would be a good idea for us to use the most fitting way.”",
        "Before my mind could catch up, Yuuka-chan put her index fingers together and said bashfully:",
        "【TLN: Imagine something like this.】",
        "“Umm… D-dear…”【TLN: Uses “Anata” here, used by wives to refer to their husband】",
        "The living room fell completely silent.",
        "Yuuka-chan’s face turned completely red.",
        "I felt like I was looking at something I shouldn’t be looking at. I quickly turned my eyes away.",
        "“…O-of course that would be embarrassing, wouldn’t it…”",
        "“W-well then, maybe ‘honey’?” 【TLN: Uses “Danna-sama” here, also used by wives to refer to their husband】",
        "I almost blew out the tea I had in my mouth.",
        "“How are you saying all that with such a serious face?! Also, isn’t that even more embarrassing?”",
        "“So, darling?” 【TLN: Literally uses “daariin” in katakana here】",
        "“Are we some kind of lovebirds?”",
        "“You’re so cold… Master…” 【TLN: Uses “Goshuujin-sama” here】",
        "“That one has a completely different meaning!”",
        "Yuuka-chan was so shy at first…",
        "Maybe she got more excited as we continued talking.",
        "Or maybe, her instincts as a voice actor took over.",
        "She was slowly getting more absorbed into some kind of roleplay…",
        "“I, Yuuka… will do my best to serve my master today-nya~ ☆”",
        "◆",
        "A few minutes later.",
        "There was a depressed girl lying face down on the desk, saying, “I went too far…”",
        "“Geez… You got too carried away…”",
        "“…So embarrassing…”",
        "There’s such a huge gap between the Yuuka-chan at school and the Yuuka-chan at home. I can’t believe they’re both the same person.",
        "“You’ve tried almost everything, so are you satisfied now?”",
        "“Hmm… but…”",
        "She’s already tried so many different names, and she’s still not satisfied?",
        "“I’m just fine with Yuu-kun because it makes me feel special.”",
        "“But Yuuka-chan is…”",
        "“Hm?”",
        "“Yuuka-chan doesn’t make me feel special…”",
        "Yuuka-chan looked depressed, but suddenly she stood up excitedly and pointed at me.",
        "“There are some girls who call me Yuuka-chan too. It feels too ordinary.”",
        "“Is ordinary not good enough?”",
        "“It’s not! I mean, we’re going to get married one day so…”",
        "She was so excited before, but now her voice was weak and she had a frown on her face.",
        "It reminds me of a rollercoaster since her expressions change so frequently.",
        "It’s hard to believe that she’s the voice actor for Yuuna-chan.",
        "She’s a lively and clumsy girl, who gets depressed just because she overdid something.",
        "Seeing Yuuka-chan so depressed, it felt like I was looking at a cute little animal who couldn’t be left alone. I had to do something…",
        "“…Yuuka.”",
        "“Eh?!”",
        "Yuuka looked very surprised when I called her that. I then told her calmly:",
        "“What if I just called you Yuuka? It should give off a special feeling, if only a little…”",
        "“W-wawawawa…”",
        "Yuuka, who was at a loss for words, was shaking her head really fast.",
        "I laughed out loud at such an honest and sincere Yuuka.",
        "“Well then, I’ll say it once again. Please treat me well from now on, Yuuka.”",
        "“Yuu-kun.”",
        "“Yeah?”",
        "“Yuu-kun, Yuu-kun.”",
        "“What, Yuuka?”",
        "“Just calling your name~ Yuu-kun, Yuu-kun, Yuu-kun… Ehehe~”",
        "She kept repeating my name over and over, just for the sake of it. Looks like she’s enjoying it because right now, she was smiling happily. Even though our conversation seemed mundane and pointless… Surprisingly, I ended up thinking that something like this wasn’t too bad… “Yuu-kun, Yuu-kun! Yuu-kun, Yuu-kun! Yuu-kun? Yuu-kun!!! Y-yuu-kun?!” “Why did the last one sound like I was dying?!” She really does like taking things too far, this girl…",
        "◆",
        "So, after 3 days of lazing around, I finally got another chapter out. I think I’m just making excuses, about the “quality” and blablabla. I’m just a lazy person, so forgive me hehe. Expect the next chapter by Saturday or Sunday. Don’t get your hopes too high though."
    ]
}