{
    "id": "chapter-22-my-little-sister-asked-me-if-id-already-graduated-from-my-virginity-how-should-i-object-here-2-2",
    "title": "Chapter 22: My little sister asked me if I’d already graduated from my virginity. How should I object here? (2/2)",
    "content": [
        "“Eh, Nayu-chan?!”",
        "When Yuuka came home, she was surprised to see Nayu relaxing in the living room with her phone in hand.",
        "“What’s going on? When did you come back to Japan?”",
        "“A few hours ago, or something.”",
        "“I’m sorry. I wanted to prepare something delicious for you…”",
        "“It’s fine. I ate pepero.”",
        "“Pepero..?”",
        "“She ate peperoncino earlier. Nayu, you should be a little more sociable.”",
        "“Whatever. That’s just how I am.”",
        "“I see. Was Yuu-kun’s peperoncino delicious? Well, I’m sure it was just frozen food, though…”",
        "“!!! Yuu-kun?!”",
        "I don’t know which part of Yuuka’s statement caught her attention, but Nayu’s eyes suddenly widened.",
        "Then, she placed her phone on the table as she stood up shakily, looking up at Yuuka.",
        "Nayu still had the same sour look on her face and the same bad attitude.",
        "But, Yuuka suddenly laughed when she saw Nayu like that.",
        "“…What are you laughing at.”",
        "“Mmm, sorry. I was just thinking how cute you are.”",
        "“Hah?! Are you making fun of me?! Me, cute?!”",
        "Nayu kept yapping and barking, just like a dog.",
        "Yuuka’s cheeks melted as she watched Nayu.",
        "“How nice… Having a sister like Nayu… We could go shopping together, we can have dress-up parties, and more. That sounds like a lot of fun…”",
        "“I don’t do any of those things at all. Or rather, don’t just go treating me like I’m your sister or something.”",
        "Nayu was clearly flustered.",
        "It’s unusual for her to be so shaken like this.",
        "“What are you looking at? I’m not some kind of attraction, you know?”",
        "“Yes, yes. I won’t look at you anymore.”",
        "“Fufu. Well then, Nayu-chan, I’ll make dinner for you! After I change my clothes, I’ll do my best to make you a feast. You should think about what you want for dinner, okay?”",
        "After she said that, Yuuka immediately started walking to her room to change her clothes.",
        "“Wait, Yuuka-chan.”",
        "Nayu stopped Yuuka with a sharp tone.",
        "Yuuka and I reflexively looked at each other.",
        "“Umm, Nayu-chan?”",
        "Yuuka looked confused as she tilted her head to the side.",
        "Without any hesitation, Nayu said something really absurd.",
        "“Change your clothes here.”“…Eh?”",
        "“We’re all family, aren’t we? It shouldn’t be embarrassing or anything.”",
        "“Eh?!?!”",
        "Yuuka’s face turned red as she screamed.",
        "Nayu grinned boldly, probably since she was amused by Yuuka’s reaction.",
        "“I mean, you’re married with Nii-san, right? How do you guys do your laundry? Don’t tell me you wash your clothes separately? Even though you two are married, you can’t even show your underwear to each other? Is that really how you’re going to live the rest of your lives? That’s absurd.”",
        "“That’s the first time I’ve ever heard anyone actually use that word.”",
        "【TLN: The word she used for absurd (ちゃんちゃらおかしい) sounds like a rare Japanese word, which explains the MC’s response. Never heard it used before, or maybe it’s just me.】",
        "I retorted at Nayu as I bonked her on the head.",
        "“Oww… What the hell are you doing?”",
        "“Why are you saying such ridiculous things? We’re not even married yet, we’re still fiances anyways.”",
        "“Don’t you know the phrase ‘there’s no time like the present’? If you two were married, then it wouldn’t be such a big deal.”",
        "“But, still… something like that is…”",
        "Yuuka looked down bashfully as she squirmed and rubbed her thighs together.",
        "“See? Yuuka also thinks the same way. This conversation is over.”",
        "“Haa… Nii-san, you never change. As soon as you’re embarrassed, you change the subject. Ever since you shut yourself at home and got obsessed with 2D girls, you haven’t grown up at all. Even with Yuuka-chan here, you still haven’t changed whatsoever.”",
        "“Aren’t you exaggerating there?! Weren’t we just talking about underwear?!”",
        "Why is she getting more and more grumpy?",
        "I’ve always been confused about my sister, but today I’m feeling even more confused.",
        "Meanwhile.",
        "Nayu glared at me with scornful eyes as she muttered.",
        "“…Nii-san, tell me honestly. You’re living with Yuuka under the same roof, and you seriously don’t want to see her in her underwear?”",
        "“I didn’t say that, but…”",
        "“You’re not denying it?!”",
        "Yuuka was surprised as she looked up at me.",
        "Her eyes were slightly moist, and I could see a tint of embarrassment in them.",
        "Seeing Yuuka’s reaction, Nayu grinned like a little devil.",
        "“That’s right. Nii-san actually wants to see you in your underwear. All boys are wolves, and he is no exception.”",
        "“Yeah… I’ve seen this in a doujinshi before…”",
        "“So? To satisfy Nii-san’s lust for you… Why don’t you undress?”",
        "I silently swung my fist down on Nayu’s head.",
        "The blow to her head must’ve been effective, because Nayu immediately collapsed to the floor in agony.",
        "“Owwwww…”",
        "“Haa… Sorry, Yuuka. My sister must’ve really been a bother.”",
        "“I’m the one who should be sorry! Because Yuu-kun… actually wanted to see it, right?”",
        "“…Huh?”",
        "Yuuka’s unexpected words made me froze in place.",
        "I don’t know what she thought of my reaction, but Yuuka closed her eyes tightly.",
        "She clenched her fists tightly and said:",
        "“I-I can’t do that today… because my underwear is too childish! Showing this underwear to you is too embarrassing… I can’t!”",
        "— “This underwear”",
        "Eh? So, if she was wearing different underwear, some proper and better underwear, then it’d be okay?",
        "I got really dizzy, and my head was spinning.",
        "Seeing Yuuka blushing and acting embarrassed made my heart tighten.",
        "Perhaps flustered by my reaction, Yuuka’s face turned red as she said.",
        "“Ah… U-umm… I-I also can’t do it t-today because… I-I haven’t mentally p-prepared myself yet…”",
        "“Ah… N-no, I-I don’t really m-mind. Y-you can do it at your own p-pace.”",
        "My words were slurred.",
        "I felt like my brain was about to short-circuit.",
        "“…Tch.”",
        "Seeing us in such a delicate mood, Nayu looked unhappy for some reason.",
        "“Nayu. What do you have to say for causing such a huge ruckus?”",
        "“…I think there are people in this world who like childish underwear.”",
        "I silently ground Nayu’s temples from both sides.",
        "【TLN: I guess you can imagine something like this?】",
        "What kind of person does she think I am?",
        "Even though we haven’t kissed yet, something like seeing her in underwear… is way too early.",
        "As we were arguing about various things…",
        "I can’t ever tell this to the both of them, but I ended up imagining what Yuuka’s underwear would look like."
    ]
}