{
    "id": "chapter-23-i-knew-that-entering-the-bath-together-was-a-bad-idea-but-1-2",
    "title": "Chapter 23: I knew that entering the bath together was a bad idea, but… (1/2)",
    "content": [
        "“So, do married couples enter the bath together or something?”",
        "Nayu suddenly said something like that, and Yuuka and I both spit out our miso soup.",
        "I wiped my mouth and took a deep breath. Then, I started scolding Nayu.",
        "“Nayu. That kind of thing never happens.”",
        "“Yeah! That’s a little… too much, Nayu-chan!”",
        "“Seriously? Dad used to say, ‘When we were young, your mother and I used to enter the bath together… I just want to die…’ or something like that, so I was just curious.”",
        "“Haa… if Dad doesn’t want to relive those memories, then he shouldn’t have brought it up… So, Nayu? What do you think of your father who said those kinds of things.”",
        "“Ew, gross.”",
        "Right?",
        "If I was a girl, I’d consider disowning him too.",
        "“But, I think he has a point. People do say that getting in the bath naked together makes you closer to them.”",
        "“Don’t people only say that when both of them are of the same gender?!”",
        "“That’s right! 2 men bonding together in the onsen… The senpai’s face would be flushed, his wide back in full view. And the kouhai staring at him would be unable to hold himself back, and…”",
        "Yuuka, Yuuka!",
        "We’re not talking about BL here! Calm yourself down!",
        "“Seriously, Nayu… Why do you always talk about weird things…”",
        "“Since she’s marrying Nii-san, I want her to do her best to satisfy Nii-san…”",
        "“But, I’m not dissatisfied or anything like that right now.”",
        "“I don’t think your relationship together is bad or anything. But, how do I say this… You two still don’t look like a married couple right now.”",
        "“It’s fine. We’ll just progress at our own pace.”",
        "Well, I guess I understand why Nayu is trying to say.",
        "Even though I try to keep my distance from 3D girls, I’m still a healthy boy in high school.",
        "I’d be lying if I said I’d never had times when I felt horny or stuff like that.",
        "But, when I think that I might end up hurting her in the process, I get scared of trying to approach her myself—",
        "“I-I’ll do it! I’ll… take a bath together with Yuu-kun!”",
        "As I was thinking about how I lacked courage, Yuuka dropped a bombshell on me",
        "Her completely unexpected words shook me.",
        "“Y-Y-Y-Yuuka?!”",
        "“I-I mean, we’re going to get married in the future, so… shouldn’t we try to get to know each other a little better? I also want to make Yuu-kun feel much happier too, so…”",
        "“Mmm. That’s a great mindset to have.”",
        "No, no, no, I think this conversation is getting out of hand.",
        "Why are you smiling so boldly there, my dear sister?",
        "“Are you ready to work hard so that Nii-san can live every day with a smile on his face?”",
        "“Of course! Because… I’m Yuu-kun’s wife!",
        "“…Tch.”",
        "And so, this is how me and Yuuka ended up taking a bath together.",
        "◆",
        "I was sitting down on a stool, with the showerhead turned on. I could feel the running water splashing on my head.",
        "The powerful stream of water helped me to calm myself down a bit. My head cools down a bit as I’m hit with a powerful stream of water.",
        "I’m in my bathroom right now.",
        "Of course, this means that I’m naked.",
        "I have a bath towel wrapped around my lower body, but nothing on my upper body.",
        "Yes, I was naked.",
        "“Fuu…”",
        "As I listened to the sound of the water hitting the floor, I thought about what was about to happen.",
        "—Yuu-kun, don’t stare at me too much…",
        "—But, because it’s Yuu-kun… I’d be fine… even if you touched me… you know?",
        "*splash* *splash*",
        "I took the showerhead and pointed it directly to my face.",
        "It hurt… a lot.",
        "My lips were puckered too.",
        "But, if I hadn’t done that… The imaginary Yuuka in my head would’ve driven me mad.",
        "“Yuu-kun.”",
        "I freaked out for a second… Calm down, Yuuichi.",
        "Even though it’s Yuuka, she’s still a 3D girl.",
        "Unlike 2D, there’s not going to be any sort of convenient or cliched development here.",
        "—But, because it’s Yuu-kun… I’d be fine… even if you touched me… you know?",
        "*bang* *bang*",
        "I slammed my head against the edge of the bathtub.",
        "I got too excited. Again. And, I hit myself to get rid of these wicked thoughts. Again.",
        "It really, really hurt.",
        "“Wait, Yuu-kun?! I heard a really terrifying sound! Are you okay?”",
        "“I-I’m fine… I just had to exorcise a demon.”",
        "“But, that definitely sounded more like you were being possessed by a demon…”",
        "Well, she wasn’t far off the mark, so I couldn’t say anything.",
        "“Nii-san. Have you purged yourself of your worldly desires?”",
        "Nayu’s stone-cold voice could be heard from outside the bath.",
        "As expected of my sister, she saw right through what I was doing.",
        "“Okay, Yuuka-chan is going to join you now. I hope you two get along in there… Tch.”",
        "“Hey, what was that ‘tch’ for?! You’re the one who got us in this situation in the first place!”",
        "“Shut up.”",
        "Nayu completely ignored my retort.",
        "Immediately after that, the bathroom door opened.",
        "And what I saw…",
        "…was Yuuka, wearing her school swimsuit."
    ]
}