{
    "id": "chapter-41",
    "title": "Volume 1 Short Story",
    "content": [
        "☆To the Grim Reaper in Love☆",
        "…When I was in middle school",
        "Everyone knew me as an otaku who was very talkative.",
        "I spent a lot of time talking about stuff like anime and manga with my close friends.",
        "That was the kind of girl I was.",
        "Maybe that’s the reason I stood out. I don’t know.",
        "Around the summer of my 2nd year in junior high, an influential girl in my class started messing with me.",
        "At first, I just put up with her treatment, but…",
        "My close friends stopped talking to me, probably because they didn’t want to get dragged into it.",
        "It felt like a thread had been cut.",
        "In the winter of my 2nd year, I stopped going to school.",
        "I was scared of going to school.",
        "That’s why I shut myself at home, reading light novels, reading manga, and watching anime.",
        "I wanted to find somewhere that was as far from reality as possible, somewhere that could cheer me up.",
        "And as I spent my time at home like this, I gradually began to imagine how nice it would be if I could make a world like that myself.",
        "But I had no talent, both for writing and for drawing.",
        "Then I remembered, Ah… but when I was really young, there was that one time I was praised for my voice…",
        "Even back then, I always had a tendency to act on the spur of the moment. Once I set my mind on something, I’d do it right away.",
        "Even though I was skipping school, I thought, This is the one thing I have to do!",
        "So, I took the Shinkansen and left my hometown as I headed to Tokyo.",
        "I took the audition for『Love Idol Dream! Alice Stage ☆』",
        "I never thought… Not even in my wildest dreams, that I would pass the audition.",
        "“Hello. I’ll be working with you starting today.”",
        "The first time I entered the office.",
        "Hotta-san greeted me kindly, but I was so nervous that I just kept quiet and bowed repeatedly. I’m sorry.",
        "After graduating from junior high school, I moved to Tokyo and started living alone.",
        "I became a voice actress, called Izumi.And I more or less started going to school.",
        "I guess it was just as I expected… I got really nervous at school, and I couldn’t talk to people very well.",
        "But, whenever I did my work as a voice actress, I was somehow able to talk to people.",
        "I’d talk a little too much though, and that wasn’t good.",
        "Then, I became Yuuna.",
        "I breathed life into Yuuna as Izumi Yuuna. And my first line was:",
        "“Yuuna-chan will always be right by your side~ So, why don’t we both smile together~”",
        "Even though the line was short, it didn’t go well at all. I couldn’t voice the line properly.",
        "The sound producer was shocked too.",
        "I felt so depressed.",
        "I thought that if I became a voice actress, I’d be able to make a fresh start in life.",
        "But in the end, no matter what I do, it’s just useless, huh…",
        "That was how I thought as I spent my days feeling depressed in my empty apartment room.",
        "A short while after that.",
        "My manager told me that a letter from a fan had arrived in the mail.",
        "Fan? Even though I’ve only been voicing Yuuna for a short period?",
        "Even though Yuuna’s popularity is insanely low?",
        "It must be a prank letter.",
        "I opened the letter with that thought in mind, and I started reading it.",
        "■From: The Grim Reaper in Love■",
        "Nice to meet you, Yuuna-chan. The moment I heard your cheerful laugh… I, who had been depressed, was able to cheer up and be happy again. I was able to jump out and engage with the world once more. Thank you, Yuuna-chan. I love you so much. I will be supporting you from now on, forever and ever.",
        "…From that point on.",
        "I worked very hard, keeping the words of『The Grim Reaper in Love』 close to my heart.",
        "I’m still very young and inexperienced, but…",
        "I learned that even someone like me… can bring a smile to someone’s face.",
        "That’s why, when my father brought up the topic of a “marriage proposal”, I honestly felt upset and irritated.",
        "What was he thinking at such an important time?",
        "I was definitely going to turn it down.",
        "That’s what I thought, but…",
        "……Yuu-kun.",
        "Even before we met each other, you’ve always been supporting me.",
        "Now, I want to be able to support you.",
        "As your bride… I want to make sure you can always have a smile on your face.",
        "I’m going to keep doing my best for you!",
        "So, please… I’d be overjoyed if you let me stay by your side, forever and ever!",
        "☆From Izumi Yuuna – Watanae Yuuka☆",
        "◆",
        "Last chapter of v1. I’m taking a long break until April 11. Next volume is coming out on May 20 so you won’t see me until then. Also, I know that School Goddess is winning but the old translation group might pick it up again apparently. Not very sure. I’ll just wait and see.",
        "Ko-fi"
    ]
}