{
    "id": "chapter-40-my-fiance-is-secretly-sweet-with-me-3-3",
    "title": "Chapter 40: My fiance is secretly sweet with me (3/3)",
    "content": [
        "It’s been about an hour since we arrived home.",
        "I was sitting on the sofa in the living room as I stared up at the ceiling in a daze.",
        "“Just give me a second, okay? Don’t move at all!”",
        "After that reminder, Yuuka quickly disappeared into her room.",
        "Good grief, whenever Yuuka gets an idea, she never listens to anyone else.",
        "I don’t know what kind of plan she has to “reverse the unfortunate events”.",
        "I don’t think it’s going to be that easy to fill the void in my heart from missing out on Yuuna-chan’s event.",
        "“Yuu-kun. Can you move the table out of the way?”",
        "I heard Yuuka speak from behind the door separating the living room and the hallway.",
        "“Umm, Yuuka? What are you doing?”",
        "I tried asking her, but there was no reply.",
        "Not really understanding her intentions, I pushed the table all the way to the wall.",
        "I also brought the chairs and everything else on the floor to the edge of the room.",
        "Now there was a bit more space in front of the sofa.",
        "“Er… I think I’ve moved everything… Is this good enough?”",
        "“…Yeah! Thank you!”",
        "Thanking me with a clear voice, she made her appearance in the living room.",
        "But, it wasn’t Yuuka.",
        "It was, without a doubt… Yuuna-chan.",
        "She had a pink dress decorated with white laces.",
        "A large yellow ribbon was attached to her left hip.",
        "Between her black thigh-high socks and her skirt, there was a gap of absolute territory. That is, her white thighs.",
        "She wore contact lenses, and her eyes looked large and bright.",
        "Her brown twin-tails swayed as if they were alive.",
        "“…Yuuna-chan.”",
        "“Good evening,『The Grim Reaper in Love』-san… Yuu-kun! I’m so glad you decided to come to Yuuna’s special stage today!”",
        "Special stage?",
        "I couldn’t understand what was going on, as Yuuna-chan started tinkering with her phone.",
        "Then, she placed her phone on the floor as it started playing the theme song of『Love Idol Dream! Alice Stage☆』.",
        "That is, the karaoke version.",
        "“Now… it’s showtime!”",
        "Yuuna-chan started to sing along with the background music.",
        "Her voice was so clear that it seemed to resonate deep into my heart.",
        "Yuuna-chan danced and waved her hands.",
        "The dance was incredibly cute, like a butterfly dancing.",
        "Yuuna-chan smiled happily.",
        "Her smile was definitely one that she doesn’t show even on stage.",
        "It was the kind of smile that she showed… only to me.",
        "Then, when the music ended, Yuuna-chan bowed grandly.",
        "“…That’s all for Yuuna’s special stage! You’re the only one invited to this event. There weren’t any lights or special effects, but… I did my best here, you know!”",
        "Yuuna-chan looked up at me, smiling like a sunflower.",
        "Her smile… is it Yuuka’s smile?",
        "No, no, or is it the 2D Yuuna-chan’s smile?",
        "Watanae Yuuka. Izumi Yuuna. Alice Stage’s Yuuna.",
        "All their faces were running through my mind, and they were getting mixed up with each other.",
        "Damn… I don’t even know anymore.",
        "“How was it, Yuu-kun? Were all your negative feelings blown away?”",
        "“…No, not at all.”",
        "“Ehh?!”",
        "Yuuka looked genuinely surprised when I told her bluntly.",
        "“Because, I’m the 『Grim Reaper in Love』, you know? I’m Yuuna-chan’s number one fan. For a『Grim Reaper』 like me to miss out on Yuuna-chan’s very first event… Of course, I’d have regrets for the rest of my life.”",
        "“Uuu… I see. I thought that that was a good idea…”",
        "Yuuka looked dejected as she hung her head low.",
        "When I saw Yuuka like that…",
        "I hugged her tightly.",
        "“Fueeh?! Y-Yuu-kun?! Y-you’re too close!”",
        "“What I’m about to say is from the 『Grim Reaper in Love』. These words are for my beloved Yuuna-chan, okay? They’re for Yuuna-chan.”",
        "I told Yuuka as if I was trying to convince myself too.",
        "I stared into Yuuka’s eyes.",
        "Her moist eyes. Her bright red cheeks. Her pink lips.",
        "What is this feeling..?",
        "A strange, heart-rending feeling that I had locked away a long time ago welled up from deep down.",
        "I swallowed those feelings along with the air.",
        "“I’ll regret missing out on Yuuna-chan’s first event for the rest of my life, but… in the same way, the special stage Yuuna-chan set up for me is something I’ll never forget for the rest of my life.”",
        "“…Okay.”",
        "“Thank you. I love you… more than anyone else in the world.”",
        "Towards the end, I couldn’t bear the embarrassment anymore, so I averted my eyes from Yuuka’s.",
        "Because, I was afraid that if I looked at her, I wouldn’t be able to tell who those words were for anymore.",
        "I tried to back away from Yuuka…",
        "“…Mmm?”",
        "I noticed that Yuuka was looking at me with an expression on her face that seemed to say, “I won’t let you go, no matter what”.",
        "“Umm, Yuuka-san?”",
        "“It’s not enough.”",
        "“What is?”",
        "“Just now, that comment was from the 『Grim Reaper in Love』 to Yuuna, right? I really want to hear a comment from Yuu-kun to me though.”",
        "“Can I not do that?”",
        "“No.”",
        "“Geez… how selfish…”",
        "“Weren’t you the one who decided to make someone like me your fiance?”",
        "Good grief… she only gets stubborn when it comes to things like this.",
        "“Haaah… Just this once. I’m only going to say this just this one time, and that’s it. Got it?”",
        "“Yeah, okay!”",
        "Yuuka waited for my next words just like a puppy.",
        "Uwa, my body was getting hot.",
        "Well, I couldn’t look at her face, so I shut my eyes.",
        "Then, I strained my voice and said…",
        "“Yuuka. Umm… I-I love you…”",
        "A few moments later… I felt something soft and warm touch my lips.",
        "The sweet scent of oranges tickled my nostrils.",
        "“—?!”",
        "Feeling surprised, I opened my eyes and… Yuuka quickly pulled herself away from me.",
        "Then, with her face as red as an apple, she stuck her tongue out at me and smiled.",
        "Her smile looked similar to Yuuna’s.",
        "But, it was unmistakably Yuuka’s smile.",
        "With all of that combined… Yuuka firmly grasped my heart.",
        "“…Me too! I love you more than anyone else in the world… Yuu-kun!”",
        "◆",
        "Last chapter of the main storyline. Next one is the last chapter of v1.",
        "Ko-fi"
    ]
}