{
    "id": "chapter-32-i-tried-to-nurse-her-back-to-health-but-i-couldnt-make-rice-porridge-2-2",
    "title": "Chapter 32: I tried to nurse her back to health, but I couldn’t make rice porridge (2/2)",
    "content": [
        "☆Yuuka-chan’s Curry☆",
        "① Peel the veggies and cut them into bite-sized pieces! Make sure the meat is the same size as the veggies!",
        "② Put some salad oil in a frying pan and stir-fry the meat over medium heat.",
        "Make sure to pay attention to the meat!!!",
        "③ Add the vegetables and stir-fry them.",
        "■Note: Until the onions are transparent.■",
        "④ Add water and let it simmer for 15 to 20 minutes.",
        "⑤ Add the curry powder and let it dissolve completely. Then, let it simmer for another 10 minutes, and…",
        "⑥ Tada! All done!",
        "“What the heck is this..?”",
        "The recipe book was filled with innocence, and it resembled Yuuka so much that it made me smile.",
        "Yuuna-chan also looks like the kind of person who’d do something like this.",
        "They really do resemble each other… Yuuka and Yuuna-chan.",
        "“Ah. Anyways, I might be able to use this, right?”",
        "So, I thoroughly read through『Yuuka’s secret recipe book!☆』",
        "◆",
        "“…Mmm.”",
        "“Ah. Good morning, Yuuka.”",
        "“Yuu-kun… hmm? When did I fall asleep?!”",
        "Yuuka hurriedly sat up.",
        "The ice pack slowly fell off from her forehead.",
        "“Eh, this is…”",
        "Yuuka looked amazed as she stared at what I placed on her bedside.",
        "I felt embarrassed by Yuuka’s reaction and turned my face away.",
        "“Did you make this porridge… Yuu-kun?”",
        "“Well… yes. I guess so…”",
        "“Can I eat this?”",
        "“…I can’t guarantee its taste, though…”",
        "As I said this, I pulled the blanket over Yuuka’s shoulders.",
        "Yuuka took the spoon nervously and scooped some porridge from the bowl.",
        "“*cough* *cough*”",
        "As soon as she ate the porridge, Yuuka started to choke on it.",
        "I quickly offered her the cup of barley tea.",
        "She gulped down the tea in one gulp and pouted.",
        "“You put too much salt in it. It made me choke, you know…”",
        "“Ah, I see… Maybe I should have made the one in the recipe book after all.”",
        "“Recipe book?”",
        "At first, I tried to find out how to make porridge from 『Yuuka’s secret recipe book!☆』.",
        "But I couldn’t find the recipe for porridge anywhere in the book.",
        "On the other hand, I was worried something like curry or stew wouldn’t be good for digestion.",
        "I was in trouble, so I called Nayu again.",
        "『I wasn’t born just to make porridge.』",
        "The phone call failed tragically.",
        "And she even blocked my number.",
        "So, in the end… all I could do was look it up on the Internet and try to make it as close to the real thing as possible… on my own.",
        "“Yuu-kun, you used to live alone, right? This is porridge, you know? It isn’t in the recipe book because it’s the most basic of basics… You really didn’t do any cooking at all, did you?”",
        "“I’m sorry…”",
        "I’m a little depressed, seeing that I can’t even take care of my wife who is sick in bed with a cold.",
        "But, Yuuka just giggled at me.",
        "“Yuu-kun. Can I have some of that porridge?”",
        "“Eh? But, isn’t it salty? You shouldn’t force yourself to eat this.”",
        "“Hmmm… but somehow, I feel like I’ll get better if I eat that. I mean, just a spoon of it made me a little brighter than before, right?”",
        "“…Is that so..?”",
        "“So, with that said. Ah~”",
        "“Huh?!”",
        "Yuuka suddenly closed her eyes and leaned her face towards me.",
        "With her eyes half-closed, she stared at me as she excitedly moved around.",
        "“You know, ah~. I’m so weak, I can’t even hold a spoon. Isn’t there anyone out there who can help feed me? If I don’t eat, I think I’ll starve to death. Ah~”",
        "“Weren’t you able to eat by yourself just now?”",
        "“That must’ve been a doppelganger, a fake Yuuka. You must be talking about someone else.”",
        "Yuuka laughed, sticking her tongue out mischievously.",
        "I sighed as I resigned myself and picked up the spoon.",
        "“Okay, Yuuka. Ah~.”",
        "“Ah~! Omnomnom… It’s delicious!”",
        "Yuuka was overjoyed, as if she had just eaten a full course at a super fancy restaurant.",
        "Even though the porridge was too salty…",
        "Then, taking gulps of tea in between… she managed to finish the entire bowl.",
        "“Thanks for the meal. Thank you, Yuu-kun!”",
        "“Ah, y-yes…”",
        "Her straightforward smile made me feel somewhat embarrassed.",
        "I looked down and muttered to myself.",
        "“Next time… I’ll do my best to make something delicious.”",
        "Even though I’m a pathetic person…",
        "As her fiance, I have to be able to properly support her.",
        "“Yuu-kun… I love that kind and gentle side of you.”",
        "Yuuka quietly muttered those words.",
        "Replying to her would be too embarrassing… so I just pretended I couldn’t hear her.",
        "◆",
        "I know it took me forever for these 2 short chapters. I wasn’t feeling too well for the past 2 days, and I’m out of town for a bit. Translating on the go isn’t fun, so my pace might slow down. Next mini-arc is 3 chapters long, so those are coming out ASAP.",
        "Edit: Also, I made a Discord server. I know I said I wasn’t interested in one before, but that’s a lie xd. I’ll be announcing stuff there, so feel free to join here: https://discord.gg/6kFNSeZWHX. There’s only me and 1 more here (my trusty accomplice from last chapter, who helped me with the server so thank you!)",
        "If no one joins, I’ll go cry in the corner (kusa).",
        "Ko-fi"
    ]
}