{
    "id": "chapter-34-a-game-event-and-a-school-event-overlapped-with-each-other-2-3",
    "title": "Chapter 34: A game event and a school event overlapped with each other (2/3) - Volume 1 Short Story",
    "content": [
        "The next day.",
        "Yuuka and I went to school as usual and took our seats.",
        "“Oi, did you hear, Yuuichi?! The Alice Stage concert in 2 weeks will feature  Rammu-sama and Yuuna-hime as emergency substitutes! Are you ready?! Yeeeeaaaah!!!”",
        "As soon as I sat down, Masa started shouting excitedly.",
        "On top of that, he jumped up and down, which made everyone start to wonder what was going on.",
        "“You need to calm down a little…”",
        "“On the contrary, how can you be so calm?! It’s your waifu’s first time performing at a concert! You should be hyped up here! More hype-”",
        "“Kurai! Back to your seat! You’re being too noisy!”",
        "Our homeroom teacher who just entered the class rebuked Masa, who was making a huge ruckus.",
        "Masa’s shoulders slumped at how forceful Gousaki-sensei was, as he trudged back to his seat.",
        "“…It’s ironic how Kurai got scolded by Gousaki-sensei for getting too excited.”",
        "From the seat diagonally in front of me, Nihara-san laughed as she started talking.",
        "She’s got a point. Masa needs to look at himself a bit more closely, since he’s being scolded by the perfect example of an energetic and enthusiastic teacher for being too intense.",
        "“All right! I’ve decided!”",
        "As I was thinking about this during homeroom, Gousaki-sensei suddenly addressed the class, his voice loud and clear.",
        "Then, he pointed to Yuuka.",
        "“…..?”",
        "Everyone in the class had question marks floating on top of their heads.",
        "Yuuka’s expression didn’t change at all, but it looks like she was confused too, since she asked the teacher a question.",
        "“What… did you decide on?”",
        "“I’ve decided to ask you to volunteer!”",
        "Volunteer?",
        "Gousaki-sensei ignored everyone’s confusion as he continued his explanation.",
        "“An acquaintance of mine works at a nearby preschool. I asked him if he could let someone volunteer there!　And that volunteer is… Watanae Yuuka! I’d like you to be the volunteer!”",
        "“…Volunteering at a preschool?”",
        "Yuuka looked puzzled as she tilted her head to the side.",
        "He looked at Yuuka with a satisfied expression on his face.",
        "Then, Gousaki-sensei grabbed Yuuka by her shoulders.",
        "“That’s right. You can have fun and engage with the little children there. You’ll have a great time! That’s why, I’d really love to have you volunteer there!”",
        "“Umm…”",
        "“I’d like you to head over to the preschool on Sunday, 2 weeks from now! I’ll explain everything in detail then!”",
        "“What..? Sunday, 2 weeks from now..?”",
        "Yuuka’s eyes wavered slightly.",
        "But, she didn’t say anything.",
        "Or rather, I think she couldn’t say anything.",
        "The Yuuka at school isn’t very good at talking to others… that’s the kind of girl she is.",
        "Sunday, 2 weeks from now.",
        "The very same day that the『Love Idol Dream! Alice Stage☆』event is taking place.",
        "It’s a really important day for Yuuka because it’s her very first time performing at a huge event like this, as Izumi Yuuna.",
        "“Well then, Watanae. I’ll be counting on you…”",
        "“Wait… Sensei!”",
        "I found myself jumping to my feet and shouting.",
        "“…Sakata?”",
        "“Yuuichi, what’s wrong?”",
        "Nihara-san and Masa stared at me with a look of bewilderment on their faces.",
        "All eyes in the class were focused on me.",
        "The atmosphere was so overwhelming, it made my lips tremble and I couldn’t get the words out.",
        "“Sakata, is there something you need from me?”",
        "“…No.”",
        "Eventually, I just took my seat and homeroom ended.",
        "…I glanced over at Yuuka.",
        "She quietly bit her lip as she sat in her seat, motionless, while she hung her head low.",
        "◆",
        "Discord: https://discord.gg/6kFNSeZWHX Poll: https://forms.gle/2onmNMU2cWiLPfaD6",
        "Ko-fi"
    ]
}