{
    "id": "chapter-13-how-to-wake-someone-up-and-make-them-think-ah-i-should-just-sleep-forever-2-2",
    "title": "Chapter 13: How to wake someone up and make them think “Ah, I should just sleep forever” (2/2)",
    "content": [
        "So, for the time being, I accepted Yuuka’s request for a retake.",
        "I was once again waiting in the futon with my eyes closed.",
        "“Why is this happening..?",
        "Even though I’ve already woken up, I’m trying to go back to sleep… I thought about how weird and indescribable this situation was.",
        "I heard the door of my room open.",
        "I could sense Yuuka slowly approaching me.",
        "She took a deep breath right next to me.",
        "Then…",
        "“…Onii-chan, are you awake yet? You’re going to be late, you know?”",
        "The unexpected line she said made my heart beat really fast.",
        "I sat up straight on my futon and caught my breath. Then I faced Yuuka.",
        "“Ah… I’m awake.”",
        "Yuuka was smiling happily, but this was no laughing matter.",
        "“Why ‘Onii-chan’?”",
        "“In stuff like anime, the most popular character to wake you up in the morning is the younger sister, right? Ehehe, calling you ‘Onii-chan’ feels kind of refreshing.”",
        "But soon after that, she suddenly had a look of realization on her face.",
        "“Ah… I see. Sorry, Yuu-kun. You already have Nayu-chan, huh… Having your sister come and wake you up, you must’ve experienced it tons of times, huh?”",
        "“No, that’s not what I meant.”",
        "By the way, Nayu never wakes me up like that.",
        "In fact, Nayu has worse sleeping habits than I do, so I’m the one who has to wake her up in the morning.",
        "And every time I wake her up, she clicks her tongue at me. How unreasonable.",
        "“Sorry! One more time please!”",
        "“I’ll be late, you know!”",
        "“One last time! Since we’re a married couple, please let me wake you up in a moe way!”",
        "Yuuka clasps her hands together and bows her head, begging me.",
        "Ah… come on… If you’re begging that desperately, it makes it impossible for me to refuse.",
        "So, giving in to her request, I got into my futon and closed my eyes again. (For the third time today)",
        "“…Yuu-kun? If you don’t wake up, you’ll be late~”",
        "After a short pause, I heard Yuuka muttering.",
        "But… what’s the best way for her to wake me up based on the fact that we’re married?",
        "I can’t imagine it at all.",
        "I felt Yuuka’s lips close to my ear.",
        "Her warm breath tickled my eardrums.",
        "Then, she took a deep breath.",
        "“…If you don’t wake up, I’ll… kiss you, okay?”",
        "An electric current ran through my brain that made me excited.",
        "Eh? K-kiss?!",
        "I see… I thought she was only talking about stuff in manga and anime.",
        "But, we are fiances.",
        "That kind of thing… probably does happen.",
        "I imagined Yuuka’s plump, pink lips.",
        "Her lips looked like they would give you a sweet sensation that would melt all reasoning. Then, Yuuka’s small breath that would leak out…",
        "Then, me and Yuuka would…",
        "“…Y-you’re not getting up?! Eh? Eh?! I’ll really k-kiss you, you know?!”",
        "Yuuka’s hand grabbed my shoulders really tightly.",
        "I quickly jumped out of my futon in a panic.",
        "“Ah… G-good morning, Yuu-kun.”",
        "“Y-yeah…”",
        "Yuuka and I stared at each other.",
        "Then… Yuuka looked down bashfully.",
        "“Ah, umm… Just now, I tried to wake you up in a moe way… but I’m actually too embarrassed to kiss you, so… I’m sorry to get your hopes up…”",
        "Yuuka squirmed around bashfully.",
        "Looking at Yuuka like that, I couldn’t really say anything to her.",
        "“With that said… That’s all for Yuuka’s Moe Wake-up technique!”",
        "She laughed bashfully as if she was trying to drive away her embarrassment.",
        "Then she turned around to hide her face, which had become so red that she looked as if she had a fever.",
        "“How was it, Yuu-kun?”",
        "“Err…”",
        "I had some trouble telling her the truth as I pointed to my alarm clock.",
        "“It looks like… I’m already late.”",
        "“Waa?! I-I’m sorry!”",
        "Yuuka ran out of my room in a hurry.",
        "When Yuuka was gone, I let out a deep sigh.",
        "“…I’ll set my alarm clock a little earlier tomorrow…”",
        "If I had to be woken up like this every morning, my brain would go crazy.",
        "◆",
        "From that day on, I set my alarm clock a little earlier.",
        "And as a result…",
        "“Mou! Why are you awake even earlier than usual today!”",
        "Yuuka persistently kept trying to wake me up earlier than my alarm clock.",
        "But, to prevent my mind from going crazy, I kept setting my alarm clock even earlier than before.",
        "Eventually, I started waking up at 5 o’clock. Because of this, coming to wake me up in the morning was forbidden in our house.",
        "◆",
        "It’s Saturday, just as I promised. Next chapter is a stand-alone chapter, so it’s coming on… Monday. I hope. Huge rant below so skip it if you hate essays like I do.",
        "So, I’ve thrown away all shame I have as an MTL and I’ve decided to try and get some donations. I know this is MTL, and there are holes in my translations left, right, and center, so forgive me for my shamelessness. Don’t feel pressured to donate though, since the only time I expect a donation is if you have too much money (which is unlikely) and you’re willing to give it to a good-for-nothing human, like me (which is also unlikely). Here’s the Ko-fi link. I was going to make myself translate 1 extra chapter for every 1 dollar, but that’s a ripoff. I considered 2 chapters per dollar but it still feels off for me. So, I’ve decided 3 extra chapters for every 1 dollar. So, hypothetically, instead of 3 chapters/week, it would be 6 chapters/week. Keep in mind that I’ve decided I’d only translate up until c40, which is the end of v1 (plus the short story), because the web novel ends in the middle of v2, and I don’t want to end my translations on a cliffhanger. Going by my pace right now, I should finish this series in 9 weeks..? So, maybe somewhere between May and June. Really slow, I know…",
        "I’m also really interested in picking up a few dropped novels on NU (not sure when), like this one, and this one, unless the original translators plan to resume their work on those.",
        "I really appreciate everyone’s comments, and the fact that people are actually reading my translations makes me happy, so thank you. Also, I haven’t included the grayscale illustrations for some reason. Those are coming on Monday too."
    ]
}