{
    "id": "chapter-1-my-parents-are-forcing-me-to-marry-in-my-second-year-of-high-school",
    "title": "Chapter 1: My parents are forcing me to marry in my second year of high school…",
    "content": [
        "“…What? Me? Getting married?”",
        "“Yeah. Congratulations. Starting tomorrow Nii-san, you’re going to be a husband.”",
        "Out of nowhere, my sister called and flatly told me that I was going to get married.",
        "My brain couldn’t comprehend what my sister was trying to say, so I asked her to repeat herself.",
        "“My dear sister, Nayu… Who’s getting married with whom tomorrow?”",
        "“Wow, you’re so stubborn. Nii-san is getting married to an unknown girl.”",
        "“Err… let me ask one more time. Who is this ‘Nii-san’?”",
        "“Haa? Sakata Yuuichi, a plain and mediocre person, who’s also my brother. What, you got something to say? Tch.”",
        "Hey, don’t click your tongue at me.",
        "I’m the one who should be pissed right now.",
        "Sakata Yuuichi. That’s definitely my name.",
        "Just as my sister said, I’m a plain and mediocre highschooler.",
        "My high school debut was as uneventful as could be.",
        "I have plain black hair and my body is pretty average.",
        "I’m the type of person who just lazily wears the school-provided blazer.",
        "My grades are average, and I don’t really do exercise.",
        "And that very same person is going to get married tomorrow?",
        "What’s more, it’s with an unknown girl?",
        "“So, you’re telling this to me now? Me, the supposed groom, the day right before my marriage? And you’re telling me I’m getting married to a person I don’t know? Aren’t I too young in the first place? What kind of joke is this?”",
        "“They didn’t tell me the details. If you have any complaints, take them to Dad. I’m just the messenger.”",
        "I could hear her spitting out that line, clicking her tongue the entire time.",
        "“How are you doing, my son! It’s me, your papa!”",
        "Looks like my dad was in high spirits as he talked to me on the phone.",
        "Due to work-related reasons, my father had to move overseas last year.",
        "He brought Nayu with him, while she was still in middle school.",
        "On the other hand, I started living by myself in Japan. It’s almost been a year since then.",
        "“Are you really serious about such an obscure and shady marriage?” I said in a low voice.",
        "Dad cleared his throat and started speaking.",
        "“You see, your father is going to get really busy. I’m getting promoted to an important position overseas, and it’s basically do-or-die. Either I do my new job really well and get successful, or I fail badly and get fired.”",
        "“Uh-huh. So?”",
        "“So, I’ve gotten close to one of my clients. He’s a big shot, and he has a daughter who moved to Tokyo for high school. Apparently, she’s now living alone and, as her father, he’s worried that she might get burglarized or she might get hit on by some shady man, or something like that.”",
        "“…I think I can see where this is going. So the daughter must be who I’m getting married to.”",
        "“It isn’t an exaggeration to say that the fate of the entire Sakata household depends on this marriage.”",
        "How selfish.",
        "I let out a small sigh and grumbled over the phone.",
        "“Hahh… You know… Seeing you so depressed after your divorce from Mother, I can’t imagine how it’d be like for me if I got married. You know this, right?”",
        "“And your dark past during your 3rd year of middle school?”",
        "“Yeah, yeah, that too… Hey! Shut up, Nayu! Where did Dad even go?”",
        "“He ran away to his room.”",
        "“You’ve got to be kidding me… Please, Nayu, you’ve gotta convince him out of this.”",
        "“I don’t know. Anyways, tomorrow I’ll be introducing you to her. Bye, tch.”",
        "Wow, she just hung up on me.",
        "Why is she so grumpy? She’s always so unreasonable.",
        "Wait, so he was actually serious? Me? Getting married?",
        "Give me a break… I don’t know how I’ll get through this…",
        "◆",
        "The day after the phone call.",
        "I somehow managed to pull through the entrance ceremony, my mind completely distracted.",
        "“Hey! Why the dark expression, Yuuichi?”",
        "After I sat down on my seat in a daze, I got slapped really hard on my back.",
        "“Why are you in such a good mood, Masa?”",
        "“Ya know, ‘cause this year makes us classmates for 5 years in a row!",
        "“Stop it, you’re creeping me out.”",
        "“Why are you so moody? Just close your eyes and imagine you’re talking to a beautiful girl.”",
        "“That’s impossible. Your voice is too deep.”",
        "This is Kurai Masaharu. He’s been my friend since middle school.",
        "He wears black glasses and he’s a somewhat aloof person.",
        "Because I’m always inconsiderate to other people, no girls are willing to approach me.",
        "This is why having him around is soothing and comforting.",
        "The thought of being involved with a 3D girl terrifies me.",
        "“But, 5 years huh? 3 years in middle school and now even 2 years in high school. We’re just two peas in a pod, eh? Haa… if you were a girl, it’d be like something in a rom-com.”",
        "“Just because you’re in the same class doesn’t mean something special will happen.”",
        "“You don’t have to kill my dreams like that… Well, you got a point since I’ve been in the same class with Nihara since my 3rd year in middle school. We would already be dating by now if that was all it takes…”",
        "Masa then pointed at a girl cackling loudly, Nihara Momono.",
        "So she’s in the same class as us, huh?",
        "She looks just like a gyaru, with her fluffy brown hair swaying… I heave a sigh just thinking about her.",
        "Whenever Nihara-san finds something interesting, she always brings me into it. Honestly, it’s a pain in the ass since I always try to avoid 3D girls as much as possible.",
        "“…Mm?”",
        "As I was thinking such things vacantly, I could see a plain girl wearing glasses in the corner of my eye.",
        "Even though she just did her self-introduction, I seem to have forgotten her face. In fact, I can’t even remember her name.",
        "She has black hair tied up in a ponytail.",
        "I could barely see her almond-shaped eyes peeking out from her small glasses.",
        "Since I’m sitting down, I can’t say for sure, but her body looks small and petite.",
        "She’s the perfect example of blending into the crowd. She’s just like a ghost.",
        "Not standing out in a good way or in a bad way. Just someone who’s truly unmemorable.",
        "If there was a class reunion, they’d even forget to tell you about it.",
        "Thinking that this girl was living such an ideal life, I unintentionally muttered.",
        "“How nice…”",
        "That was exactly how I wanted my high school life to be.",
        "People would only talk to me if necessary.",
        "I would be like a ghost, unnoticed.",
        "I would spend my days peacefully and uneventfully.",
        "If I could, I’d love to live such a calm and peaceful life.",
        "◆",
        "I can remember my time during my 3rd year in middle school.",
        "Back then, I was pathetic. I was a cheerful person at school.",
        "Even though I was an otaku who liked manga and anime.",
        "I liked to joke around and annoy my teachers with my friends. I could freely talk to the girls in my class.",
        "Even though I was an otaku, I was friends with lots of boys and girls.",
        "I deluded myself into thinking that I was a “cool” and “popular” person.",
        "A popular otaku. I thought I was special, and I got cocky.",
        "“Yuuichi~! Tomorrow, do you wanna come shopping with me?”",
        "“Eeeh, I don’t wanna. Don’t girls take forever to do their shopping?”",
        "“How mean~ Even though you’re being asked by a girl as cute as me!”",
        "After a long day of school, my friend, a girl in my class, spoke to me.",
        "As the sun was setting, her face was illuminated beautifully in the deserted classroom.",
        "I took a deep breath and muttered.",
        "“Hey… Why don’t we go out, you and me?”",
        "She turned her face to me, looking surprised.",
        "Then, she bashfully looked down, her fingers twirling her hair around.",
        "With a cute voice, she answered me.",
        "“Umm… I’m sorry. I can’t go out with you…”",
        "Getting rejected was completely unexpected.",
        "I had slowly gotten closer to her over time, and I was so sure she had felt the same way about me.",
        "But, I was completely wrong.",
        "On top of my rejection, somehow, everyone in my class found out how my confession got miserably rejected the next day.",
        "They laughed at me.",
        "They teased and made fun of me.",
        "I then realized.",
        "I can’t pretend to be a cheerful person. I’m… just a miserable and pathetic person.",
        "◆",
        "Ahh… I don’t want to go home today…",
        "I trudged out of the school building, my head hung low.",
        "Today was a half-day at school, so the sun is still shining brightly.",
        "I’m sure everyone is still having fun in the classroom, making plans and the like.",
        "Or maybe they moved to a family restaurant to hang out.",
        "Well, I wouldn’t really know since they live in a completely different world.",
        "I heaved a sigh just thinking about that.",
        "I reached into my pocket and pulled out a keychain.",
        "Yuuna-chan…",
        "Her pure and innocent smile makes me want to smile myself.",
        "Her brown hair tied into a ponytail, her cute mouth…",
        "It feels as if she can make world peace happen…",
        "It feels as if she can make all your fatigue go away…",
        "Yuuna-chan is definitely a goddess…",
        "“If I really had to, I’d rather marry Yuuna-chan…”",
        "That’s how I truly feel.",
        "『Love Idol Dream! Alice Stage☆』",
        "This game was released in winter during my 3rd year of middle school.",
        "There are around 100 characters called “Alice Idols”, and each character is fully voiced.",
        "In addition, there are always lots of events at any given time.",
        "They have popularity contests conducted regularly, and the most popular character gets a special episode just for them.",
        "By the way, the characters in the game share the same first name as their respective voice actors.",
        "For instance, the character “Yuuna” is voice-acted by Izumi Yuuna, the character “Ranmu” is voice-acted by Shinomiya Ranmu, and so on.",
        "It looks like the developers did this intentionally not just for the game, but also to promote new voice actors. They have also started an online radio where the voice actors take turns working like celebrities.",
        "After I got… painfully rejected, I didn’t want to go to school at all and ended up staying at home for several days. During this time, I got completely hooked on the game.",
        "“Yuuna-chan will always be right by your side~ So, why don’t we both smile together~”",
        "She captivated me the instant I got her from the gacha.",
        "Her voice, her expression, the impression I get from her, everything about her captivated me.",
        "If I hadn’t met Yuuna-chan back then, I probably would’ve stayed home for much longer.",
        "Honestly, after that incident, the concept of falling in love with a 3D girl scares me.",
        "Because, no matter how much I liked a girl, I would never be able to tell how she feels about me, unlike in games.",
        "You might get hurt. The opposite is also true because you might also hurt them.",
        "If that’s the case, then I’d rather just be with Yuuna-chan forever.",
        "2D will never betray you.",
        "Well, sure, I can’t date her in real life but… rather than worry about hurting each other, I’d rather just continue thinking of her through my screen.",
        "That’s why I imagined getting married to Yuuna-chan.",
        "Yuuna-chan in her white wedding dress.",
        "Her naturally large breasts would stand out a lot thanks to the corset she would wear around her waist.",
        "Her trademark brown hair would be tied into a ponytail and it would sway in the wind.",
        "Her eyes would be wide open, a little moist.",
        "Her cute cat-like mouth would slowly come closer…",
        "“Mm..?”",
        "I was so absorbed in my delusion, but suddenly I snapped back to my senses.",
        "If you want to know why, it was because I saw a weird girl standing on her tiptoes.",
        "She’s… that girl I saw earlier in the classroom. The “ghost” girl.",
        "She tremblingly held her hand out towards a tree on the side of the road.",
        "What the hell is she trying so hard to do?",
        "“Ahh… that?”",
        "There was a pink envelope stuck on the very edge of the tree branch.",
        "Maybe it got caught up in the wind. It looks like she’s desperately trying to get it back.",
        "I have no idea what could push a girl like her to do something like this.",
        "“Here you go.”",
        "I went right next to the girl and quickly took the envelope from the branch.",
        "“Eh?”",
        "She was probably surprised to see me suddenly appear right next to her since she quickly backed up.",
        "Well, she is considerably shorter than me.",
        "“You were troubled just now, right? Well, it’s easier for me since I’m taller.”",
        "“Err… Umm…”",
        "Not wanting to get involved with her, I bluntly handed over the envelope.",
        "“…Thank you…”",
        "As she was thanking me, her eyes closed slightly as if reminiscing something.",
        "“This is… really important to me…”",
        "She had a bright and carefree smile on her face.",
        "Her voice was clear and beautiful.",
        "It felt like I was seeing something like a cutscene from a game.",
        "“Ah… N-no, t-that’s, uh… Yeah…”",
        "I shook my head in a panic, realizing that I had been admiring her.",
        "“W-well then, I’m a little busy, so yeah!”",
        "I quickly distracted myself from her smile by thinking about Yuuna-chan.",
        "I mean, she’s a 3D girl.",
        "I’ve already decided I’d only be interested in 2D girls.",
        "I quickly left her behind and ran away.",
        "◆",
        "Well, that should’ve been the case.",
        "“…Umm”",
        "“H-huh?”",
        "For some reason, she was also in front of my house.",
        "Her ponytail was fluttering in the wind.",
        "She was still holding the pink envelope tightly.",
        "She looked a little anxious, tilting her head slightly.",
        "“W-why are you here too?”",
        "“I mean, this house is my house.”",
        "We just stared at each other awkwardly.",
        "At that moment, the door to my house suddenly opened.",
        "“Nii-san, you’re too loud.”",
        "Her hair was fluffy and black, a little bit on the shorter side,",
        "She had sharp eyes peeking out from behind her bangs and she was wearing a jacket over her t-shirt.",
        "Her bare legs below her shorts were long and white.",
        "Her body doesn’t look like a girl’s body at all, and her face is also androgynous, so she is often mistaken as a handsome boy.",
        "This is Sakata Nayu, my little sister who’s currently in her 2nd year of middle school.",
        "“You’re so slow. I got tired of waiting.”",
        "“Can’t help it, I just got back from school.”",
        "“Shut up.”",
        "She shoved her hands into her pockets, glaring at me.",
        "She then heaved a huge sigh.",
        "“You were probably just distracted by your delusions of that game character. You’re so hopeless.”",
        "“What do you mean, hopeless?! Yuuna-chan is humanity’s greatest hope!”",
        "“And you stayed by yourself in Japan just to continue playing that game.”",
        "“Yeah, it’s obviously an important duty.”",
        "“An older brother who’s useless to society, a father who does lots of unnecessary things, and then there’s me, the sister who’s always troubled by the both of them. I’m cursed.”",
        "“U-umm!”",
        "As we were busy arguing, the ghost girl beside me suddenly interrupted.",
        "“Umm… By Yuuna-chan, do you mean the Yuuna from Alice Stage? The one voice-acted by Izumi Yuuna?”",
        "“Do you know her?!”",
        "“Ah, err… Do you like her?”",
        "“Yeah, I really love her.”",
        "Nayu clicked her tongue as I answered eagerly.",
        "After hearing me, the girl smiled bashfully.",
        "“I see… Thank you…”",
        "“Thank you? For what?”",
        "“Ah, yes. Because I’m Izumi Yuuna.”",
        "What?",
        "What is this girl saying?",
        "“Oh… you mean because you have the same name? Well, it might just be a coincidence after all.”",
        "“No, not that. My real name is Watanae Yuuka.”",
        "“Watanae Yuuka?”",
        "My sister looked a little suspicious.",
        "Then she just clicked her tongue.",
        "“Ah… I see. Nii-san, congratulations on your marriage. Well then, I’m heading home now.”",
        "“Huh?! Wait! Weren’t you supposed to introduce me to my supposed partner?”",
        "“No, you’ve met her already.”",
        "“…eh?”",
        "I looked at the girl again.",
        "In front of me is my classmate who introduced herself as Watanae Yuuka. She’s wearing glasses and she has a ponytail.",
        "…Huh? So, this means…",
        "“Watanae Yuuka-chan. She is the client’s daughter, and the person you’re getting married with.”",
        "“N-nice to meet you… My name is Watanae Yuuka. Umm… first of all, I’d like to thank you for your support…”",
        "I felt shaken.",
        "After all, this girl… just told me something so absurd.",
        "“I guess I am, more or less… Izumi Yuuna, the voice actor for Yuuna-chan.”",
        "「If I really had to, I’d rather marry Yuuna-chan…」",
        "Certainly, that was what I had thought a while ago.",
        "Maybe there are some people who’d love to marry the voice actors of their favorite characters.",
        "But not me.",
        "Because… obviously, the voice actor would be a 3D girl.",
        "◆",
        "Hi there. The chapter ended up there, so if you’re not interested in reading me rant, you can close the tab, or something.",
        "So, this is my very first time trying to translate. I’m a student trying to learn some Japanese, so I thought “Why the hell not?”. Of course, that makes me a MTL, and I used 60% DeepL and 40% Rikai-kun to help me translate this chapter. I’m the only one working on this chapter, so no editor to point out silly English mistakes. If you see any errors, either in spelling, grammar, how the story flows, or anything else, I’d appreciate it if you commented below, or hit me on email or Discord.",
        "I got motivated to translate this story after the light novel came out, and my friend sent me the cover. Looked pretty cute, if I do say so myself. So, here I am translating the web novel because I’m too poor for the LN. If anyone thinks that they can translate this better than me, go ahead and contact me, cause I honestly suck :3"
    ]
}