{
    "id": "chapter-5-the-girl-im-getting-married-to-turned-out-to-be-an-acquaintance-2-2",
    "title": "Chapter 5: The girl I’m getting married to turned out to be an acquaintance? (2/2)",
    "content": [
        "“I’m… really, really sorry. There’s nothing wrong with you. I’m just a coward… That’s why…” “…At first, I was also determined to call off this marriage, no matter what.” Watanae-san’s expression softened as she started speaking.",
        "Then, she started to trace her finger on the fan mail she had in her hand, specifically on the sender’s name: 『The Grim Reaper in Love』.",
        "“For a very long time, I’ve considered 『The Grim Reaper in Love』to be a very important person to me, you know?”",
        "Watanae-san called my pen name tenderly, even though that was a name I made up during my chuunibyou phase.",
        "【TLN: Chuunibyou, literally meaning ‘2nd-year middle school disease’, is when some teens consider themselves special, having superpowers and the like. Read more on Wikipedia.】",
        "“When I first started voice acting for Yuuna-chan, I was really bad at it. I kept making mistakes, my boss got angry at me, and I cried at home. During those times,『The Grim Reaper in Love』 would always send me lots and lots of fan letters.”",
        "“Lots of fan letters to the point you got disgusted, probably.”",
        "“I never felt disgusted or anything like that. 『The Grim Reaper in Love』 would never send me words of criticism, hate, or anything else that would hurt me. He’d always send me words of support, and these letters would always encourage me to keep moving forward. Knowing that there was someone watching over me out there… I can’t even begin to describe how much it helped me.”",
        "Watanae-san’s expression was gentle, kind, and innocent.",
        "It was almost as if I was looking at Yuuna-chan herself…",
        "“I never would’ve thought that I would be able to meet that very same person. And on top of that, he was kind to me even though he didn’t know I was Yuuna. He helped his classmate when she was troubled, even though he’d never talked to her before. He looked like he was doing something natural and obvious, like he was helping a long-time friend of his. He helped me without any complaints, without asking for anything in return.”",
        "“No… I mean, anyone would do that much, right?”",
        "“That’s not true… You’re kind, Yuu-kun. You were exactly how I imagined 『The Grim Reaper in Love』would be. That’s why I changed my mind… At first, I despised this arranged marriage, but now, I think…”",
        "――――I think that our encounter might be the work of fate.",
        "Those words said by Watanae-san’s pink lips.",
        "It passed through my ears and made my head dizzy.",
        "I was at a loss for words, and Watanae-san giggled after seeing me like that.",
        "Then, she starting blushing.",
        "“So, please treat me well starting today. I’ll do my best and work very hard as your wife!”",
        "“I told you before, didn’t I? I won’t fall in love with a 3D girl.”",
        "“Yeah. That’s why it has to be me!”",
        "“…Huh?”",
        "What is this girl saying?",
        "I probably had a huge question mark floating above my head.",
        "Watanae-san then faced me and said:",
        "“You know, because I’m… a 2.5D girl!”",
        "She declared that so confidently I couldn’t tell whether she was joking or not.",
        "It was such a far-fetched argument, and it didn’t really solve anything.",
        "But, Watanae-san looked so proud of herself and she had a triumphant grin on her face. Looking at her, I couldn’t help but burst out laughing.",
        "“Well, let’s say that’s true. But, if we can live together, and we can go to school together, what’s the difference with a 3D person?”",
        "“But, Yuuna is 2D, isn’t she? If you take the amount of time you think about Yuuna, add it, then divide it, you’ll definitely become 2.5D!”",
        "“What do you add and divide? What kind of formula is that..?”",
        "“Mou… that’s just a trivial matter. Anyways! What I want to say is, I’m more 2D than anyone else!”",
        "“Why are you so desperate? Are you trying to scam me again?”",
        "“I’m not even selling anything… Just so you know, I’m the type of person who isn’t really interested in 3D boys. I’ve never thought of going out with a boy, getting married, or other stuff like that. That’s why, imagining a future where I’m married to someone other than Yuu-kun… I don’t want that kind of future…”",
        "Then, as we were arguing with each other, I felt somewhat silly for stubbornly refusing her offer, and I laughed.",
        "“Ah! Why are you laughing? We’re having a serious conversation here!”",
        "“I know, I know… I was just thinking that what you were saying had some truth to it.”",
        "I took a moment to catch my breath and stared fixedly at Watanai-san.",
        "Watanae-san looked straight back at me with clear eyes.",
        "“Even if I refuse this marriage, I know my father is a fool. He might send in a second or third marriage partner…”",
        "“…Yeah.”",
        "“And the chances that my new partner is going to be Yuuna-chan’s voice actor… is extremely low.”",
        "“It isn’t extremely low! It’s zero percent! I’m the one and only voice actor for Yuuna-chan!”",
        "“Right. So my new partner would be an ordinary 3D girl. And I wouldn’t hesitate to immediately reject her. And my father will send another one. And I’ll reject her again. Doing the same thing over and over again is honestly going to be a hassle.”",
        "“Right? This is a once-in-a-lifetime opportunity, you know? It’s a great bargain!”",
        "Somehow, it felt like a sales promotion.",
        "She’s completely different outside school. Her true self is cheerful, and a little silly.",
        "She really resembled Yuuna-chan.",
        "“Well, I guess we could try it for now. About that marriage thing… is it okay if I think about it another time?”",
        "“Yeah. We’re still too young to get married and legally start a family anyways. So, that means… we’re starting as fiances!”",
        "Watanae-san smiled bashfully as she said that.",
        "I couldn’t help but smile too.",
        "“I won’t take responsibility if you regret this, okay?”",
        "“I won’t regret it, so prepare yourself.”",
        "“Well then, our life together starts now, so please treat me well, Yuuka-chan.”",
        "“Yes. I might be incompetent, but please treat me well too, Yuu-kun.”",
        "And just like that, I and Yuuka-chan started off as fiances for the time being.",
        "It is said that marriage is the graveyard of life.",
        "For now, I’m going to try my best to… not die.",
        "◆",
        "A double release, because the last chapter kinda ended on a cliffhanger, and that’s bad for my heart. Also, because I might not release a chapter tomorrow. Procrastinated too much on homework, so here I am. Expect a new chapter tomorrow, or in 2 days."
    ]
}