{
    "id": "chapter-24-i-knew-that-entering-the-bath-together-was-a-bad-idea-but-2-2",
    "title": "Chapter 24: I knew that entering the bath together was a bad idea, but… (2/2)",
    "content": [
        "“…Fueh?”",
        "My brain couldn’t keep up, and I made this weird sound.",
        "Yuuka tied her ponytail higher than usual, probably to keep it from getting wet.",
        "She also took her glasses off, probably to keep them from fogging up.",
        "Her name, “Watanae Yuuka”, was written on the bottom right corner of her swimsuit.",
        "She’s wearing it to let people know that she’s the real deal.",
        "“S-sorry, Yuu-kun. Being naked is just… too embarrassing… “",
        "“I suggested this as a compromise.”",
        "“So this was your doing, Nayu…”",
        "Well, I guess she’s hiding her body, but…",
        "Having your classmate wear a school swimsuit in your bathroom at home is also just as dangerous.",
        "In a way, it’s even more immoral than being naked.",
        "“I-I’m coming in, Yuu-kun.”",
        "“O-ok.”",
        "And so.",
        "I sat down on the stool, having only a bath towel to cover the lower part of my body.",
        "And Yuuka, wearing her school swimsuit, stood right behind me.",
        "The atmosphere around got really awkward…",
        "“I-I’ll start washing your back, okay?”",
        "“S-sure.”",
        "*touch*",
        "“Hiii?!”",
        "Yuuka’s hand, covered in body soap, touched my back.",
        "Then, using her slippery hands directly on my skin, she washed my back.",
        "Yuuka’s tiny hands are touching my body… When I got conscious of the fact, my mind gradually went blank.",
        "“Do you have any itchy spots anywhere?”",
        "“I-I’m fine…”",
        "“Can you keep your back straight for a little longer?”",
        "“O-okay!”",
        "I’m really thankful for what Yuuka said, but please let me bend forward for now.",
        "“I’ll be washing your front too, okay?”",
        "“T-the front?!”",
        "“Of course! I have to properly clean you up, or else this will all go to waste!”",
        "Yuuka’s hand reached out from under my armpit.",
        "Then, she started washing the area around my stomach.",
        "Sometimes, the feel of Yuuka’s fabric against my body would make me imagine her in her school swimsuit, covered in bubbles.",
        "What’s happening… I’m gonna die… I’m actually going to heaven…",
        "“…Hmm.”",
        "Just before I completely ascended, Yuuka sighed, seemingly troubled by something.",
        "Then, she quietly muttered, “Okay!,” as if she had made up her mind about something.",
        "“Yuu-kun, can you take off your bath towel?”",
        "“What?!”",
        "“Because I want to wash you even more. I-I’m starting to enjoy washing you!”",
        "Why are you getting so excited?!",
        "When I turned around, I could see Yuuka’s eyes sparkling.",
        "Aren’t you being too innocent here?!",
        "Thanks to the water and bubbles, her school swimsuit was shiny and slippery.",
        "I bent over even more and leaned forward like a shrimp.",
        "If this keeps happening, I might go crazy sooner or later… Ah… This airhead is really too-",
        "“Okay, Yuu-kun! Please take them off!”",
        "“That’s impossible. No way. Never.”",
        "“Whyyy?! As your wife, I want to serve you as much as I can!”",
        "“I’m already happy! That was the best! Okay, let’s end it here!”",
        "“Nooo! I want to do more!”",
        "“If I say it’s not okay, then it’s not okay! Nayu! Say something to Yuuka, too!”",
        "“…Mmm. Sure.”",
        "Nayu’s voice was lower than usual.",
        "Huh? I can’t see her face through the door… Is she in a bad mood or something?",
        "“Nayu? Hey, Nayu?”",
        "“Nayu-chan! I’ll work hard! I’ll do my best so that Yuu-kun can keep smiling!”",
        "“…Go for it, Yuuka-chan.”",
        "“No, you don’t have to! You don’t have to at all!”",
        "I desperately grabbed my bath towel and held it around the base of my legs.",
        "Yuuka (in her school swimsuit) was desperately trying to take it away from me.",
        "And I don’t know what’s wrong with Nayu, but she seemed to be unhappy on the other side of the door.",
        "…What the hell is this situation?!",
        "“You two are getting closer, so isn’t it fine? Tch.”",
        "I think I heard Nayu’s voice coming from outside the bath.",
        "I was too busy protecting my privates… I couldn’t even make out what she was saying.",
        "◆",
        "I feel like I’m using too many idioms? If it’s too difficult to understand, please let me know. I can try and cut down on those. Also, his imouto is really confusing me. Also, where are those grayscale illustrations? (sorry im too lazy ill get them out next week maybe)"
    ]
}