{
    "id": "chapter-3-im-getting-married-and-shes-not-a-2d-girl-2-2",
    "title": "Chapter 3: I’m getting married, and she’s not a 2D girl (2/2) - Volume 1 Short Story",
    "content": [
        "We continued talking for about an hour.",
        "I felt my throat getting dry, so I made some more tea and drank it all in one gulp.",
        "“Ooh. The way you drank that was incredible.”",
        "“No, it’s just because it’s been so long since I’ve talked this much.”",
        "Usually, I just talk to myself at home. At school, I keep all my conversations as short as possible.",
        "Well, except Masa. He talks to me non-stop at school.",
        "“This might be the first time I’ve ever had someone I could talk to so easily.”",
        "Watanae-san smiled bashfully as she retied her ponytail.",
        "Her defenseless gesture made my heart skip a beat.",
        "“Oh yeah, I want to see what your room looks like, Sakata-kun. I wanna see what kind of manga and stuff you have.”",
        "“No way.”",
        "I immediately made a big X with my hands.",
        "Going to my room is a bad idea.",
        "Even though I had lots of fun talking to her about our hobbies… I absolutely can’t bring her to my room.",
        "“Eeh?! Why not?”",
        "“It’s not something I can show to other people.”",
        "“It’s okay. I’m also an otaku. I understand that boys are interested in… those kinds of things. But, I’ll try not to stare too much so we both don’t get uncomfortable.”",
        "“What are you talking about?! I’m saying this just in case you misunderstood, but I’m not talking about R-18 stuff here!”",
        "“Eh, really?”",
        "What kind of room did she think I have?",
        "“It’s not about that… I mean, it’s because Watanae-san is Yuuna-chan.”",
        "“I’m Yuuka!”",
        "“I know that! I’m saying that you’re actually Izumi Yuuna-chan.”",
        "I calmed myself down and thought about it carefully.",
        "Yes, Watanae Yuuka-san is Izumi Yuuna-chan.",
        "And Izumi Yuuna-chan is the voice actor for Yuuna-chan from Alice Stage.",
        "“Well, it’s true that I’m Izumi Yuuna, the voice actor for Yuuna-chan. I’m also confident that I know Yuuna-chan better than anyone else in the world. But, what does that have to do with not showing your room..?”",
        "“…Better than… anyone else in the world..?”",
        "Somehow, that part of Watanae-san’s statement really bothered me.",
        "“Well, I think I know Yuuna-chan better than you.”",
        "“Eh, you really sure about that? I mean, I’m Yuuna-chan herself, you know? I know Yuuna-chan better than anyone else, and I love Yuuna-chan more than anyone else in the world.”",
        "“Don’t underestimate my love for Yuuna-chan.”",
        "I know that I’m getting weirdly stubborn about this.",
        "But, this is one thing I won’t give up on.",
        "You can’t hurt them, and they can’t hurt you.",
        "That is why I decided I would only love 2D girls. And among the vast amount of 2D girls, Yuuna-chan means the world to me.",
        "“If you say so, then sure. I’ll show you my room. I’ll offer my everything to Yuuna-chan!”",
        "◆",
        "A few minutes later.",
        "I resolved myself and opened the door to my room.",
        "The sun was setting, and its warm and orange sunlight shone through my curtains.",
        "I could hear the sounds of crows in the distance.",
        "In the midst of such a peaceful evening, Watanae-san stepped into my room.",
        "My room was filled with Yuuna-chan merch all over the place.",
        "I could tell that, right beside me, Watanae-san was blown away looking at my room.",
        "“Incredible… Badges, keychains… even figurines?”",
        "“The figurine was a limited edition, so I signed up and bought it on the very same day it came out.”",
        "“Oh! This one is from the online radio.”",
        "“Right, hand towels from Alice Stage! I bought 5 of them.”",
        "“Hmm? This poster…”",
        "“…Y-yeah.”",
        "“This is the poster sold for the characters who got voted into the Top 11!”",
        "“It’s a great poster, right?”",
        "“Nnn, but… Yuuna isn’t famous enough so she can’t be in posters like these yet.”",
        "“I know right? But I like that part of her too!”",
        "“But… how is Yuuna here?”",
        "“…Y-yeah.”",
        "What she was saying was on point, so I just nodded my head.",
        "“For me, Yuuna-chan is my one and only. So, I printed out an image I found on the Internet and tried to make it look as good as possible…”",
        "“It’s really well made. She blends in so well, I couldn’t even tell it was an edit… I was so shocked.”",
        "Yes, I’m aware that a normal person wouldn’t do something like this.",
        "But, I don’t regret it because it’s for Yuuna’s sake.",
        "Taking one look at me, Watanae-san let out a sigh.",
        "Then…",
        "“Yuuna-chan will always be right by your side~ So, why don’t we both smile together~”",
        "“…Eh?!”",
        "I looked at Watanae-san as my body shuddered.",
        "“J-just now! I heard the voice of Yuuna-chan, right?!”",
        "“I already told you I’m her voice actor, didn’t I?”",
        "Watanae-san raised her glasses and looked a little proud as she said that.",
        "“It’s a good line, isn’t it? It’s Yuuna’s first line, and it’s my favorite line.”",
        "“…Me too. I love everything about Yuuna-chan, and I really love that line. No matter how bad the circumstances, no matter how depressed I get… She gives me the courage to get up again.”",
        "That day when I was holed up in my room, I felt so depressed.",
        "Her words cheered me up. To me, her words are really, really precious.",
        "Seeing me like that, Watanai-san giggled.",
        "“Since you said you were a fan, I gave you a bit of fan-service. I’ll have to head home soon, so…”",
        "Little by little, Watanai-san’s expression became gloomy.",
        "When I saw her face, I immediately knew how she must’ve been feeling.",
        "“You’re right. Imagine… an arranged marriage in the 21st century.”",
        "“Yeah. But, it was fun talking to you, Sakata-kun.”",
        "“I also enjoyed talking with you… But, marriage is just…”",
        "Sure, she’s the closest thing in the world to Yuuna-chan, but…",
        "At the end of the day, she’s not Yuuna-chan, she’s Watanae Yuuka.",
        "Voice actors aren’t 2D characters… They’re 3D people.",
        "Because of my parents’ divorce, I couldn’t even imagine myself ever marrying anyone.",
        "Because of the painful events in my past, I’m scared of falling in love with a 3D person, where I don’t have walkthroughs or guides to help me.",
        "It’s impossible for me to marry her.",
        "Watanae-san is a really nice person. I know this from our conversations together. That’s why I want her to look for a better person and be happy…",
        "“One last thing before you go. Thank you for giving birth to Yuuna-chan. You really saved my life.”",
        "“Aren’t you exaggerating this..?”",
        "“It’s not an exaggeration. I love Yuuna-chan with all my heart. I look at her picture so many times every day to cheer me up, and I can’t even tell how many fan letters I’ve sent.”",
        "As I was saying this, I unintentionally had an awkward smile on my face.",
        "After all, as her voice actor, she probably feels disgusted and creeped out.",
        "This is why I’m scared of having conversations with girls. Because I might just casually say something that could hurt them.",
        "“…Those fan letters made me very happy, you know?”",
        "But, contrary to my fears, Watanae-san had a distant look in her eyes. She reached into her pouch and she took out the pink envelope I just helped her retrieve.",
        "Then, she turned her gaze down to the letter and smiled bashfully.",
        "“This letter you helped me retrieve earlier… This is from one of Yuuna’s biggest fans. It’s a really important letter to me. This person has sent me many letters time and time again. Thanks to that, I always manage to keep smiling a lot.”",
        "“I see… so that’s why you’re working so hard…”",
        "The internet is really booming right now.",
        "Most people just send emails nowadays, and people who still write letters are… probably old-fashioned people.",
        "I don’t know who this person is, but I feel like I can get along with them.",
        "“By the way Sakata-kun. What pen name do you use?”",
        "Watanae-san looked at me with sparkling eyes.",
        "“If you send me fan mail, then you must use email, right? Even though lots of people send me fan mail, I always remember each and everyone’s names, because all my fans are really important and precious!”",
        "“Ah… N-no… I don’t use email though…”",
        "Getting overpowered by Watanae-san’s excitement, I nervously told her my pen name.",
        "“My pen name is 『The Grim Reaper in Love』. I feel like emails don’t really get my feelings across, so I always send letters…”",
        "“『The Grim Reaper in Love』?!”",
        "Watanae-san’s round eyes got even wider.",
        "At that moment, the envelope in her hand fluttered to the ground.",
        "And on the letter, I could clearly see the sender’s name.",
        "『The Grim Reaper in Love』",
        "That was definitely… my name.",
        "◆",
        "Next chapter probably in 2-3 days.",
        "So that was a lie. The chapter was a little shorter than I expected, and I got a little help. As always, please make any suggestions or corrections to my translations, because I kinda just did a speedrun for this chapter.",
        "Next chapter should be tomorrow."
    ]
}