{
    "id": "chapter-16-spending-the-night-with-my-fiance-2-2",
    "title": "Chapter 16: Spending the night with my fiance (2/2)",
    "content": [
        "It looks like I had unconsciously kept my eyes closed the whole time.",
        "After I pulled the covers off of Yuuka, I gently placed them next to her.",
        "Then, I nervously opened my eyes.",
        "And what I saw was…",
        "“….Fuu…”",
        "She was sleeping peacefully and comfortably.",
        "I was confused by this unexpected turn of events.",
        "“…Err.”",
        "“Munya…”",
        "“Yuuka? Yuuka-san~”",
        "“Funya…”",
        "Ah, it’s hopeless.",
        "She’s already completely asleep.",
        "Well, if you pull the covers over your head, you’d obviously start getting warmer.",
        "It’s natural that you’d get drowsy.",
        "“…Yuu-kun…”",
        "Yuuka muttered my name in her sleep and smiled happily.",
        "The innocent expression on her face made me feel at ease.",
        "I feel like an idiot for stressing over her earlier.",
        "I tapped Yuuka’s shoulders lightly.",
        "“…Fuhehe~…”",
        "Looks like she liked it, because Yuuka started giggling in her sleep.",
        "How defenseless she is, this girl.",
        "Letting out a sigh, I lied down on my futon next to Yuuka.",
        "“…Well, I guess I was only interested in 2D girls in the first place.”",
        "I reminded myself.",
        "It’s true that we’re both fiances now, but…",
        "I still don’t know everything about Yuuka.",
        "And Yuuka doesn’t know everything about me either.",
        "So, doing something like ‘that’ without any preparation… is definitely wrong.",
        "“In fact, I don’t even know if our cohabitation together will go smoothly…”",
        "I muttered to no one in particular.",
        "Then, I put my hand on Yuuka’s head, who looked so carefree as she was sleeping comfortably.",
        "Her fluffy hair tickled my fingertips as I touched her.",
        "It felt so comfortable… I continued to stroke Yuuka’s head.",
        "“…Funyaa…”",
        "Yuuka turned over in her sleep and faced my direction.",
        "Her lips were pursed in a bashful smile as she slept, making her face look innocent.",
        "Somehow… she reminded me of Yuuna-chan.",
        "Only a little bit though…",
        "◆",
        "The next day.",
        "When Yuuka woke up, she was so depressed that it was out of this world.",
        "“I fell asleep… Why did I waste my time so uselessly…”",
        "Yuuka kept muttering those words like a curse.",
        "“You looked like you slept really well, so I don’t really-”",
        "“It doesn’t matter if I slept so comfortably! I wanted to make Yuu-kun feel good… Ahh, mouu… I’m a baka…”",
        "Yuuka had an exaggerated reaction to my words as she cowered under her futon and sobbed.",
        "You don’t have to worry so much about it.",
        "In fact, I’m rather relieved that I didn’t have to resolve myself and do anything yesterday…",
        "“…Nnn?”",
        "At that very moment…",
        "Yuuka grabbed some of her hair.",
        "Then…",
        "“Noooooooooo!!!”",
        "Yuka’s scream echoed through our house in the morning.",
        "“Don’t look at meeee!!!”",
        "And then, poof.",
        "She hit me as hard as she could with a pillow. Right on my face. How unreasonable.",
        "“Ehhhh?! Why is my hair so messy today! Mouu!!!”",
        "The state of depression she was in earlier was nowhere to be seen.",
        "This time, Yuuka seemed to be in a panic as she ran towards the bathroom.",
        "Ah… her hair.",
        "It’s probably because I kept stroking her hair last night.",
        "It looks like she’ll get angry at me though, so I’ll just stay silent for now.",
        "◆",
        "We all saw this coming. Here’s the last chapter for today. I’ll try and get 2-3 chapters out tomorrow. Looks like we finally got the context for one of the color illustrations! Also, I’m having a little fun with ads right now, but don’t worry, I’ll probably turn those off next week, unless I don’t get any more donations (草)"
    ]
}