{
    "id": "chapter-15-spending-the-night-with-my-fiance-1-2",
    "title": "Chapter 15: Spending the night with my fiance (1/2)",
    "content": [
        "— Even though I’ve already… prepared myself.",
        "— You shouldn’t ask those kinds of things to girls… baka",
        "A recap of what happened last time.",
        "After an unexpected turn of events, one of my classmates, Watanae Yuuka, became my fiance.",
        "We had a platonic relationship, but on a stormy night, we ended up sleeping in the same room.",
        "And on that night, Yuuka said some very suggestive words to me.",
        "So, what will you do, Yuuichi?",
        "“Yuu-kun?”",
        "As I was absorbed in my imaginary narration, Yuuka’s voice brought me back to reality.",
        "With the futon hiding the lower part of her face, Yuka muttered with moist eyes.",
        "“D-do you not want to do it..?”",
        "“Ehh?! I-it’s not like I don’t want to!”",
        "“B-because Yuu-kun, you have this expression that makes you look like you’re feeling troubled…”",
        "“Ahh… I guess I am somewhat troubled…”",
        "“See? So you are troubled… I must’ve been a bother, huh… you baka.”",
        "Yuuka’s puffed out her cheeks as she said that.",
        "…Yuuka did say that she had prepared herself for this.",
        "I could see Yuuka’s crystal clear eyes.",
        "Ah… If you keep looking at me with those eyes, obviously it’d be bad…",
        "I could gradually feel my mind going blank…",
        "“…Eh?”",
        "Yuuka made a small sound.",
        "“Ah! S-sorry!”",
        "I found myself unconsciously putting my hand on Yuuka’s cheek.",
        "I quickly pulled my hand back and turned my back on Yuuka.",
        "It was so soft and warm…",
        "When I remembered the sensation of her skin, I felt my heart pounding faster and faster.",
        "“Y-you must’ve hated it… Sorry…”",
        "“N-no, it’s not that I hated it or anything…”",
        "“But, you made that troubled expression…”",
        "“I-I’m troubled… because I’m so embarrassed and I don’t know what to do…”",
        "When I turned around, I saw Yuuka squirming around in her futon.",
        "Her blanket was right over her lips.",
        "Her eyes were moist. Her cheeks were flushed.",
        "She was different from usual… she was so captivating.",
        "“Umm… please be gentle, okay?”",
        "That was all she said.",
        "With a swoosh, Yuka pulled the covers over her head.",
        "……",
        "……Gentle?",
        "That… she’s implying ‘that’ thing, right?",
        "An inappropriate fantasy ran through my mind.",
        "But, at the same time, the nightmare I had during middle school came back to me.",
        "Should I do it? Should I not do it?",
        "I’m the one who sealed myself off from romance with 3D girls because I didn’t want to hurt each other.",
        "I swore that I would only love 2D girls.",
        "But even so… I’m not so emotionless that I’d be able to ignore this kind of situation.",
        "“H-hyau!”",
        "I held Yuuka’s small hand.",
        "I could feel Yuuka’s warmth coming from my palm.",
        "A cry like that of a small animal goes through my ears and tickles my brain.",
        "Yuuka held my hand tightly and wouldn’t let go.",
        "…which means..?",
        "“…Nononononono.”",
        "I felt some wicked thoughts growing inside me, and I tried to shake them off with determination and willpower.",
        "Calm down, Yuuichi.",
        "It’s true that she’s the voice actress of my favorite heroine Yuuna-chan, Izumi Yuuna.",
        "She’s as close to Yuuna-chan as you can get in 3D.",
        "But, in the end, she’s still a 3D girl.",
        "I can’t go any further than this.",
        "If I keep going, I might end up getting hurt again, just like what happened during middle school.",
        "On the other hand, I also might end up hurting Yuuka.",
        "“…Nnn”",
        "Yuuka’s moan tinged with anxiety tickled my ears.",
        "The stimulation made my front go numb.",
        "I felt something inside of me snap.",
        "I might regret it again.",
        "This might turn into another traumatic experience.",
        "But… I have to calm my racing heart down.",
        "This is the only way.",
        "“Yuuka.”",
        "I called out the name of my fiance.",
        "Then, I resolved myself… and forcibly pulled the covers off of Yuuka.",
        "◆",
        "1 more chapter coming. It’s getting a little hot here."
    ]
}