{
    "id": "chapter-37-i-was-forced-to-volunteer-on-my-day-off-2-2",
    "title": "Chapter 37: I was forced to volunteer on my day off (2/2)",
    "content": [
        "“Onii-chan.”",
        "While I was in a daze, a girl tugged at the hem of my apron.",
        "I resolved myself and crouched down, making eye contact with the girl.",
        "“What’s wrong?”",
        "“Umm, you see… high, high!”",
        "“Err… so you want to go really high?”",
        "“Yeah! Because Onii-chan is big!”",
        "Just like what the girl wanted, I gave her a ride on my shoulders and stood up.",
        "“Waa, so high!”",
        "The girl clinging to my back was squealing and giggling.",
        "Her innocence was so charming, it made me smile, and I spun around.",
        "“Waa! Spinning!!!”",
        "“Hey! You look like you’re having fun! Onii-chan is really big, isn’t he?”",
        "Watching us smiling and laughing, Nihara-san approached us.",
        "“Come on, everybody. You can play a lot with this Onii-chan here!”",
        "“Really?!”",
        "“Yay!!!”",
        "Taking Nihara-san’s words as their command, lots of children started swarming me.",
        "Some were clinging onto my legs, and some others were leaping onto my waist.",
        "Ouch, I just got punched for no reason?!",
        "Hey, stop using that wooden stick on me!",
        "“Ahahaha! Sakata, the kids are really attached to you!”",
        "“It’s probably because you encouraged them in a weird way.”",
        "“You give off the impression of a kind father, Sakata! Great job!”",
        "Being a father is definitely too early for me.",
        "But… as a husband.",
        "I’ll do everything I can to support my wife. That’s for sure.",
        "◆",
        "Snack time was over.",
        "Little by little, the children were going home, accompanied by their mothers who were picking them up.",
        "Some of the children waved to me with big smiles on their faces as they left.",
        "I probably had a natural-looking smile on my face too as I waved back at them.",
        "“Sup, Sakata.”",
        "Nihara-san slapped me on my back.",
        "“Surprisingly, you look like you were having fun out there. Is this what you meant by being good with children?”",
        "“It’s not that… I’ve always had to deal with my egotistical sister for a long time.”",
        "“Well, I had so much fun! Kids are innocent, and they’re so cute!”",
        "“You sure are good at handling kids, aren’t you, Nihara-san?”",
        "“Not just with kids… I’m also really good at opening the hearts of boys, you know?”",
        "She bragged to me as she looked up at me with upturned eyes.",
        "Her eyes were radiant, and they were adorned with really long eyelashes. I couldn’t help but avert my eyes from her face.",
        "“Ahaha, you got embarrassed! You’re so funny, Sakata.”",
        "“…Yes, yes.”",
        "“Nihara-san, Sakata-kun, it’s about time for you two to head home as well.”",
        "The preschool teacher I greeted earlier this morning found us and called out to us.",
        "“I’m sorry about today. Atsuko must’ve forced you two to volunteer, right?”",
        "“Err… umm…”",
        "“Atsuko… Gousaki-sensei was my junior at university. You probably know this, but once he sets his mind on something, he won’t listen to anything anyone else says, right? This time as well, he said something like, ‘I’ll have them gain life experience by having them help Senpai out!’ and just recklessly decided things on his own.”",
        "Ah… so that’s how it was.",
        "If you knew how Gousaki-sensei usually was, then everything would start making sense.",
        "“Atsuko is an outgoing person who doesn’t listen to others, and he’s oblivious to the fact that he sometimes causes trouble for other people. But, he’s a kind person who cares about his students more than anyone else. He may be annoying at times, though.”",
        "“Ah, I get what you mean. His personality is a bit strange, but I don’t mind at all.”",
        "Nihara-san had a carefree smile on her face.",
        "Seemingly relieved by her reaction, the preschool teacher smiled too.",
        "“…Waa…”",
        "Just like that, we continued conversing with the teacher.",
        "“…*sniffle*…*sniffle*…Waaaaaahh!!!”",
        "The sound of a boy’s crying echoed throughout the area.",
        "It was the same boy who had been playing with the Cosmos Miracle Man figure earlier with Nihara-san.",
        "He was smiling so much when he was playing, but now his face was stained with tears.",
        "“Eh, what’s wrong? Are you okay?”",
        "Nihara-san quickly rushed over to the boy.",
        "“Mama… hasn’t arrived yet…”",
        "“Takkun’s mother will arrive… in an hour. Just a bit longer.”",
        "“No! I wanna go home! Everybody else already went home!”",
        "No matter how hard the teacher tried to calm him down, once he started crying, there was no sign of him stopping.",
        "The more we tried to talk to him, the more heated he became, and he continued to scream and yell.",
        "“Oh no… what should we do?”",
        "It looks like even Nihara-san wasn’t used to this kind of situation.",
        "I just stood there, completely helpless.",
        "I don’t know what kind of face I should make in this kind of situation…",
        "“… Don’t cry, everything will be alright.”",
        "*swoosh*",
        "A swaying ponytail tickled the tip of my nose.",
        "She softened her sharp expression and crouched down on the spot.",
        "She… Watanae Yuuka, patted the boy’s head",
        "“Your mama will definitely come. Because she really loves you, she will definitely come.”",
        "“…But, she still hasn’t come yet, you know?”",
        "【TLN: I’m not sure if preschoolers can speak this advanced, but whatever】",
        "“If you play around for a bit, your mom will arrive before you know it. All right.”",
        "Yuuka smiled and handed the boy a Cosmos Miracle Man figure that had fallen to the ground.",
        "“The ally of justice does his best even when he’s in trouble. Can you do the same?”",
        "“…Yeah. I can.”",
        "“I see… That’s very cool. You’re just like a hero.”",
        "The boy smiled once more as Yuuka continued to pat him and calm him down.",
        "“Watanae-san, what are you doing here?”",
        "Nihara-san looked flabbergasted as she looked at Yuuka.",
        "“I’m the one who was asked to volunteer in the first place. I came because I had finished all my errands.”",
        "“I see.”",
        "“Thank you very much. You really helped me out here.”",
        "The teacher clasped her hands together and thanked Yuuka.",
        "Yuuka bowed her head and continued to pat the boy who was clinging to her leg.",
        "“Can I stay here until the boy is picked up? If I head home first, the boy might get anxious.”",
        "“Of course, that’d be a huge help, but… Are you sure you’re okay with that?”",
        "“Yes.”",
        "“Ah, then I’ll stay here too!”",
        "I hurriedly raised my hand and appealed to the teacher.",
        "“What about you, Nihara-san?”",
        "Yuuka asked her with a blank expression on her face, as usual.",
        "Nihara-san stared at Yuuka’s face.",
        "“…Actually, I have something to do right now. I’m sorry, but can I leave this to the two of you?”",
        "“Sure.”",
        "“Okay, Takkun. Go ahead and play a lot with the both of them, okay?”",
        "“Yeah! Onee-chan, thank you so much!”",
        "“Yes, yes, you’re welcome. Next time, should we play with the Cosmos Miracle Seven?”",
        "“Yeah. And Cosmos Miracle Man’s transformed version!”",
        "Then, Nihara-san took off her apron.",
        "She quickly offered it to Yuuka.",
        "“Here. You didn’t bring one with you, right?”",
        "“Ah… thank you.”",
        "“I’ll have you thank me by coming along with me for karaoke sometime soon.”",
        "After making such a one-sided promise, Nihara-san left, waving at us.",
        "The teacher also went back into the school, probably to do some other work.",
        "The only people left in the yard were the boy, me, and… Yuuka.",
        "“…Yuuka. Umm…”",
        "Why are you here?",
        "I was about to ask her that, but she interrupted me and bashfully smiled at me.",
        "“Ehehe, I came here because I wanted to see Yuu-kun as soon as possible.”",
        "Her smile wasn’t one from Watanae Yuuka in her school persona.",
        "It was the smile from my innocent fiance… Yuuka.",
        "◆",
        "Discord: https://discord.gg/6kFNSeZWHX Poll: https://forms.gle/2onmNMU2cWiLPfaD6 Also, my server is bullying me, and I even have semperfi201 in my server. So a minus and a plus. Last 3 chapters will take… 3 days. I’m late, I know. Blame AJ1703.",
        "Ko-fi"
    ]
}