{
    "id": "chapter-3",
    "title": "[Urgent] The correct way of writing Tanzaku for Tanabata",
    "content": [
        "“All right, everybody! Take your seats!”",
        "The door to my classroom slammed open and my homeroom teacher, Gousaki Atsuko, walked in.",
        "My classmates, who had been chatting with each other, hurriedly returned to their seats.",
        "And as usual, Gousaki-sensei started homeroom class.",
        "“Do you guys know what day it is today? Nihara, you?”",
        "“Eh?”",
        "Nihara-san put her hand to her lips and replied, with a face that seemed to say, “ehh, what is it again?”",
        "“Is it Tanabata?”",
        "“Yes, Tanabata. Then, Watanae. Do you know kind of day Tanabata is?”",
        "“Yes.”",
        "Yuuka slowly stood up and pushed her glasses up.",
        "“It is the only day when Orihime and Hikoboshi, who are separated by the Milky Way, can meet each year. The custom is to hang strips of paper from bamboo branches and write your wishes on them.”",
        "As expected of the Watanae Yuuka at school.",
        "With an unchanging expression, she gave a model answer — creating an unapproachable atmosphere that I couldn’t imagine her having back at home.",
        "In private with me, she’s an earnest, talkative girl.",
        "As I was absentmindedly thinking about this, Gousaki-sensei smiled happily.",
        "“For everyone to enjoy such an occasion, the student council has prepared a Tanabata event. Do you see those bamboo branches in the schoolyard? Write your wishes on strips of paper and hang them there. You can indeed be anonymous.”",
        "When I looked out the window at the schoolyard, I saw large, prepared bamboo branches.",
        "“Let’s get the school involved with the event!” The student council sure was a cheerful bunch… I would definitely not be the guy for that job.",
        "And…with a felt-tip pen, I stare at the tanzaku I’ve been handed.(ED: A tanzaku is a strip of paper that one writes their wishes on and hangs somewhere during Tanabata.)",
        "My wish, huh?",
        "“Sakata, you’re actually putting thought into this? That’s hilarious!”",
        "I looked up and saw Nihara-san looking at me and smiling.",
        "“Nihara-san, have you finished yours yet?”",
        "“Yes. I always — and only have one wish.”",
        "On the tanzaku she held out to me, the words 『World Peace』were written in large letters.",
        "“Uhh. Nihara-san…are you kidding me?”",
        "“I’m not joking. This is what I seriously wish for.”",
        "“You’re like a hero… ahh, speaking of heroes. I was at the store the other day, and I saw a toy—”",
        "“Come on, Sakata, hurry up and write! Stop chattering away!”",
        "She was the one who initiated the conversation… As usual, I couldn’t understand what she was thinking.",
        "Well…even if I didn’t understand, her wish wouldn’t change.",
        "I had one of those — for sure.",
        "When I walked out into the schoolyard with my tanzaku, I saw that many students had already gathered around the bamboo branches.",
        "In the midst of all this, suddenly — I glanced down at the tanzaku I had written on.",
        "『I wish her all the happiness in the world.』",
        "In order to make sure that no one would find out, I didn’t mention “her” name, and of course, I didn’t sign my name on it.",
        "—Yuuna-chan.",
        "If I close my eyes, I can always see her bring a smile to my face and energy to my life as the dimension-transcending, best idol.",
        "Her curly hair with brown twin-tails.",
        "Her droopy eyes that suit her pretty face. Her squeaky-like-a-cat voice.",
        "Wearing a pink tunic, a checked mini-skirt, and black knee-high socks. The gap between them and the absolute area of her body was so glossy and dazzling that it made me nervous.",
        "Such is my goddess — Yuuna-chan.",
        "In my head, I smiled shyly.",
        "—Yuu-kun! Let’s watch some anime together today, okay?",
        "I sighed, opening my eyes.",
        "Because the voice I hear now was Yuuna-chan’s, but it wasn’t Yuuna-chan.",
        "Instead, it was the voice actor of Izumi Yuuna.",
        "—Yes.",
        "It was the voice of my fiance… Yuuka, laughing innocently at home.",
        "“W-What are you doing?”",
        "I came to my senses when I heard an inarticulate voice behind me.",
        "When I turned around, I saw—Watanae Yuuka, who was wearing a school uniform.",
        "“I’m waiting behind you, so hurry up.”",
        "“Ah. Yeah… sorry.”",
        "I quickly hung the strips of paper on the bamboo branches and let Yuuka have her turn.",
        "Then, as I started to walk back to the classroom…I got a bad feeling.",
        "…Yuuka, you didn’t write anything weird, did you?",
        "I felt bad about looking without permission, but I turned around — stared intently at Yuuka’s tanzaku.",
        "『I love Yuu-kun. Second year, first class, Watanae Yuuka.』",
        "I hurriedly jumped onto the bamboo branches and snatched the tanzaku that Yuuka had hung up.",
        "Yuka rolled her eyes for a moment, but…quickly returned to her usual straight face.",
        "“Sakata-kun. Give it back.”",
        "Wait, no! What you wrote was clearly no good, you know?",
        "After looking around to check our surroundings, Yuuka and I quickly moved to the back of a large tree in the corner of the yard.",
        "“…Hey, Yuu-kun. Give that back. It’s my number one request.”",
        "“Umm…I’ve got so many questions, my head hurts. First of all, this isn’t a request or anything, is it? It’s more of Yuuka’s opinion.”",
        "“But I really do think…”",
        "“Even if I did think that, right? What do you think would happen if you hung this up with your name written on it? Rumors like who is ‘Watanae’s love, Yuu-kun?’ would spread fast.”",
        "Don’t underestimate the power of rumors.",
        "“If word got out that Yuuka and I were living together…it would cause a huge commotion at school right? And Yuuka is also a voice actress of Izumi Yuuna. It’s dangerous to not care about what people think.”",
        "For young female voice actors, scandals with men were fatal to their careers.",
        "It reminds me of just the other day, when a female voice actress who was found to be living with her boyfriend caused a huge internet firestorm.",
        "Those who had been her fans in the past going through an uproar and giving her hell — I don’t want the hard-working Yuuka to go through that.",
        "As both Yuuka’s fiance “Sakata Yuuichi” and as Yuuna’s biggest fan “The Grim Reaper in Love”, that’s what I thought…",
        "“B-but! If you write a lie on a tanzaku, bad things might happen to you like divine punishment…”",
        "“Huh?”",
        "It was such an unexpected turn of events that I unconsciously made a strange noise.",
        "While looking up at me, Yuuka tightly bit her lips.",
        "“That’s why I want to write my name properly and send my feelings of ‘I love Yuu-kun’ to the Milky Way.”",
        "“… Um. Are Orihime and Hikoboshi gods or something?”",
        "“Sakata. What are you doing here?”",
        "Suddenly, a voice called out to me, and Yuka and I hurriedly distanced ourselves.",
        "Then, fearfully, I turn around.",
        "“Ah-eh? Why is Watanae-san here too?”",
        "“…by chance.”",
        "Yuuka, who suddenly became expressionless, said nonchalantly while fixing her glasses.",
        "It’s overly suspicious, but…the grim-faced Nihara-san didn’t care. However, that wasn’t important right now.",
        "In Nihara-san’s hand was… my tanzaku.",
        "『I wish her all the happiness in the world.』(Summary: May Yuuna be happy.)",
        "Yuuka stared at me as I took the tanazaku from Nihara-san.",
        "I hide Yuuka’s tanzaku behind my back and stared at Nihara-san.",
        "And then — Nihara-san, who was holding my tanzaku, had a rare serious look on her face.",
        "—What is this situation?",
        "“First of all, I’m sorry, Sakata…I took a look at your strip without permission.”",
        "“Ah, well…umm, yeah.”",
        "“I know it’s my fault, but let me ask you… this ‘her’ is?”",
        "It’s Yuuna-chan from Alice Stage.",
        "I wish I could answer that immediately.",
        "I made a lot of noise when Masa and I had a guessing contest—As a person with naturally low communication skills, I basically don’t want to openly say that I’m an otaku as it would be troublesome.",
        "“I see, I see.”",
        "While I kept silent, Nihara-san gave a small nod. I wonder what she had figured out.",
        "Then, she let out a sigh.",
        "“How halfhearted. Just forget about her. You should start a new relationship to raise your spirits. You know what I’m talking about, right?”",
        "“…Wha?”",
        "Nihara-san said that with a complaining tone of voice. I couldn’t understand; it didn’t ring a bell at all.",
        "I didn’t know how she interpreted my confusion, but Nihara-san let out another sigh.",
        "“You’ve still got that look on your face…I knew it. There’s still something left, isn’t there? She’s still in your mind, isn’t she?”",
        "“Who?”",
        "“I don’t want you to be evasive. So, to put it bluntly…I’m talking about Raimu.”",
        "Raimu.",
        "The moment I heard that name, I felt the blood in my body drain away at once.",
        "Old wounds began to reemerge.",
        "To put it in a chuunibyou way, “Settle down, my sealed right arm!” That’s how I feel.",
        "“‘I wish Raimu all the happiness in the world!’… Sakata, I’m serious, but I think you should forget about Raimu.”",
        "Well, actually, you kind of remind me of her.",
        "Seriously though, I was only thinking about Yuuna-chan.",
        "Nonoka Raimu—I’ll never forget the name of a classmate who I had a crush on when I was in the third year of middle school.",
        "I’ve been living my life as a “cheery otaku” for so long that it’s painful.",
        "I’m the one who got carried away and thought I was someone special.",
        "I never expected to be rejected—but I was.",
        "“Hey. Do you…want to go out with me?”",
        "“Um…I’m sorry. I can’t do that.”",
        "And the next day, the rumor of the brutal rejection of my confession spread throughout the class.",
        "They teased me, made fun of me, and I stopped wanting to go to school.",
        "When I was in the depths of hell, I was rescued by a goddess named Yuuna-chan.",
        "The person who symbolized such a grueling black history—Nonoka Raimu.",
        "“…Hey. Sakata, you look like you’re about to cry.”",
        "Whose fault is it?",
        "It’s even worse when this cheerful gal doesn’t mean any harm.",
        "“Hmm, but…it isn’t that easy. Yes, I understand. Your Onee-san…”",
        "“I’m telling you, who’s the Onee-san? We’re the same age.”",
        "“This Onee-san spirit of Nihara Momono—For Sakata’s sake, I’ll give you a helping hand, not once, but twice!”",
        "“I didn’t ask for this, are you serious!?”",
        "I clearly said no, but once a gal is lit up, she won’t stop.",
        "“Okay, okay. After all, it takes new love to forget love. All right, I’ve made up my mind! To make Sakata smile, I’ll give you lots of love!”",
        "“No, I didn’t ask for it, did I?”",
        "“As I promised you the other day, I’ll make you the best meal of the summer! Then I’ll sleep with you, pet your head—I’ll make you feel like a baby!”",
        "“Please, I’m begging you—Muguu!?”",
        "Before I could finish, my face was shoved into something. I couldn’t even breathe.",
        "A sweet, indescribable scent.",
        "It’s soft, warm, and comfortable…",
        "—Guh, isn’t this very bad!?",
        "“Mugiu, Mugiu…Muhaa!?”",
        "With all my strength, I pulled my face away from something and tried to catch my breath.",
        "In front of me, as expected, was Nihara-san’s bountiful chest.",
        "As if to highlight her seductiveness, her cleavage could be seen through the gap in her blazer.",
        "Nihara-san squeezed and twisted her arms to emphasize her chest.",
        "“See…Sakata? I can spoil you as much as you like. Feel a lot of love. Let’s blow away your unpleasant past all together.”",
        "“I didn’t ask, and I’m not going to ask for it! I mean, I’m seriously done with Raimu.”",
        "“Illicit sexual relationship.”",
        "A single, sub zero voice instantly cut through the slapstick conversation between Nihara-san and me.",
        "When I turned my head to look with trepidation, I saw Yuuka with frighteningly cold eyes.",
        "“Yuu…Watanae-san?”",
        "“This is a school. It’s not the place to have frivolous conversations about love and romance.”",
        "She’s one to talk for someone who just wrote “I love Yuu-kun” on her strip of paper.",
        "“Ah, I’m sorry, Watanae-san…that’s right. This is school.”",
        "After Yuuka’s words, Nihara-san quickly toned down and walked back to the school building.",
        "And there were only two left—me and Yuuka.",
        "“Uhhh. You know, Yuu—”",
        "“…Yuu-kun is an idiot.”",
        "As soon as Nihara-san was gone, Yuuka’s IQ seemed to drop drastically.",
        "Then, Yuuka puffed her cheeks up.",
        "I couldn’t believe she’s the one who just said something about an “illicit sexual relationship”.",
        "“…When we get home, I’m going to make sure you understand that you’re happier when you’re flirting with me.”"
    ]
}