{
    "id": "chapter-12-how-to-wake-someone-up-and-make-them-think-ah-i-should-just-sleep-forever-1-2",
    "title": "Chapter 12: How to wake someone up and make them think “Ah, I should just sleep forever” (1/2)",
    "content": [
        "『Come on, it’s morning! Wake up, wake up! Mouu, even though Yuuna is trying her best here…』",
        "“Damn… she’s cute. This is the peak of cuteness…”",
        "I was staring at my phone, mumbling to myself.",
        "A little while ago, I started rolling the『Love Idol Dream！Alice Stage ☆』gacha.",
        "I didn’t spend any money, but somehow, I got 『Yuuna (Normal)』.",
        "Getting Yuuna on my first try… Is this fate?",
        "By the way, they’re currently running an event called 『The Alice Idols come to wake you up!』.",
        "With this voice, I think I’ll be able to wake up really well tomorrow. Or maybe, I might never see the sunrise ever again, since I might die of a sugar overdose before that.",
        "“…Yuu-kun, what time do you usually wake up?”",
        "“Wha?!”",
        "I was lying on the couch in the living room when suddenly I heard a voice talking to me. I quickly got up.",
        "Yuuka just finished taking her bath and she was wearing a nightgown as she looked at me. Her hair looks smoother than usual, which makes her look innocent and cute.",
        "“Yuu-kun, you usually get up earlier than me, don’t you?”",
        "“Ah… I usually set my alarm at 7 o’clock, or somewhere around that time.”",
        "“Your sleeping habits are pretty good, aren’t they?”",
        "“Ah, well… What about you, Yuuka?”",
        "“Me? My habits are pretty bad… It feels like I just doze off for a brief moment, and it makes me feel like I hardly get any sleep.”",
        "Our conversation was pretty bland and meaningless. Then, we both headed to our own rooms.",
        "“…Yuu-kun.”",
        "As I opened the door to my room, Yuuka called out to me. When I looked at Yuuka, I could see her eyes sparkling as she looked at me.",
        "“You better prepare yourself tomorrow, ok?”",
        "“…Huh?”",
        "What kind of preparation? I don’t really get it, but I guess I’ll remember what she said.",
        "◆",
        "Mmm…",
        "Ah, looks like I got up before my alarm clock even rang.",
        "I rubbed my sleepy eyes, reached over the top of my futon, and picked up the alarm clock.",
        "It’s now… 6:55, huh?",
        "It’s a little early, but I guess it’d be bad if I went back to sleep.",
        "Right… Guess it’s time to get up.",
        "And so, I sat up in the futon.",
        "And there, I saw… Yuuka’s face.",
        "“Uwaaaaa!”",
        "“Kyaaaaa!”",
        "We both looked at each other and screamed out loud.",
        "I rolled out of the futon and looked at Yuuka who was sitting on my futon.",
        "“Eh? Eh? Why are you here, Yuuka?”",
        "“Why… Even though it’s still 6:55…”",
        "I asked her normally, but Yuuka wouldn’t answer me as she hung her head in frustration.",
        "Umm… Hmm? Was there any foreshadowing that this would happen?",
        "If I remember correctly, I pulled Yuuna on the gacha yesterday.",
        "Then, Yuuka came and asked me what time I usually woke up.",
        "Then, she said, “You better prepare yourself tomorrow, ok?”.",
        "“…I see…”",
        "So, that’s what happened…",
        "Yuuka is trying to copy the event in Alice Stage.",
        "She asked me what time I’d wake up, then she tried to sneak into my room to wake me up.",
        "She really does like acting on the spur of the moment, huh?",
        "“…Can we redo this please?”",
        "“Huh?”",
        "“Because, Yuu-kun! You woke up earlier than you’re supposed to! That’s not fair!”",
        "“It’s not unfair! You’re making it sound like I’m in the wrong here!”",
        "“Anyways! One more time! Just one more time!”",
        "◆",
        "Next chapter coming right up!"
    ]
}