{
    "id": "chapter-30-yuuna-chans-younger-brother-2-2",
    "title": "Chapter 30: Yuuna-chan’s “younger brother” (2/2)",
    "content": [
        "Then, as the program reached the halfway point, it was time for the free talk segment.",
        "“Greetings. I’m Hotta Deru. How is everyone doing?”“Hello! I’m Izumi Yuuna. N-nice to meet you…”",
        "【TLN: She used Hajimemashite, which is what you use to introduce yourself to people you meet for the very first time. I think she was trying to introduce herself to everyone listening.】",
        "“You’re too nervous, Yuuna-chan. There are people who know you too, I’m sure.”",
        "“Ah… you’re right. N-not nice to meet you!”",
        "It’s incredible how nervous she is.",
        "The best part of the free talk segment is, unlike the interactions between them as characters, this segment allows them to interact between themselves as fellow voice actors, which is really exciting… apparently.",
        "The reason I used “apparently” is because usually, I’d only listen to the mini-drama segment, since I was never really interested in the voice actors.",
        "But, this time, it was different.",
        "Because the person who I’ve been living with for a while now… that is, my wife, is in it.",
        "“Yuuna-chan is in the same office as me, and she’s my kouhai!”",
        "“Yes! I’m really grateful for all your help, Hotta-san!”",
        "“Hmm? I’m pretty sure you didn’t come from the Kanto area, right? If I’m not mistaken, you’re living alone right now?”",
        "“Ahh… I used to.”",
        "“Used to?! Ah, was that a bad question? Should we cut here?”",
        "【TLN: Cut as in the term used for movies and stuff, to stop filming.】",
        "“N-no, it’s not that. Recently, my younger brother also moved to this area, and I mean, paying rent is a waste of money, so he’s coming to live with me.”",
        "“Ah. So you’re living together with your younger brother?”",
        "“Yup, that’s right!”",
        "“Uwaa… how lewd.”",
        "“Lewd?! Why?! He’s my brother, you know?!”",
        "“I mean… Is your brother a student?”",
        "“Yes, he’s in high school.”",
        "“Hmm… isn’t that lewd?”",
        "“It’s not lewd! Hotta-san, your thoughts are just too extreme!”",
        "Yuka desperately tried to deny her logic.",
        "Another person’s laugh was added to complement her panic.",
        "But I, as a viewer, was very nervous, and my heart kept thumping constantly.",
        "Err…",
        "I mean… Yuuka is living with me right now.",
        "And right now, I’m sure her sibling is still in Yuuka’s hometown.",
        "In fact, just earlier, she said he was in high school.",
        "And coincidentally, I’m a high school student.",
        "…Which means?",
        "“My brother is a true gentleman. Please don’t disgrace him with your delusions!”",
        "I’m certain.",
        "She’s… talking about me.",
        "“What? Don’t make it sound like I’m a bad person. This is normal, you know? If he’s a healthy high school student, he would definitely be excited to have such a cute older sister at home”",
        "“Well… I do think we get along just fine, but… he never looks at me that way, you know? In fact, he always says he’s only interested in 2D!”",
        "“Doesn’t that make him an oddball?”",
        "Using the guise of a “little brother” to talk about her fiance… how bold.",
        "What a terrifying girl you are, Watanae Yuuka…",
        "“By the way, how close are you with your brother?”",
        "“Let’s see… I watch stuff like anime together with him, and we walk to school together.”",
        "“You two are so close! Wouldn’t that definitely make your brother nervous or excited or something like that?”",
        "“Well, I think I’m the one who’s more nervous… Not in a lewd way, but in a loving way!”",
        "OK, I’m vomiting blood here.",
        "Well, I’m not actually vomiting blood here, but it feels like I am.",
        "This is already on the level of a public execution.",
        "If people find out Yuuka’s talking about me… her fans all over the country will kill me… For sure.",
        "“Yuuna-chan, you really love your brother, don’t you?”",
        "“Yes! I really love him!”",
        "“By the way, Yuuna-chan, do you know any celebrity or entertainer who resembles your brother?”",
        "“A doggy!”",
        "“I was asking about celebrities though?!”",
        "Yuuka kept talking without regard to Hotta-san’s remark.",
        "“Usually, he’s like a golden retriever! He’s bigger and taller than me, he’s attractive, and somehow, I feel like he’s protecting me. But, but, but! Sometimes, how do I say this… he’s like a chihuahua! He makes you feel like, Fuaa… how cute… I want to gobble him up… or something like that, you know? He’s just too lovable! or something like that! You get what I mean, right?! Right?!”",
        "“Y-yeah…”",
        "Her senpai, Hotta-san, is completely lost for words as she looks uncomfortable.",
        "Wake up, Yuuka! And please stop it already!",
        "“Recently, we’ve been sleeping together, you know!”",
        "“You’ve been sleeping together?! He’s your brother, right?!”",
        "“Yes, he’s my brother! So, one day I woke up in the middle of the night, and right next to me, I saw my brother breathing peacefully in his sleep. He was just so cute! I just thought, Ah, I love him too much!”",
        "You were doing that while I was sleeping?",
        "Or rather, isn’t this an online radio? Anyone in the country can watch this, right?!",
        "Please don’t spread any more information about me… I’m begging you.",
        "But Yuuka didn’t hold back and continued dropping bombshells.",
        "“And then, I couldn’t hold myself back any longer.”",
        "“Eh? Hold back..? Does that mean..?”",
        "“Yes… I did it.”",
        "“You did it?!”",
        "“Yes… I did it secretly, while my brother was sleeping.”",
        "“You really did it?!”",
        "“Is it… not okay?”",
        "“It’s not okay for the radio and it’s not okay legally!”",
        "Yuuka took “free talk” way too far as she completely broke Hotta-san, mentally.",
        "In fact, how did this episode not get shelved?",
        "“Err… by the way, how far did you go?”",
        "“Eh… It was only the tip, you know?”",
        "“You actually did it?!”",
        "…Eh?",
        "Eh? Eh? The tip? My tip?",
        "My tip graduated without me knowing it..?",
        "Yuuka’s words and actions were out of control. My brain started having delusions.",
        "Ah… I see…",
        "I guess I’m a real man now.",
        "I thought those things were still too early for us, but… I see.",
        "Goodbye, old me.",
        "“Really, it was just the tip, you know? With the tip of my finger, like this… I pecked my brother’s cheek.”",
        "“…Huh?”",
        "Hotta-san’s voice and mine were in perfect sync.",
        "But Yuuka continued to talk as usual.",
        "“Like I said, his sleeping face was so cute, I couldn’t hold myself back anymore. I poked him on his cheek once, with just the tip of my finger.”",
        "“…Hooh…”",
        "“Ah… are you doubting me? Your eyes are definitely the eyes of someone who is in doubt.”",
        "“No… haaaah…”",
        "“As expected of Hotta-san! You saw right through me. I’m sorry, that was a lie. I poked him on his cheek dozens of times!”",
        "“Ah… I see…”",
        "“Fuwaa… his cheeks were so soft, I thought I was in paradise! Ah, just talking to you like this reminds me of how soft his cheeks are…”",
        "“Okay, we’re going to have a commercial break.”",
        "―――――――――――――――――――――――――――――――",
        "『Retire right now! Magical Girls』will be released on Blu-ray soon!",
        "During the first production run, the first volume will include the mini-drama “Salmon Pink Days”.",
        "In addition, it will also come with a badge signed by the voice actors of the 3 magical girls for only 6,300 yen.",
        "Please watch our journey carefully. Seriously.",
        "If you don’t buy it… then we’ll have to do some cleaning ☆",
        "―――――――――――――――――――――――――――――――",
        "【TLN: Yes, everything above is the ad. I don’t really understand the last 2 lines, but it’s an ad so it shouldn’t be too important.】",
        "“Gyaaaaaaaa?!”",
        "“Uwaa?!”",
        "While I was absent-mindedly listening to the sudden commercial, a scream echoed through the air.",
        "I hurriedly turned around to see Yuuka, who had dropped her shopping bag on the floor.",
        "Her lips were quivering and her eyes behind her glasses were tearing up.",
        "“Eh, why… Didn’t I tell you not to listen to this?!”",
        "Yuuka quickly ran over to me and forcibly shut down my computer.",
        "“Ah?! There was still about 5 minutes left though!”",
        "“Baka! I told you not to listen to it, but why are you doing it anyway!”",
        "“Isn’t it the other way around? Why did you think I wouldn’t listen to this god-tier episode where Yuuna-chan is starring as a personality?”",
        "“Don’t you dare open that episode ever again!”",
        "Yuuka approached me with an unusually intense and menacing look on her face.",
        "“…By any chance, when you told me earlier to go shopping for about 30 minutes, was it just for this? I can’t believe you… You took advantage of my absence to betray me like this!”",
        "“Yeah. Why are you saying all that like I brought another girl home or something? Even though I was just listening to the online radio that Yuuka was in…”",
        "“Obviously because it’s embarrassing!”",
        "She raised her finger and puffed out her cheeks.",
        "And then… she quietly muttered.",
        "“…I got carried away and talked relentlessly about Yuu-kun… And also, because I’ll get exposed…”",
        "“Umm… you poked my cheeks while I was asleep…”",
        "“Ahhh!!! See, you did find out about it! You baka!”",
        "Yuuka flailed her arms around angrily.",
        "Then, right after that… she dejectedly hung her head low.",
        "“Do you hate me now?”",
        "“Why?”",
        "“I pounced on you in your sleep.”",
        "“No, I mean… It was only my cheek, so…”",
        "“Eh? So it’s okay for me to do that?!”",
        "In complete contrast from earlier, Yuuka now had a sparkling look in her eyes as she stared at me.",
        "Then, she gently raised her left hand.",
        "“…Don’t mind me~. So, if it’s only on your cheek, it’s completely fine for me to touch you~?”",
        "“What’s with your phrasing? The way you’re asking me makes me hesitate a bit, you know?!”",
        "“Aww…”",
        "Yuuka looked depressed and gloomy as she seemingly deflated in front of me.",
        "“Don’t get so blatantly depressed!”",
        "“So, can I do it?!”",
        "“Like I said…”",
        "And just like that, the cycle of Yuuka asking for permission and me arguing with her continued for about 30 minutes.",
        "Ah, and by the way.",
        "I properly finished the rest of the Alice Radio episode while Yuuka was taking a bath.",
        "◆",
        "I’m experimenting with using Italics to highlight MC’s thoughts. Also, thanks for the review, AJ1703! And thanks to everyone else for all the thanks in the comments! Feels weird thanking people for thanking me, but I still wanna do it. On a side note, I have a few more ideas on what novel I might pick up next, but I’d still love to hear some suggestions (if you got any).",
        "Ko-fi"
    ]
}