{
    "id": "chapter-6-theyre-going-to-find-out-about-our-engagement-anytime-soon-1-2",
    "title": "Chapter 6: They’re going to find out about our engagement anytime soon (1/2)",
    "content": [
        "“Mmm…”",
        "I went out of my room and down the stairs, still feeling sleepy as I rubbed my eyes.",
        "Hmm? Why is there a sound coming from my kitchen..?",
        "I was feeling confused since my mind was still hazy.",
        "“Ah! Good morning, Yuu-kun! Thank you for letting me use Nayu-chan’s room.”",
        "I saw a girl wearing a blazer in my kitchen.",
        "She had long, beautiful black hair reaching her shoulders.",
        "She had large, droopy eyes.",
        "She was slim, but she had a beautiful figure with curves in the right place.",
        "“Ahh… Good morning, Yuuka-chan.”",
        "It took me a while to realize that she was my fiance, Watanae Yuuka.",
        "Seeing me like that, Yuuka-chan pouted.",
        "“You took a while to answer me just now…”",
        "“No, you look so different from the impression you give off at school. I couldn’t tell it was you for a moment.”",
        "“Ah… You mean my hairstyle and my glasses? I see, I certainly do give off a different feel.”",
        "She puffed out her chest proudly and put on her glasses.",
        "Then, using her left hand, she held her long hair together. She quickly tied it up with her right hand.",
        "Ah. This is what Watanae-san looks like at school.",
        "Her ponytail does change her appearance considerably.",
        "But, her glasses have an even bigger effect. When she doesn’t have them on, her eyes look a little droopy. When she has them on, however… her eyes look slanted and sharp.",
        "“Woah… The aura around you just changed in an instant.”",
        "“Right? These glasses help me restrain myself.”",
        "Yuuka-chan puffed out her chest proudly… again.",
        "While I, on the other hand…",
        "“3D girls are scary…”",
        "“Scary?! Why?!”",
        "“The fact that girls can change their look in an instant… It’s nothing but scary. Isn’t that like Lupin?”",
        "【TLN: Never seen the Lupin series, but apparently he’s a professional at disguises.】",
        "“Girls can change even more when they put on make-up.”",
        "“…When it gets to that level, it’s basically horror. Like a ghost or something.”",
        "The fact that 3D girls can change their appearance so easily scares me.",
        "Yuuka-chan sighed at my reaction.",
        "“I mean, when I talk, I usually talk too much, and it’d be obvious that I’m not very good at socializing. That’s why I use these glasses to make myself act serious. When I act serious, I can hide the fact that I can’t communicate well. Putting on these glasses helps me become a serious and boring Watanae-san.”",
        "“Looking smart, huh..? I guess it’s better than going without your glasses.”",
        "I totally understood her point",
        "She’s trying to keep a distance from people by doing this, and I can really sympathize with her.",
        "We may be similar to each other in more ways than I thought.",
        "After we finished talking, we both left the house together.",
        "“2 fiances going to school together. It kind of feels like we’re doing something forbidden, huh?”",
        "Feeling embarrassed by her own words, Yuuka-chan smiled bashfully.",
        "Her gentle expression really is different from the Watanae-san at school.",
        "“So… You have to make sure no one else in our class finds out the fact that we’re engaged.”",
        "“..? Why?”",
        "Yuuka-chan just blankly stared at me, clearly not having thought of this beforehand.",
        "Walking right next to Yuuka-chan, I warned her of what might happen.",
        "“If we stand out too much, there will be lots of rumors, and everyone will start inquiring, asking questions, and stuff like that. Everyone will end up talking to you more.”",
        "“Uuu… That sounds bad.”",
        "“You’re also a voice actor, so you should probably keep a low profile.”",
        "Voice actors getting married can be a sensitive matter, so it’s really important to be careful about our relationship.",
        "“I got it! I’ll do my best to make us look like ordinary classmates. But, I’m not very good at this, so I’m sorry if I act cold or distant.”",
        "“No, I’m not good at this either, so I might give empty responses every now and then.”",
        "But, that wasn’t the only reason we agreed on this.",
        "Both of us exchanged our Line addresses yesterday.",
        "Line.",
        "It allows you to send messages and call people for free. It’s a pretty famous application.",
        "I don’t think there are any high school students who don’t use Line.",
        "Even I’m in my class’ Line group. But, my only other contacts are my dad and my sister.",
        "And, the one I just added yesterday… my fiance.",
        "“Okay! So, be careful when you’re at school.”",
        "“Okay, roger that!”",
        "The fact that both of us are engaged… We can’t let anyone else find out about that.",
        "Because if they do… I’m 1000% certain a hell full of bullying awaits me. Just like back then…",
        "◆",
        "So here’s chapter 5 after a pretty long break. The title is a little weird again, I still blame my lacking Japanese knowledge. And I did speed through this chapter… again. As always, corrections and suggestions are always welcome. I’ve already had one of those pointed out, and it was a pretty bad mistake. I’ll address this in the next chapter. Also, the author originally used Rine instead of Line. I still don’t know why they censor those, but I chose not to censor them."
    ]
}