{
    "id": "chapter-25-my-fiance-is-getting-along-with-my-cold-sister-1-2",
    "title": "Chapter 25: My fiance is getting along with my cold sister (1/2)",
    "content": [
        "Tomorrow is the end of the seemingly long yet short Golden Week.",
        "The sun has sunk, and the garden outside was completely dark.",
        "On the balcony of my house, I was vacantly admiring the beautiful scenery as I stretched my back.",
        "“Yuuka is late, huh…”",
        "It seems that she had another recording for Alice Stage today, and she left the house just before evening arrived.",
        "But, it’s almost 8:00 now… is she okay? Should I go and pick her up?",
        "“Worried?”",
        "I was pretty nervous as I heard a calm and composed voice from behind me.",
        "When I turned around, I saw Nayu with a bath towel draped over her shoulders.",
        "Her hair, which hadn’t been dried properly, was flatter than usual.",
        "“How does it feel to know that you’re lazing around at home while your wife is working late into the night?”",
        "“The way you’re saying that is misleading, you know?”",
        "“Tch.”",
        "She scratched her short, wet hair.",
        "Nayu was dressed casually in a white T-shirt and shorts as she briefly muttered.",
        "“I’m heading back tomorrow.”",
        "“I see. Take care of yourself.”",
        "“Mmm. Thanks.”",
        "I heard the sound of an airplane flying a distance away.",
        "You can’t see many stars in the city at night, but when I look at it like this, I guess it looks beautiful in its own way.",
        "“You know, about Yuuka…”",
        "“Yeah?”",
        "“How do you feel? About living together with her.”",
        "“Hmm… It’s not as bad as I thought… I guess. Spending time with her is pretty fun.”",
        "Maybe it was the calming night breeze, or maybe it was the ease of talking to my sister, but…",
        "Today, I was able to clearly express these feelings I usually keep bottled up inside me.",
        "“You know, I still vividly remember the time when you shut yourself at home, during middle school.”",
        "“You should just forget it… It’s basically a part of my dark past…”",
        "“You confessed to a b*tch, and on top of rejecting you, she had the nerve to tell everyone in your class about it.”",
        "“Calm down, Nayu. That was my fault too, since I was rushing things.”",
        "“But still. Nii-san, you were teased by everyone. You were bullied by everyone. You completely shut yourself in your room for about a week, and you wouldn’t come out at all.”",
        "“Well… I was mentally dead back then.”",
        "“And even now, you still are.”",
        "Nayu bluntly told me.",
        "I turned my gaze to my sister standing right next to me.",
        "I could sense an indescribable feeling of loneliness from her expression.",
        "“Sure, you’re able to go to school now. You look like you’re just fine on the outside. But, it’s only superficial… Back then, you used to smile a lot more. Your smile looked genuine and sincere.”",
        "“I haven’t changed that much, you know.”",
        "“Liar. I’m your sister, I know at least this much.”",
        "Back then, during winter, I was sure I had hit rock bottom.",
        "And that’s when 『Love Idol Dream! Alice Stage☆』…that’s when Yuuna-chan saved me.",
        "Because Yuuna-chan always smiled innocently at me.",
        "Because Yuuna-chan always talked to me cheerfully, with a smile on her face.",
        "I was able to get back up.",
        "I will never fall in love with anyone else. I will love this girl, on the other side of this screen, for the rest of my life.",
        "Because I resolved myself to do so… I became the person I am today.",
        "“Nii-san. Do you remember the time when I was little and I stopped going to school for a while?",
        "“Hmm? I think it was somewhere between your third or fourth grade in elementary, right? Yeah, I remember that.”",
        "“Back then, I was different. I was a lot more girly. I liked cute things, and stuff like that.”",
        "“Weren’t you just pretending to be cute back then?”",
        "“Shut up.”",
        "Back then, Nayu acted like a cute and innocent girl. She was a normal, typical girl you could find anywhere.",
        "But as the school year progressed, she became the target of more and more teasing.",
        "“That’s when I… made up my mind. I absolutely hated the thought of losing to people like them. So, I changed myself… and here I am.”",
        "“That’s true. Since then, you changed the way you talked and the way you looked. Just like how you are now.”",
        "“Right?”",
        "“Changing yourself like that… Nayu, are you satisfied?”",
        "Nayu thought for a bit before answering me.",
        "“Now that you mention it. I’m having lots of fun, for real.”",
        "“So, you want me to do the same thing you did?”",
        "“No… If I told you to go that far, that’d be arrogant of me.”",
        "Nayu had a distant, faraway look in her eyes.",
        "Then, she turned her head to the side and muttered.",
        "“I just want Nii-san to smile like you used to. That’s all. Even though our relationship isn’t great, we’re still siblings. I don’t really want to see Nii-san in pain, constantly suffering. That’s why, if you’re going to marry Yuuka-chan, at least…”",
        "Nayu turned around and faced me.",
        "Her smile had a trace of loneliness in it.",
        "“I want her to be a wife who can make Nii-san happy. That’s really all I want.”"
    ]
}